 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST COBOL.
 AUTHOR. BOUGEL.
 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
     SELECT TRICOB ASSIGN TO DSK DSK DSK RECORDING MODE IS ASCII.
     SELECT ENTCOB ASSIGN TO DSK ACCESS MODE IS INDEXED
       SYMBOLIC KEY IS REF-ARTICLE RECORD KEY IS REF OF FICHART.
     SELECT MAJCOB ASSIGN TO DSK RECORDING MODE IS ASCII.
     SELECT IMPR ASSIGN TO DSK.
 DATA DIVISION.
 FILE SECTION.
 FD  ENTCOB BLOCK CONTAINS 10 RECORD VALUE OF IDENTIFICATION "BIDCOBIDX"
           DATA RECORD FICHART.
 01  FICHART.
     02 COM PIC X.
     02 REF PIC X(4).
     02 LIB PIC X(20).
     02 QTE PIC 9(4).
     02 PRIX PIC 9(5)V99.
     02 STOCKMINI PIC 9(4).
 FD  MAJCOB VALUE OF IDENTIFICATION IS "MAJCOB   "
     DATA RECORD MAJART RECORD CONTAINS 9 TO 16 CHARACTERS.
 01  MAJART PIC X(16).
 SD  TRICOB DATA RECORD ARTTRI.
 01 ARTTRI.
     02 FILLER PIC X.
     02 CLE PIC X(4).
     02 FILLER PIC X(11).
 FD  IMPR VALUE OF IDENTIFICATION IS "RAPPORLPT" REPORT IS REPORT-STOCK.
 01  LIGNE PIC X(72).
 WORKING-STORAGE SECTION.
 77  REF-ARTICLE PIC X(4) VALUE ALL SPACES.
 77  PRIX-CALCULE PIC 9(5)V99 USAGE COMP.
 77  PRIX1 PIC 9(5)V99 USAGE COMP.
 77  COMPT-ENT PIC 9(3) USAGE COMP VALUE 0.
 77  COMPT-SOR PIC 9(3) USAGE COMP VALUE 0.
 77  COMMANDE PIC 9(4) USAGE COMP.
 77  MES1 PIC X(29) USAGE DISPLAY-6
           VALUE "CODE ERRONE DANS ARTICLE NO :".
 77  MES2 PIC X(38) USAGE DISPLAY-6
            VALUE "STOCK < STOCK MINIMAL POUR ARTICLE NO:".
 77  MES3 PIC X(44) USAGE DISPLAY-6
           VALUE "COMMANDE MINIMALE A PASSER POUR CET ARTICLE:".
 77  MES4 PIC X(33) USAGE DISPLAY-6
            VALUE "RUPTURE DE STOCK POUR ARTICLE NO:".
 77  MES5 PIC X(21) USAGE DISPLAY-6 VALUE "QUANTITE DISPONIBLE:".
 77  MES6 PIC X(13) USAGE DISPLAY-6 VALUE "CLE INVALIDE:".
 01  ARTICLE.
     02 CODEMVT PIC X.
 88  VALENT VALUE "E".
 88  VALSOR VALUE "S".
     02 REF PIC X(4).
     02 QTE PIC 9(4).
     02 PRIX PIC 9(5)V99.
 01  DATE.
     02  ANNEE PIC 99.
     02  MOIS PIC 99.
     02  JOUR PIC 99.
     02  FILLER PIC X(6).
 01  DATE-EDIT.
     02  JOUR PIC 99.
     02  FILLER PIC X VALUE "/".
     02  MOIS PIC 99.
     02  FILLER PIC X VALUE "/".
     02  ANNEE PIC 99.
 REPORT SECTION.
 RD  REPORT-STOCK CONTROL IS FINAL
     PAGE LIMIT IS 40 LINES
     HEADING 4 FIRST DETAIL 8 LAST DETAIL 35.
 01  TYPE REPORT HEADING .
     02  COLUMN 20 PIC X(13) VALUE "ETAT DU STOCK".
     02  LINE PLUS 2 COLUMN 20 PIC XX VALUE "AU".
     02  COLUMN 24 PIC X(8) SOURCE DATE-EDIT.
 01  TYPE REPORT FOOTING LINE PLUS 5.
     02  COLUMN 20 PIC X(14) VALUE "FIN DU RAPPORT".
 01  TYPE PAGE HEADING LINE 5.
     02  COLUMN 1 PIC X(9) VALUE "REFERENCE".
     02  COLUMN 15 PIC X(11) VALUE "DESIGNATION".
     02  COLUMN 34 PIC X(5) VALUE "STOCK".
     02  COLUMN 44 PIC X(4) VALUE "COUT".
     02  LINE PLUS 1 COLUMN 2 PIC X(7) VALUE "ARTICLE".
     02  COLUMN 17 PIC X(7) VALUE "ARTICLE".
     02  COLUMN 43 PIC X(5) VALUE "MOYEN".
 01  LIG TYPE DETAIL LINE PLUS 1.
     02  COLUMN 3 PIC X(4) SOURCE REF OF FICHART.
     02  COLUMN 10 PIC X(20) SOURCE LIB OF FICHART.
     02  COLUMN 35 PIC Z(4) SOURCE QTE OF FICHART.
     02  COLUMN 41 PIC Z(4)9.99 SOURCE PRIX OF FICHART.
 PROCEDURE DIVISION.
 RACINE SECTION 00.
 DEBUT.
     SORT TRICOB ON ASCENDING KEY CLE
     INPUT PROCEDURE IS ENTREE-TRI THRU FIN-MAJ
     OUTPUT PROCEDURE IS SORTIE-TRI THRU FIN-TRI.
     MOVE LOW-VALUES TO REF-ARTICLE.
     MOVE TODAY TO DATE.
     MOVE CORRESPONDING DATE TO DATE-EDIT.
     OPEN OUTPUT IMPR INPUT ENTCOB.
     INITIATE REPORT-STOCK.
 LEC-FICH.
     READ ENTCOB INVALID KEY GO TO FIN-FICH.
     GENERATE LIG.
     GO TO LEC-FICH.
 FIN-FICH.
     TERMINATE REPORT-STOCK.
     CLOSE ENTCOB IMPR.
     ENTER MACRO LOGOUT STOP RUN
 ENTREE-TRI.
      OPEN INPUT MAJCOB.
 LECT-MAJ.
     READ MAJCOB INTO ARTICLE AT END GO TO FIN-MAJ.
     ADD 1 TO COMPT-ENT.
     IF NOT VALENT AND NOT VALSOR GO TO ERR-MAJ.
     RELEASE ARTTRI FROM MAJART.
     GO TO LECT-MAJ.
 ERR-MAJ.
     DISPLAY MES1 COMPT-ENT.
     GO TO LECT-MAJ.
 FIN-MAJ.
     CLOSE MAJCOB.
 SORTIE-TRI.
     OPEN I-O ENTCOB.
 LECT-TRI.
     RETURN TRICOB INTO ARTICLE AT END GO TO FIN-TRI.
     ADD 1 TO COMPT-SOR.
     MOVE CLE TO REF-ARTICLE.
     READ ENTCOB INVALID KEY GO TO ERR-TRI.
     IF VALSOR GO TO SORTTRI.
     MOVE SPACE TO COM.
     MOVE PRIX OF FICHART TO PRIX-CALCULE.
     MOVE PRIX OF ARTICLE TO PRIX1.
     COMPUTE PRIX-CALCULE=((PRIX-CALCULE * QTE OF FICHART)+(PRIX1 * QTE
     OF ARTICLE))/(QTE OF FICHART + QTE OF ARTICLE).
     MOVE PRIX-CALCULE TO PRIX OF FICHART.
     ADD QTE OF ARTICLE TO QTE OF FICHART.
     GO TO ECRI-TRI.
 SORTTRI.
     IF QTE OF ARTICLE > QTE OF FICHART GO TO RUPSTOCK.
     SUBTRACT QTE OF ARTICLE FROM QTE OF FICHART.
     IF QTE OF FICHART > STOCKMINI GO TO ECRI-TRI.
     MOVE 1 TO COM.
     DISPLAY MES2 REF-ARTICLE.
     SUBTRACT QTE OF FICHART FROM STOCKMINI GIVING COMMANDE.
     DISPLAY MES3 COMMANDE.
     GO TO ECRI-TRI.
 RUPSTOCK.
     DISPLAY MES4 REF-ARTICLE.
     MOVE 1 TO COM.
     DISPLAY MES5 QTE OF FICHART.
     MOVE 0 TO QTE OF FICHART.
 ECRI-TRI.
     REWRITE FICHART INVALID KEY GO TO ERR-TRI.
     GO TO LECT-TRI.
 ERR-TRI.
     DISPLAY MES6 REF-ARTICLE.
     GO TO LECT-TRI.
 FIN-TRI.
     CLOSE ENTCOB.
