IDENTIFICATION DIVISION.
PROGRAM-ID.  COM.
AUTHOR. MUDGEY.
DATE-WRITTEN. 31-JAN-73.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    CHANNEL (1) IS TOP-OF-FORM.

INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IN-FILE              ASSIGN TO DSK;
    RECORDING MODE IS ASCII.



    SELECT K-IN                 ASSIGN TO DSK;
    RECORDING MODE IS ASCII.


    SELECT TEMPFIL              ASSIGN TO DSK,DSK,DSK;
    RECORDING MODE IS ASCII.

    SELECT L-PRINT              ASSIGN TO DSK;
    RECORDING MODE IS ASCII.

DATA DIVISION.
FILE SECTION.


FD  K-IN
     LABEL RECORDS ARE STANDARD
     VALUE OF ID IS "INVREG2  ".

01  IN-REC.
        02 FILLER       PIC X(125).

FD  IN-FILE
    LABEL RECORDS ARE STANDARD
    VALUE OF IDENTIFICATION IS "KAYREGDAT".

01 INPUT-RECORD.
        02 INVNO        PIC 9(6).
        02 FILLER       PIC X.
        02 CUST         PIC 9(4).
        02 FILLER       PIC X.
        02 DIST         PIC 99.
        02 FILLER       PIC X.
        02 SALNUM       PIC 9(4).
        02 FILLER       PIC X.
        02 NAME         PIC X(20).
        02 FILLER       PIC X.
        02 STAT         PIC X(4).
        02 FILLER       PIC X.
        02 PROD         PIC X(4).
        02 QTY-IN.
                03 A-FLD1       PIC S9(5).
                03 FILLER       PIC X.
                03 B-FLD1       PIC 9(3).
        02 AMT-IN.
                03 A-FLD2       PIC S9(10).
                03 FILLER       PIC X.
                03 B-FLD2       PIC 99.
        02 FILLER       PIC X.
        02 STATE        PIC 9(6).
        02 COST-IN.
                03 A-FLD3       PIC S9(10).
                03 FILLER       PIC X.
                03 B-FLD3       PIC 99.
        02 FILLER       PIC X.
        02 OWNER        PIC X(3).
        02 FILLER       PIC X.
        02 SN           PIC X(10).
        02 CRAT-IN.
                03 A-FLD4       PIC S9(3).
                03 FILLER       PIC X.
                03 B-FLD4       PIC 99.
        02 CAMT-IN.
                03 A-FLD5       PIC S9(8).
                03 FILLER       PIC X.
                03 B-FLD5       PIC 99.



SD  TEMPFIL.

01  SORT-REC; DISPLAY-7.
        02 FILLER       PIC X(12).
        02 NO1          PIC 99.
        02 FILLER       PIC X.
        02 NO2          PIC 9(4).
        02 FILLER       PIC X(22).
        02 NO3          PIC X(4).
        02 FILLER       PIC X.
        02 NO4          PIC X(4).
        02 FILLER       PIC X(47).
        02 NO5          PIC X(10).
        02 FILLER       PIC X(17).


FD  L-PRINT
    LABEL RECORDS ARE STANDARD
    VALUE OF IDENTIFICATION IS "REPORTCOM".

01  PRINT-OUT; DISPLAY-7.
        02 FILLER       PIC X(130).

01  OUT-LINE; DISPLAY-7.
        02 FILLER       PIC X(130).

01  PRINT-LINE; DISPLAY-7.
        02 FILLER       PIC X(130).

01  NUM-LINE; DISPLAY-7.
        02 NUM-FIRST            PIC X(12).
        02 FILLER               PIC X(105).
        02 NUM-HEAD             PIC X(5).
        02 HEADER-PAGE          PIC Z(3).


WORKING-STORAGE SECTION.
77  HOLDER                      PIC S9(10)V99.
77  LAS-REG                     PIC 9.
77  REGION                      PIC 9.
77  FLAG                        PIC 99.
77  FLAG2                       PIC 99.
77  LAS-SAL                     PIC 9(4).
77  LAS-DIST                    PIC 99.
77  SAVE-REG                    PIC 99.
77  SAVE-DIST                    PIC 99.
77  SAVE-SAL                    PIC 9(4).

77  C-FLD1      PIC S9(5); COMP.
77  C-FLD2      PIC S9(5); COMP.
77  C-FLD3      PIC S9(5); COMP.
77  C-FLD4      PIC S9(5); COMP.
77  C-FLD5      PIC S9(5); COMP.


77  TEMP-A      PIC S9(5); COMP.
77  ETEMP       PIC S9(5); COMP.

77  COMRAT              PIC S9(10)V99; COMP.
77  COMAMT              PIC S9(10)V99; COMP.
77  COST                PIC S9(10)V99; COMP.
77  QTY                 PIC S9(5)V999; COMP.
77  AMT                 PIC S9(10)V99; COMP.

77  LAS-STAT            PIC X(4); DISPLAY-7.

77  TEMP1                       PICTURE S9(10)V99; COMPUTATIONAL.
77  PAGE-COUNT                  PICTURE S9(3); COMPUTATIONAL.
77  LINE-COUNT                  PICTURE S99; COMPUTATIONAL.

77  SAVE-01                     PICTURE X(4).
77  SAVE-02                     PICTURE X(4).
77  SAVE-LINE                   PIC X(130).
77  DASHES                       PICTURE X(10);
        VALUE "----------".





01  HOLD-LINE;DISPLAY-7.
        02 HELP         PIC X(130).




01  LEVEL-REG-ACS; COMPUTATIONAL.
        02 ACCUMULATOR-1        PIC S9(10)V99.
        02 ACCUMULATOR-2        PIC S9(10)V99.
        02 ACCUMULATOR-3        PIC S9(10)V99.
        02 ACCUMULATOR-4        PIC S9(10)V99.

01  LEVEL-DIST-ACS; COMPUTATIONAL.
    02 ACCUMULATOR-1            PIC S9(10)V99.
    02 ACCUMULATOR-2            PIC S9(10)V99.
    02 ACCUMULATOR-3            PIC S9(10)V99.
    02 ACCUMULATOR-4            PIC S9(10)V99.

01  LEVEL-SAL-ACS; COMPUTATIONAL.
    02 ACCUMULATOR-1             PIC S9(10)V99.
    02 ACCUMULATOR-2             PICTURE S9(10)V9(2).
    02 ACCUMULATOR-3             PICTURE S9(10)V99.
    02 ACCUMULATOR-4             PICTURE S9(10)V99.

01  LEVEL-F-ACS; COMPUTATIONAL.
    02 ACCUMULATOR-1             PICTURE S9(10)V99.
    02 ACCUMULATOR-2             PICTURE S9(10)V9(2).
    02 ACCUMULATOR-3             PICTURE S9(10)V99.
    02 ACCUMULATOR-4             PICTURE S9(10)V99.

01  HEADER.
    02 FILL PIC X(41); VALUE " INVNO CUST PL SLMN      CUSTOMER    ".
    02 FILL PIC X(29); VALUE "STAT PROD     QTY     AMOUNT ".
    02 FILL PIC X(33); VALUE "      LOC        COST  OWN   S/N".
    02 FILL PIC X(30); VALUE "     RATE     AMOUNT".


01  HEAD-OUT-1.

        02 FILLER               PIC X(43).
        02 FILLER               PIC X(26);
            VALUE "     COMMISSION REPORT".


01  PRINT-BREAK-1.
        02 FILLER       PIC X(5).
        02 LINEOUT-1    PIC X(20).
        02 NOUT         PIC Z(4).


01  PRINT-BREAK-2.
        02 FILLER       PIC X(10).
        02 FILLER       PIC X(16); VALUE "AMOUNT (- TAX): ".
        02 NON-TAX      PIC -(10).99.
        02 FILLER       PIC X(20).
        02 FILLER       PIC X(10); VALUE "TAX ONLY: ".
        02 TAX-ONLY     PIC -(10).99.


01  PRINT-BREAK-3.
        02 FILLER       PIC X(10).
        02 FILLER       PIC X(16); VALUE "AMOUNT (+ TAX): ".
        02 BIG-AMT      PIC -(10).99.
        02 FILLER       PIC X(12).
        02 FILLER       PIC X(18); VALUE "TOTAL COMMISSION: ".
        02 COMMISSION   PIC -(10).99.



PROCEDURE DIVISION.

ONLY SECTION.
START.
        DISPLAY " ". DISPLAY " ".
        DISPLAY "SORTING INVREG..." WITH NO ADVANCING.


   SORT TEMPFIL ON ASCENDING KEY NO1,NO2,NO3,NO4,NO5 USING K-IN
        GIVING IN-FILE.

RPT.
        DISPLAY " ". DISPLAY " ".
        DISPLAY "GENERATING REPORT.COM ..." WITH NO ADVANCING.

    OPEN INPUT IN-FILE.
    OPEN OUTPUT L-PRINT.

    MOVE SPACES TO INPUT-RECORD.
    MOVE ZERO TO PAGE-COUNT.
    PERFORM PL-HDR THRU PL-EXIT.

READ-IN.
        MOVE REGION TO LAS-REG.
        MOVE DIST TO LAS-DIST.
        MOVE SALNUM TO LAS-SAL.
        READ IN-FILE; AT END GO TO LEVEL-SAL-BREAK.


        COMPUTE REGION = DIST / 10.
  COMPUTE C-FLD1 = B-FLD1 * 10.
  COMPUTE C-FLD2 = B-FLD2 * 10.
  COMPUTE C-FLD3 = B-FLD3 * 10.
  COMPUTE C-FLD4 = B-FLD4 * 10.
  COMPUTE C-FLD5 = B-FLD5 * 10.

                COMPUTE ETEMP = B-FLD1.
                COMPUTE ETEMP = ETEMP * 10.
        IF A-FLD1 IS NOT LESS THAN ZERO GO TO POSIT.

                COMPUTE ETEMP = ETEMP * 2.
                COMPUTE ETEMP = C-FLD1 - ETEMP.
POSIT.

                COMPUTE QTY = A-FLD1 * 1000 +  ETEMP.
                COMPUTE QTY = QTY / 1000.

                COMPUTE ETEMP = B-FLD2.
                COMPUTE ETEMP = ETEMP * 10.

        IF A-FLD2 = 0 AND STAT = "CRED" GO TO POS2.
        IF A-FLD2 IS NOT LESS THAN ZERO GO TO POSIT2.
POS2.

                COMPUTE ETEMP = ETEMP * 2.
                COMPUTE ETEMP = C-FLD2 - ETEMP.
POSIT2.
                COMPUTE AMT = A-FLD2 * 1000  + ETEMP.
                COMPUTE AMT = AMT / 1000.

                COMPUTE ETEMP = B-FLD3.
                COMPUTE ETEMP = ETEMP * 10.
        IF A-FLD3 = 0 AND STAT = "CRED" GO TO POS3.
        IF A-FLD3 IS NOT LESS THAN ZERO GO TO POSIT3.
POS3.

                COMPUTE ETEMP = ETEMP * 2.
                COMPUTE ETEMP = C-FLD3 - ETEMP.
POSIT3.
                COMPUTE COST = A-FLD3 * 1000  + ETEMP.
                COMPUTE COST = COST / 1000.
                COMPUTE ETEMP = B-FLD4.
                COMPUTE ETEMP = ETEMP * 10.

        IF A-FLD4 = 0 AND STAT = "CRED" GO TO POS4.
        IF A-FLD4 IS NOT LESS THAN ZERO GO TO POSIT4.
POS4.
                COMPUTE ETEMP = ETEMP * 2.
                COMPUTE ETEMP = C-FLD4 - ETEMP.
POSIT4.
                COMPUTE COMRAT = A-FLD4 * 1000 + ETEMP.
                COMPUTE COMRAT = COMRAT / 1000.


                COMPUTE ETEMP = B-FLD5.
                COMPUTE ETEMP = ETEMP * 10.

        IF A-FLD5 = 0 AND STAT = "CRED" GO TO POS5.
        IF A-FLD5 IS NOT LESS THAN ZERO GO TO POSIT5.
POS5.
                COMPUTE ETEMP = ETEMP * 2.
                COMPUTE ETEMP = C-FLD5 - ETEMP.
POSIT5.
                COMPUTE COMAMT = A-FLD5 * 1000 + ETEMP.
                COMPUTE COMAMT = COMAMT / 1000.


INIT-SW. GO TO RESET-INIT.
        NOTE AFTER THE FIRST READ, INIT-SW WILL GO TO COMPARE.
RESET-INIT. ALTER INIT-SW TO PROCEED TO COMPARE.
    GO TO RESET-LEVEL-F.

COMPARE.

    IF SAVE-REG IS NOT EQUAL TO REGION
        ALTER LEVEL-REG-SW TO PROCEED TO RESET-LEVEL-REG;
        GO TO LEVEL-SAL-BREAK.


        IF SAVE-DIST IS NOT EQUAL TO DIST
                ALTER LEVEL-DIST-SW TO PROCEED TO RESET-LEVEL-DIST;
                GO TO LEVEL-SAL-BREAK.

    IF SAVE-SAL IS NOT EQUAL TO SALNUM
        ALTER LEVEL-SAL-SW TO PROCEED TO RESET-LEVEL-SAL;
        GO TO LEVEL-SAL-BREAK.


    IF SAVE-01 IS NOT EQUAL TO STAT
        MOVE SPACES TO PRINT-LINE; PERFORM PRINT-1 THRU P1-END.
        MOVE STAT TO SAVE-01.

    IF SAVE-02 IS NOT EQUAL TO PROD
        MOVE SPACES TO PRINT-LINE; PERFORM PRINT-1 THRU P1-END.
        MOVE PROD TO SAVE-02.



PRINT-DETAIL.

    IF STAT = " TAX" GO TO SKIP1.

        ADD AMT TO ACCUMULATOR-1 OF LEVEL-SAL-ACS.
        GO TO SKIP2.

SKIP1.

        ADD AMT TO ACCUMULATOR-2 OF LEVEL-SAL-ACS.

SKIP2.
        ADD AMT TO ACCUMULATOR-3 OF LEVEL-SAL-ACS.

        ADD COMAMT TO ACCUMULATOR-4 OF LEVEL-SAL-ACS.


        MOVE SPACES TO PRINT-LINE.
        MOVE INPUT-RECORD TO PRINT-LINE.
        PERFORM PRINT-1 THRU P1-END.

    GO TO READ-IN.


LEVEL-SAL-BREAK.


    MOVE ACCUMULATOR-1 OF LEVEL-SAL-ACS TO NON-TAX.
    MOVE ACCUMULATOR-2 OF LEVEL-SAL-ACS TO TAX-ONLY.
    MOVE ACCUMULATOR-3 OF LEVEL-SAL-ACS TO BIG-AMT.
    MOVE ACCUMULATOR-4 OF LEVEL-SAL-ACS TO COMMISSION.

    PERFORM PRINT-1 THRU P1-END 3 TIMES.
    MOVE "TOTAL FOR SALESMAN: " TO LINEOUT-1.
    MOVE LAS-SAL TO NOUT.


    MOVE PRINT-BREAK-1 TO PRINT-LINE.
    PERFORM PRINT-1 THRU P1-END.
    MOVE SPACES TO PRINT-LINE.
    PERFORM PRINT-1 THRU P1-END.
    MOVE PRINT-BREAK-2 TO PRINT-LINE.
    PERFORM PRINT-1 THRU P1-END.
    MOVE SPACES TO PRINT-LINE.
    MOVE PRINT-BREAK-3 TO PRINT-LINE.
    PERFORM PRINT-1 THRU P1-END.
    MOVE SPACES TO PRINT-LINE.
    WRITE PRINT-LINE BEFORE TOP-OF-FORM.
        MOVE 1 TO FLAG2.
        MOVE 1 TO FLAG.
        MOVE -1 TO LINE-COUNT.


    ADD CORRESPONDING LEVEL-SAL-ACS TO LEVEL-DIST-ACS.

LEVEL-SAL-SW. GO TO. NOTE GO TO RESET-LEVEL-SAL OR LEVEL-DIST-BREAK.

LEVEL-DIST-BREAK.

    MOVE ACCUMULATOR-1 OF LEVEL-DIST-ACS TO NON-TAX.
    MOVE ACCUMULATOR-2 OF LEVEL-DIST-ACS TO TAX-ONLY.
    MOVE ACCUMULATOR-3 OF LEVEL-DIST-ACS TO BIG-AMT.
    MOVE ACCUMULATOR-4 OF LEVEL-DIST-ACS TO COMMISSION.
        PERFORM PRINT-1 THRU P1-END 7 TIMES.
        MOVE "TOTAL FOR DISTRICT: " TO LINEOUT-1.
        MOVE LAS-DIST TO NOUT.
        MOVE SPACES TO PRINT-LINE.
        MOVE PRINT-BREAK-1 TO PRINT-LINE.
        PERFORM PRINT-1 THRU P1-END.
        MOVE SPACES TO PRINT-LINE.
        PERFORM PRINT-1 THRU P1-END.
        MOVE PRINT-BREAK-2 TO PRINT-LINE.
        PERFORM PRINT-1 THRU P1-END .
        MOVE SPACES TO PRINT-LINE.
        MOVE PRINT-BREAK-3 TO PRINT-LINE.
        PERFORM PRINT-1 THRU P1-END.
        MOVE SPACES TO PRINT-LINE.
        WRITE PRINT-LINE BEFORE TOP-OF-FORM.
        MOVE 1 TO FLAG2.
        MOVE 1 TO FLAG.
        MOVE -1 TO LINE-COUNT.

    ADD CORRESPONDING LEVEL-DIST-ACS TO LEVEL-REG-ACS.

LEVEL-DIST-SW. GO TO. NOTE GO TO RESET-LEVEL-DIST OR LEVEL-REG-BREAK.

LEVEL-REG-BREAK.

        MOVE ACCUMULATOR-1 OF LEVEL-REG-ACS TO NON-TAX.
        MOVE ACCUMULATOR-2 OF LEVEL-REG-ACS TO TAX-ONLY.
        MOVE ACCUMULATOR-3 OF LEVEL-REG-ACS TO BIG-AMT.
        MOVE ACCUMULATOR-4 OF LEVEL-REG-ACS TO COMMISSION.
        PERFORM PRINT-1 THRU P1-END 7 TIMES.
        MOVE "TOTAL FOR REGION: " TO LINEOUT-1.
        MOVE LAS-REG TO NOUT.
        MOVE SPACES TO PRINT-LINE.
        MOVE PRINT-BREAK-1 TO PRINT-LINE.
        PERFORM PRINT-1 THRU P1-END.
        MOVE SPACES TO PRINT-LINE.
        PERFORM PRINT-1 THRU P1-END.
        MOVE PRINT-BREAK-2 TO PRINT-LINE.
        PERFORM PRINT-1 THRU P1-END.
        MOVE SPACES TO PRINT-LINE.
        MOVE PRINT-BREAK-3 TO PRINT-LINE.
        PERFORM PRINT-1 THRU P1-END.
        MOVE SPACES TO PRINT-LINE.
        WRITE PRINT-LINE BEFORE TOP-OF-FORM.
        MOVE 1 TO FLAG2.
        MOVE 1 TO FLAG.
        MOVE -1 TO LINE-COUNT.


  ADD CORR LEVEL-REG-ACS TO LEVEL-F-ACS.

LEVEL-REG-SW.  GO TO.  NOTE  GOTO TO RESET-REG OR LEVEL-F-BRK.

LEVEL-F-BREAK.
    MOVE SPACES TO PRINT-LINE.
        WRITE PRINT-LINE BEFORE TOP-OF-FORM.
        WRITE PRINT-LINE BEFORE TOP-OF-FORM.


        GO TO FINISH.





RESET-LEVEL-F.
        MOVE LOW-VALUES TO LEVEL-F-ACS.


RESET-LEVEL-REG.
        MOVE LOW-VALUES TO LEVEL-REG-ACS.
        MOVE REGION TO SAVE-REG.
        ALTER LEVEL-REG-SW TO PROCEED TO LEVEL-F-BREAK.

RESET-LEVEL-DIST.
        MOVE LOW-VALUES TO LEVEL-DIST-ACS.
        MOVE DIST TO SAVE-DIST.
    ALTER LEVEL-DIST-SW TO PROCEED TO LEVEL-REG-BREAK.

RESET-LEVEL-SAL.
        MOVE LOW-VALUES TO LEVEL-SAL-ACS.
        MOVE SALNUM TO SAVE-SAL.
        MOVE STAT TO SAVE-01.
        MOVE PROD TO SAVE-02.
    ALTER LEVEL-SAL-SW TO PROCEED TO LEVEL-DIST-BREAK.
    GO TO PRINT-DETAIL.



PRINT-1. SUBTRACT 1 FROM LINE-COUNT.
        IF LINE-COUNT IS NEGATIVE PERFORM PAGER THRU P-EXIT.
RET1.
        WRITE PRINT-LINE.
        MOVE SPACES TO PRINT-LINE.
P1-END.  EXIT.


PL-HDR. MOVE SPACES TO PRINT-LINE.

PRINT-CH-1. WRITE PRINT-LINE BEFORE TOP-OF-FORM.
    ADD 1 TO PAGE-COUNT; MOVE PAGE-COUNT TO HEADER-PAGE.
    MOVE "PAGE" TO NUM-HEAD.
        MOVE "+PIT REPORT+" TO NUM-FIRST.
    WRITE NUM-LINE BEFORE ADVANCING 4 LINES.
        IF PAGE-COUNT > 1 GO TO SKIP-HEAD.
        MOVE HEAD-OUT-1 TO PRINT-LINE.
        WRITE PRINT-LINE BEFORE ADVANCING 5 LINES.
        MOVE SPACES TO PRINT-LINE.
SKIP-HEAD.
    MOVE HEADER TO PRINT-LINE.
    WRITE PRINT-LINE BEFORE ADVANCING 4 LINES.
        MOVE SPACES TO PRINT-LINE.
    MOVE 44 TO LINE-COUNT.

PL-EXIT.  EXIT.


PAGER.
        MOVE PRINT-LINE TO HELP.

        MOVE SPACES TO PRINT-OUT.
        IF FLAG IS NOT EQUAL TO 1 WRITE
                PRINT-LINE BEFORE ADVANCING 3 LINES.
        MOVE 0 TO FLAG.
        ADD 1 TO PAGE-COUNT; MOVE PAGE-COUNT TO HEADER-PAGE.
        MOVE "+PIT REPORT+" TO NUM-FIRST.
        MOVE "PAGE" TO NUM-HEAD.
        MOVE NUM-LINE TO PRINT-OUT.
        WRITE PRINT-OUT BEFORE 3 LINES.
        MOVE SPACES TO PRINT-OUT.
        MOVE HEADER TO PRINT-OUT.
        WRITE PRINT-OUT BEFORE ADVANCING 4 LINES.
        MOVE SPACES TO OUT-LINE.
        MOVE SPACES TO PRINT-OUT.
        MOVE 49 TO LINE-COUNT.
        MOVE HELP TO PRINT-LINE.
P-EXIT.  EXIT.

FINISH.
    CLOSE IN-FILE.
    CLOSE L-PRINT.
    DISPLAY " ".
    DISPLAY "FINISHED.".
    STOP RUN.
   