 IDENTIFICATION DIVISION.
 PROGRAM-ID. MISE-A-JOUR.
 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
     SELECT F-OLD ASSIGN TO DSK.
     SELECT F-MOVE ASSIGN TO DSK.
     SELECT F-NEW ASSIGN TO TTY.
 DATA DIVISION.
 FILE SECTION.
 FD  F-OLD VALUE OF ID "STOCK DAT"
     DATA RECORD IS OLDSTOCK.
 01  OLDSTOCK.
     02  IDENTO.
         03  REFO PIC 9(4).
         03  AUTO PIC X(20).
         03  TITO PIC X(20).
     02  SMNO PIC 99.
     02  SMXO PIC 99.
     02  SRO PIC S99.
     02  NBO PIC 99.
 FD  F-MOVE VALUE OF ID "MOUV  DAT"
     DATA RECORD IS MOVESTOCK.
 01  MOVESTOCK.
     02  IDENTM.
         03 REFM PIC 9(4).
         03 AUTM PIC X(20).
         03 TITM PIC X(20).
     02  SMNM PIC 99.
     02  SMXM PIC 99.
     02  SRM PIC S99.
     02  NBM PIC 99.
 FD  F-NEW VALUE OF ID "NEWSTKDAT"
     DATA RECORD IS NEWSTOCK.
 
 01  NEWSTOCK.
     02 IDENTN.
         03 REFN PIC 9999.
         03 AUTN PIC X(20).
         03 TITN PIC X(20).
     02  SMNN PIC 99.
     02  SMXN PIC 99.
     02  SRN PIC S99.
     02  SRN PIC 99.
 WORKING-STORAGE SECTION.
 77  REAL PIC S99 VALUE 0.
 PROCEDURE DIVISION.
 OUVERTURE.
     OPEN INPUT F-OLD
     OPEN INPUT F-MOVE
     OPEN OUTPUT F-NEW.
 LEC-OLD.
     READ F-OLD AT END MOVE HIGH-VALUE TO REFO.
 LEC-MOVE.
     READ F-MOVE AT END MOVE HIGH-VALUE TO REFM.
 TEST.
     IF REFM = REFO GO TO T1 ELSE GO TO T2.
 T1.
     IF REFM EQUAL TO HIGH-VALUE GO TO FIN.
     ADD SRM TO REAL
     MOVE REAL TO SRO
     MOVE OLDSTOCK TO NEWSTOCK



     WRITE NEWSTOCK AFTER ADVANCING 1 LINE GO TO LEC-OLD.
 T2.
     IF REFM < REFO MOVE MOVESTOCK TO NEWSTOCK
     WRITE NEWSTOCK AFTER ADVANCING 1 LINE
     GO TO LEC-MOVE.
     MOVE OLDSTOCK TO NEWSTOCK
     WRITE NEWSTOCK AFTER ADVANCING 1 LINE
     READ F-OLD AT END MOVE HIGH-VALUE TO REFO
     GO TO TEST.
 FIN.
     STOP RUN.
