IDENTIFICATION DIVISION.
PROGRAM-ID. QUOTRM.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
SPECIAL-NAMES.
    CONSOLE  IS INTYPER.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT Q-A-FILE ASSIGN TO DSK
    RECORDING MODE IS ASCII
    ACCESS IS INDEXED    SYMBOLIC KEY  Q-A-KEY
    RECORD KEY IS QA-REC-KEY.
DATA DIVISION.
FILE SECTION.
FD  Q-A-FILE
    BLOCK CONTAINS 5 RECORD
    LABEL RECORDS ARE STANDARD
    VALUE OF ID 'ZURIQAIDX'
    DATA RECORD IS Q-A-REC.
01  Q-A-REC USAGE DISPLAY-7.
  03 QA-REC-KEY   PIC 9(4).
   03  QA-KEYWORD   PIC X(6).
   03  QA-EDIT-TYPE PIC X.
   03  QA-SEC-NO    PIC X.
   03  Q-A-MESG   PIC  X(320).
  03 MESG-QA REDEFINES Q-A-MESG.
    07 FILLER PIC X(4).
    07 BYTE-CNT   PIC 9(8).
    07  CHARS   PIC X(320).
WORKING-STORAGE SECTION.
01  WKS-SECT.
 02 INX-CHR   PIC 9(8).
 02  CHG-SW   PIC 9  VALUE ZERO.
 02  INPUT-TYPE-SW   PIC 9 VALUE ZERO.
 02  CNT-5   PIC 9 VALUE 0.
 02  INX-KEYWORD    PIC 999.
 02 Q-A-KEY   PIC 9(4) USAGE DISPLAY-7.
 02  INX-IO    PIC 999.
 02  BLANK-CNT    PIC 9.
 02  INX-KEYWORD-WK   PIC 999 VALUE ZERO.
 02  INX-D-TYPE    PIC 999 VALUE ZERO.
 02  INX-NUM    PIC 99.
 02  INX-B1  PIC 9.
 02 INX-B2  PIC 9.
 02  QT    PIC 9.
 02  REMD    PIC 9.
 02  SAVE-IX-IO    PIC 999.
 02  INX-Y     PIC 999.
 02  Y-SW    PIC 9   VALUE ZERO.
 02  Y-SW2    PIC 9 VALUE ZERO.
 02  INX-T   PIC 999 VALUE ZERO.
 02  BAD-NUMERIC    PIC X(22)  VALUE
    "  INVALID NUMERIC DATA".
 02  ERR-SW    PIC 9  VALUE ZERO.
 02  INX-A     PIC 99 VALUE ZERO.
 02  KEY-GO-TO    PIC 999.
 02  PRE-SW    PIC 9  VALUE ZERO.
 02  EDIT-TYPE-WK    PIC X.
 02  OPEN-SW    PIC 9  VALUE ZERO.
 02  TESTC   PIC 99  VALUE ZERO.
 02  INX-C  PIC  99  VALUE ZERO.
 02  C-SW  PIC 9 VALUE ZERO.
 02  QUOTRM-1  PIC X(10) VALUE "GOT-QUOTRM".
 02  F-TYPE PIC X VALUE SPACE.
 02  MSG-0 PIC X(9) VALUE "SECTION  ".
 02  MSG-1 PIC X(9) VALUE "LOCATION ".
 02  MSG-2 PIC X(9) VALUE "CLASS    ".
 02  INVAL-KW-SW  PIC 9 VALUE ZERO.
 02  B-EDIT-SW  PIC 9 VALUE ZERO.
 02  DATE-WORKS.
 03 DATE-WORK.
   05  FILLER    PIC 9(6)   VALUE 013102.
   05  FEB-WK    PIC 99.
   05  FILLER    PIC X(40)
    VALUE "0331043005310630073108310930103111301231".
 03 WORK-DATE REDEFINES DATE-WORK  OCCURS 12 INDEXED BY INX-DATE.
   05  MO-WK    PIC 99.
   05  DA-WK    PIC 99.
  03  VERB-TABLE.
   05  FILLER  PIC X(10) VALUE "    ".
    05 FILLER  PIC X(10) VALUE "ENTER    ".
    05 FILLER  PIC X(10) VALUE "INVALID   ".
   03 TABLE-BERB REDEFINES VERB-TABLE.
    05 VERB-TBL OCCURS   3   PIC X(10).
 03 A-TYPE-40.
   05  A-TYPE  OCCURS 40 TIMES   PIC X.
  03 PROMPT-AREA.
   05 PROMPT-VERB   PIC X(10).
    05 PROMPT-NOUN  PIC X(320).
    05 FILER2  REDEFINES PROMPT-NOUN.
    07 PROMPT-NUN PIC X OCCURS 320 INDEXED BY INX-NUN.
  03 DISPLAY-AREA.
   05 DISPLY-1  PIC X(80).
 05  DISPLY-1A REDEFINES DISPLY-1.
   10  DISP-1A-22  PIC X(23).
    10  DISP-1A-9  PIC X(9).
    10  DISP-1A-3  PIC ZZ9.
   10  DISP-1A-39   PIC X(35).
    10  FILLER PIC X(10).
   05 DISPLY-2  PIC X(80).
   05 DISPLY-3  PIC X(80).
    05 DISPLY-4   PIC X(80).
  03 AREA-DISPLAY REDEFINES DISPLAY-AREA.
    05 DISPY  PIC X OCCURS 320 INDEXED BY INX-DISPLAY.
 02  KEYWORD-TABLE.
 03 TABLE-KEYWORDS.
    05  FILLER PIC X(12) VALUE "S1BCVG0001F1".
    05  FILLER PIC X(12) VALUE "S1CCVG0002F1".
    05  FILLER  PIC X(12) VALUE "S1GCVG0003F1".
    05  FILLER PIC X(12) VALUE "S1OCVG0004F1".
    05  FILLER PIC X(12) VALUE "S1TCVG0005F1".
    05  FILLER PIC X(12) VALUE "S1ICVG0006F1".
    05  FILLER PIC X(12) VALUE "S1RCVG0007F1".
    05  FILLER PIC X(12) VALUE "S1VCVG0008F1".
    05  FILLER PIC X(12) VALUE "S1PCVG0009F1".
   05  FILLER PIC X(12) VALUE "EMPLOY0010A2".
   05  FILLER PIC X(12) VALUE "CPLLIM0011N2".
   05  FILLER PIC X(12) VALUE "ACRES 0012A2".
   05  FILLER PIC X(12) VALUE "PERLIM0013N2".
   05  FILLER PIC X(12) VALUE "MEDLIM0014T2".
   05  FILLER PIC X(12) VALUE "MEDPAY0015A2".
   05  FILLER PIC X(12) VALUE "PERINJ0016A2".
   05  FILLER PIC X(12) VALUE "OTHRAI0017A2".
   05  FILLER PIC X(12) VALUE "NUMBER0018N2".
   05  FILLER PIC X(12) VALUE "USAGE 0019A2".
    05  FILLER  PIC X(12) VALUE "GVTAI 0020A2".
  05 FILLER PIC X(12) VALUE "ARCHAI0021A2".
    05  FILLER PIC X(12) VALUE "S1CCVG0022F1".
  05 FILLER PIC X(12) VALUE "PDLIM 0023T2".
  05 FILLER PIC X(12) VALUE "BILIM 0024T2".
  05 FILLER PIC X(12) VALUE "PDMIN 0025N2".
  05 FILLER PIC X(12) VALUE "PDRATE0026N2".
  05 FILLER PIC X(12) VALUE "BIMIN 0027N2".
  05 FILLER PIC X(12) VALUE "BIRATE0028N2".
  05 FILLER PIC X(12) VALUE "CLASCD0029C2".
  05 FILLER PIC X(12) VALUE "TERR  0030T2".
  05 FILLER PIC X(12) VALUE "EXPOSE0031N2".
  05 FILLER PIC X(12) VALUE "LESSOR0032A2".
  05 FILLER PIC X(12) VALUE "DPD   0033A2".
  05 FILLER PIC X(12) VALUE "DEDTYP0034A2".
  05 FILLER PIC X(12) VALUE "DEDUCT0035N2".
  05 FILLER PIC X(12) VALUE "XCU   0036A2".
  05 FILLER PIC X(12) VALUE "WATER 0037A2".
  05 FILLER PIC X(12) VALUE "VBASE 0038N2".
  05 FILLER PIC X(12) VALUE "VENDOR0039A2".
    05  FILLER  PIC X(12) VALUE "GVTOCP0040A2".
  05 FILLER PIC X(12) VALUE "PERMIT0041N2".
  05 FILLER PIC X(12) VALUE "PRODNO0042N0".
  05 FILLER PIC X(12) VALUE "APPNAM0043A0".
  05 FILLER PIC X(12) VALUE "APPAD10044A0".
  05 FILLER PIC X(12) VALUE "APPAD20045A0".
  05 FILLER PIC X(12) VALUE "APPST 0046A0".
  05 FILLER PIC X(12) VALUE "APPZIP0047N0".
  05 FILLER PIC X(12) VALUE "EFFDAT0048D0".
  05 FILLER PIC X(12) VALUE "MODQOT0049N0".
  05 FILLER PIC X(12) VALUE "QOTSLT0050N0".
  05 FILLER PIC X(12) VALUE "QOTPLN0051A0".
  05 FILLER PIC X(12) VALUE "COVCHG0052A2".
  05 FILLER PIC X(12) VALUE "SEQNCE0053N2".
  05 FILLER PIC X(12) VALUE "MORE  0054A2".
    05  FILLER PIC X(12) VALUE "S1NCVG0055F1".
    05  FILLER PIC X(12) VALUE "S1MCVG0056F1".
    05  FILLER PIC X(12) VALUE "S1FCVG0057F1".
    05  FILLER PIC X(12) VALUE "S1XCVG0058F1".
    05  FILLER PIC X(12) VALUE "BBLNKT0059A1".
   05  FILLER PIC X(12) VALUE "COVRAG0060A1".
    05  FILLER PIC X(12) VALUE "BRATES0061B1".
   05  FILLER PIC X(12) VALUE "CLSCCD0062T1".
    05  FILLER PIC X(12) VALUE "CRATES0063B1".
   05  FILLER PIC X(12) VALUE "SPRKLR0064A1".
   05  FILLER PIC X(12) VALUE "B-RISK0065A1".
   05  FILLER PIC X(12) VALUE "C-RISK0066A1".
   05  FILLER PIC X(12) VALUE "CHGRSK0067A1".
    05  FILLER PIC X(12) VALUE "C-BURG0068F1".
   05  FILLER PIC X(12) VALUE "SCT1%$0069T1".
    05  FILLER PIC X(12) VALUE "RF-CVG0070A1".
   05  FILLER PIC X(12) VALUE "RF-BAS0071A1".
   05  FILLER PIC X(12) VALUE "B-LCD 0072T1".
   05  FILLER PIC X(12) VALUE "C-LIM%0073T1".
   05  FILLER PIC X(12) VALUE "G-LIM%0074T1".
   05  FILLER PIC X(12) VALUE "LOCNSW0075N1".
   05  FILLER PIC X(12) VALUE "EXPNOV0076A1".
    05  FILLER PIC X(12) VALUE "POLPRM0077T1".
    05  FILLER PIC X(12) VALUE "IT-CTF0078A1".
    05  FILLER PIC X(12) VALUE "NP-PIT0079T1".
    05  FILLER PIC X(12) VALUE "ARSLIM0080N1".
    05  FILLER PIC X(12) VALUE "AR-PIT0081T1".
    05  FILLER PIC X(12) VALUE "IILIM%0082T1".
    05  FILLER PIC X(12) VALUE "ARALIM0083A1".
    05  FILLER PIC X(12) VALUE "VPBLIM0084A1".
    05  FILLER PIC X(12) VALUE "RECPTL0085A1".
    05  FILLER PIC X(12) VALUE "RCPTYP0086A1".
    05  FILLER PIC X(12) VALUE "RCDDNP0087N1".
    05  FILLER PIC X(12) VALUE "ARRKCL0088A1".
    05  FILLER PIC X(12) VALUE "RECPTV0089A1".
    05  FILLER PIC X(12) VALUE "RCPTYV0090A1".
    05  FILLER  PIC X(12) VALUE "BMON010091N1".
    05  FILLER  PIC X(12) VALUE "BMON020092F1".
    05  FILLER  PIC X(12) VALUE "BMON030093F1".
    05  FILLER  PIC X(12) VALUE "MOS0010094A1".
    05  FILLER  PIC X(12) VALUE "MOS-010095F1".
    05  FILLER  PIC X(12) VALUE "MOS-020096N1".
    05  FILLER  PIC X(12) VALUE "MOS-100097N1".
    05  FILLER  PIC X(12) VALUE "MOS-110098N1".
    05  FILLER  PIC X(12) VALUE "MOS-120099F1".
    05  FILLER  PIC X(12) VALUE "MOS-130100N1".
    05  FILLER  PIC X(12) VALUE "MOS-140101N1".
    05  FILLER  PIC X(12) VALUE "MOS-150102N1".
    05  FILLER  PIC X(12) VALUE "MOS-160103N1".
    05  FILLER  PIC X(12) VALUE "MOS-170104N1".
    05  FILLER  PIC X(12) VALUE "MOS-180105N1".
    05  FILLER  PIC X(12) VALUE "MOS-190106F1".
    05  FILLER  PIC X(12) VALUE "MOS-200107A1".
    05  FILLER  PIC X(12) VALUE "MOS-210108F1".
    05  FILLER  PIC X(12) VALUE "MOS-220109F1".
    05  FILLER PIC X(12) VALUE "MOS-230110T1".
    05  FILLER  PIC X(12) VALUE "MS00010111A1".
    05  FILLER  PIC X(12) VALUE "MS-0010112A1".
    05  FILLER  PIC X(12) VALUE "MS-0020113N1".
    05  FILLER  PIC X(12) VALUE "MS-0030114F1".
    05  FILLER PIC X(12) VALUE "MS-0040115T1".
    05  FILLER  PIC X(12) VALUE "MS-0050116F1".
    05  FILLER  PIC X(12) VALUE "MS-0060117N1".
    05  FILLER  PIC X(12) VALUE "MS-0070118A1".
    05  FILLER  PIC X(12) VALUE "MS-0080119A1".
    05  FILLER  PIC X(12) VALUE "MS-0090120F1".
    05  FILLER  PIC X(12) VALUE "MS-0100121N1".
    05  FILLER  PIC X(12) VALUE "MS-0110122N1".
    05  FILLER  PIC X(12) VALUE "MS-0120123N1".
    05  FILLER  PIC X(12) VALUE "MS-0130124N1".
    05  FILLER  PIC X(12) VALUE "MS-0140125N1".
    05  FILLER  PIC X(12) VALUE "MS-0150126N1".
    05  FILLER  PIC X(12) VALUE "MS-0160127F1".
    05  FILLER  PIC X(12) VALUE "MS-0170128A1".
    05  FILLER  PIC X(12) VALUE "MS-0180129F1".
    05  FILLER  PIC X(12) VALUE "MS-0190130A1".
    05  FILLER  PIC X(12) VALUE "MR00010131A1".
    05  FILLER  PIC X(12) VALUE "MR-0010132F1".
    05  FILLER  PIC X(12) VALUE "MR-0020133F1".
    05  FILLER  PIC X(12) VALUE "MR-0030134F1".
    05  FILLER  PIC X(12) VALUE "MR00020135A1".
    05  FILLER  PIC X(12) VALUE "MR-1010136N1".
    05  FILLER  PIC X(12) VALUE "MR-1020137A1".
    05  FILLER  PIC X(12) VALUE "MR-1030138F1".
    05  FILLER  PIC X(12) VALUE "MR-1040139F1".
    05  FILLER  PIC X(12) VALUE "MR-1050140F1".
    05  FILLER  PIC X(12) VALUE "MR-1060141N1".
    05  FILLER  PIC X(12) VALUE "MR-1070142F1".
    05  FILLER  PIC X(12) VALUE "MR-1080143F1".
    05  FILLER  PIC X(12) VALUE "MR00030144A1".
    05  FILLER  PIC X(12) VALUE "MR-2010145N1".
    05  FILLER  PIC X(12) VALUE "MR-2020146N1".
    05  FILLER  PIC X(12) VALUE "MR-2030147N1".
    05  FILLER  PIC X(12) VALUE "MR-2040148F1".
    05  FILLER  PIC X(12) VALUE "MR-2050149A1".
    05  FILLER  PIC X(12) VALUE "MR-2060150F1".
    05  FILLER  PIC X(12) VALUE "MR-2070151F1".
    05  FILLER  PIC X(12) VALUE "BFMS010152A1".
    05  FILLER  PIC X(12) VALUE "BF-0010153F1".
    05  FILLER  PIC X(12) VALUE "BF-0020154F1".
    05  FILLER  PIC X(12) VALUE "BF-0030155F1".
    05  FILLER  PIC X(12) VALUE "BF-0040156F1".
    05  FILLER  PIC X(12) VALUE "BFMS020157A1".
    05  FILLER  PIC X(12) VALUE "BF-1010158N1".
    05  FILLER  PIC X(12) VALUE "BF-1030159A1".
    05  FILLER  PIC X(12) VALUE "BF-1040160A1".
    05  FILLER  PIC X(12) VALUE "BF-1050161F1".
    05  FILLER  PIC X(12) VALUE "BF-1060162N1".
    05  FILLER  PIC X(12) VALUE "BF-1070163N1".
    05  FILLER  PIC X(12) VALUE "BF-1080164N1".
    05  FILLER  PIC X(12) VALUE "BF-1090165N1".
    05  FILLER  PIC X(12) VALUE "BF-1100166N1".
    05  FILLER  PIC X(12) VALUE "BF-1110167N1".
    05  FILLER  PIC X(12) VALUE "BF-1120168F1".
    05  FILLER  PIC X(12) VALUE "BF-1130169N1".
    05  FILLER  PIC X(12) VALUE "BF-1140170F1".
    05  FILLER  PIC X(12) VALUE "BF-1150171F1".
    05  FILLER  PIC X(12) VALUE "BF-1160172F1".
    05  FILLER  PIC X(12) VALUE "BF-1170173A1".
    05  FILLER  PIC X(12) VALUE "BFMS030174A1".
    05  FILLER  PIC X(12) VALUE "BF-2010175N1".
    05  FILLER  PIC X(12) VALUE "BF-2020176N1".
    05  FILLER  PIC X(12) VALUE "BF-2030177N1".
    05  FILLER  PIC X(12) VALUE "BF-2040178F1".
    05  FILLER  PIC X(12) VALUE "BF-2050179F1".
    05  FILLER  PIC X(12) VALUE "BF-2060180A1".
    05  FILLER  PIC X(12) VALUE "BF-2070181F1".
    05  FILLER  PIC X(12) VALUE "BFMS040182A1".
    05  FILLER  PIC X(12) VALUE "BF-3010183N1".
    05  FILLER  PIC X(12) VALUE "BF-3020184N1".
    05  FILLER  PIC X(12) VALUE "BFS-010185N1".
    05  FILLER  PIC X(12) VALUE "SBR-010186N1".
    05  FILLER PIC X(12) VALUE "OBR-010187N1".
    05  FILLER PIC X(12) VALUE "OBR-020188F1".
    05  FILLER PIC X(12) VALUE "OBR-030189N1".
    05  FILLER PIC X(12) VALUE "OBR-040190F1".
    05  FILLER PIC X(12) VALUE "OBR-050191F1".
    05  FILLER PIC X(12) VALUE "OBR-060192F1".
    05  FILLER PIC X(12) VALUE "OBR-070193N1".
    05  FILLER PIC X(12) VALUE "OBR-080194N1".
    05  FILLER PIC X(12) VALUE "BMON040195Y1".
    05  FILLER PIC X(12) VALUE "BMON050196Y1".
    05  FILLER PIC X(12) VALUE "BMON060197Y1".
    05  FILLER PIC X(12) VALUE "BMON070198N1".
    05  FILLER PIC X(12) VALUE "MOS0000199F1".
    05  FILLER PIC X(12) VALUE "MS00000200F1".
    05  FILLER PIC X(12) VALUE "MR00000201F1".
    05  FILLER PIC X(12) VALUE "BFMS000202F1".
    05  FILLER PIC X(12) VALUE "BFS0000203F1".
    05  FILLER PIC X(12) VALUE "SBR0000204F1".
    05  FILLER PIC X(12) VALUE "OBR0000205F1".
    05  FILLER PIC X(12) VALUE "BMON080206F1".
    05  FILLER PIC X(12) VALUE "BMN0910207A1".
    05  FILLER PIC X(12) VALUE "BMN0920208A1".
    05  FILLER PIC X(12) VALUE "BMON090209A1".
    05  FILLER PIC X(12) VALUE "BMN1010210A1".
    05  FILLER PIC X(12) VALUE "BMN1020211A1".
    05  FILLER PIC X(12) VALUE "BMON100212A1".
    05 FILLER PIC X(12) VALUE "CSONLY0213A2".
    05  FILLER PIC X(12) VALUE "S1LSTA0214N1".
    05  FILLER PIC X(12) VALUE "S1LAD10215A1".
    05  FILLER PIC X(12) VALUE "S1LAD20216A1".
    05  FILLER PIC X(12) VALUE "POLFEC0217T1".
    05  FILLER PIC X(12) VALUE "CRFCVF0218F1".
    05  FILLER PIC X(12) VALUE "GRFVFC0219F1".
    05  FILLER PIC X(12) VALUE "ORFCVF0220F1".
    05  FILLER PIC X(12) VALUE "RRFCVF0221F1".
    05  FILLER PIC X(12) VALUE "CRF-SA0222F1".
    05  FILLER PIC X(12) VALUE "GRF-SA0223F1".
    05  FILLER PIC X(12) VALUE "ORF-SA0224F1".
    05  FILLER PIC X(12) VALUE "RRF-SA0225F1".
    05  FILLER PIC X(12) VALUE "GRFSLI0226N1".
    05  FILLER PIC X(12) VALUE "CRFSLI0227N1".
    05  FILLER PIC X(12) VALUE "ORFSLI0228N1".
    05  FILLER PIC X(12) VALUE "CRFSLI0229N1".
    05  FILLER PIC X(12) VALUE "CRFALI0230N1".
    05  FILLER PIC X(12) VALUE "GRFALI0231N1".
    05  FILLER PIC X(12) VALUE "ORFALI0232N1".
    05  FILLER PIC X(12) VALUE "RRFALI0233N1".
    05  FILLER PIC X(12) VALUE "CNRFCV0234F1".
    05  FILLER PIC X(12) VALUE "GNRFCV0235F1".
    05  FILLER PIC X(12) VALUE "ONRFCV0236F1".
    05  FILLER PIC X(12) VALUE "RNRFCV0237F1".
    05  FILLER PIC X(12) VALUE "CDIAMT0238N1".
    05  FILLER PIC X(12) VALUE "GDIAMT0239N1".
    05  FILLER PIC X(12) VALUE "ODIAMT0240N1".
    05  FILLER PIC X(12) VALUE "RDIAMT0241N1".
    05  FILLER PIC X(12) VALUE "S1PG000242 1".
    05  FILLER PIC X(12) VALUE "S1PG010243F1".

    05  FILLER PIC X(12) VALUE "S1PG030245N1".
    05  FILLER PIC X(12) VALUE "S1PG050246N1".
    05  FILLER PIC X(12) VALUE "S1PG060247F1".
    05  FILLER PIC X(12) VALUE "S1PG070248F1".
    05  FILLER PIC X(12) VALUE "S1PG080249F1".
    05  FILLER PIC X(12) VALUE "BMON110250F1".
    05  FILLER PIC X(12) VALUE "BMON120251N1".
    05  FILLER PIC X(12) VALUE "BMON130252F1".
    05  FILLER PIC X(12) VALUE "BMON140253F1".
    05  FILLER PIC X(12) VALUE "BMON150254N1".
    05  FILLER PIC X(12) VALUE "BMON160255F1".
    05  FILLER PIC X(12) VALUE "BMON170256F1".
    05  FILLER PIC X(12) VALUE "BMON180257N1".
    05  FILLER PIC X(12) VALUE "BMON190258F1".
    05  FILLER PIC X(12) VALUE "MS-0200259N1".
    05  FILLER PIC X(12) VALUE "MR-1000260N1".
    05  FILLER PIC X(12) VALUE "BF-1000261N1".
    05  FILLER PIC X(12) VALUE "BFS-020262N1".
    05  FILLER PIC X(12) VALUE "SBR-020263N1".
    05  FILLER PIC X(12) VALUE "    0264F1".
    05  FILLER PIC X(12) VALUE "S1PG090265N1".
    05  FILLER PIC X(12) VALUE "S1PG100266 1".
    05  FILLER PIC X(12) VALUE "S1PG110267 1".
    05  FILLER PIC X(12) VALUE "S1PG120268F1".
    05  FILLER PIC X(12) VALUE "S1PG130269A1".
    05  FILLER PIC X(12) VALUE "S1PG140270N1".
    05  FILLER PIC X(12) VALUE "S1PG150271 1".
    05  FILLER PIC X(12) VALUE "S1PG160272T1".
    05  FILLER PIC X(12) VALUE "S1PG170273F1".
    05  FILLER PIC X(12) VALUE "S1PG180274 1".
    05  FILLER PIC X(12) VALUE "S1PG190275 1".
    05  FILLER PIC X(12) VALUE "S1PG200276 1".
    05  FILLER PIC X(12) VALUE "S1PG210277 1".
    05  FILLER PIC X(12) VALUE "S1PG220278 1".
    05  FILLER PIC X(12) VALUE "S1PG230279N1".
    05  FILLER PIC X(12) VALUE "G-BURG0280F1".
    05  FILLER PIC X(12) VALUE "O-BURG0281F1".
    05 FILLER PIC X(228) VALUE SPACES.
  03 TABLE-ENTRY REDEFINES TABLE-KEYWORDS OCCURS 300.
   05 KEYWORD   PIC X(6).
   05  NUMERIC-KEY    PIC 9(4).
   05  EDIT-TYPE    PIC X.
  05  SEC-TYPE    PIC X.
 02  IO-FIELDMAN-DATA.
 03  IO-DATA   OCCURS 250 TIMES   PIC X.
 02  KEYWORD-WORK6.
  03 KEYWORD-WORK.
    05 KEYWORD-WK OCCURS 6   PIC X.
  03 KEY-WORD REDEFINES KEYWORD-WORK.
   05 KEYWORD-WK2 PIC XX.
   05 FILLER    PIC X(4).
 02  DATA-NAME-WORKS.
 03 DATE-TYPE.
   05  D-TYPE  OCCURS 6 TIMES    PIC X.
 03 TYPE-DATE  REDEFINES DATE-TYPE.
   05  MO-TYPE    PIC 99.
   05  DA-TYPE    PIC 99.
   05  YR-TYPE    PIC 99.
 03 NUMERIC-TYPE.
   05  NUM-TYPE  OCCURS 12 TIMES  PIC X.
  03 NUM-GRP-TYPE REDEFINES NUMERIC-TYPE PIC S9(8)V9(4).
 03 T-TYPE-ALL.
   05  T-TYPE  OCCURS 4 TIMES.
    07 TYPE-T    OCCURS 12 TIMES PIC X.
 03 ALL-T-TYPE   REDEFINES T-TYPE-ALL.
   05  T-TYPE-1    PIC S9(8)V9(4).
   05  T-TYPE-2    PIC S9(8)V9(4).
   05  T-TYPE-3    PIC S9(8)V9(4).
   05  T-TYPE-4    PIC S9(8)V9(4).
 03  B-TYPE-ALL.
    05  B-TYPE OCCURS 4 PIC X.
  03  CLASS-TYPE.
   05  C-TYPE OCCURS 12 TIMES PIC X.
  03  TYPE-CLASS REDEFINES CLASS-TYPE.
   05  CLASS-NUM  PIC 9999.
   05  CLASS-ALPHA  PIC XX.
   05  CLASS-S  PIC X.
   05  CLASS-EXCLUS  PIC X(5).
LINKAGE SECTION.
01 COMMON-AREA COPY CSCOPY.
PROCEDURE DIVISION USING COMMON-AREA.
010-START.
    DISPLAY 'GOT-QUOTRM'.
    MOVE SPACE TO DISPLAY-AREA.
    IF SEC-NO = 1 MOVE S1L TO COM-S.
    IF SEC-NO = 2  MOVE Q TO COM-S.
    IF  GO-SW = 1  GO TO 100-CALL-PGM-MESSAGE.
    IF GO-SW  NOT = ZERO
    DISPLAY "INVALID  " GO-SW UPON INTYPER
    GO TO 900-END.
050-PRE-GO.
    DISPLAY '050-PRE-GO.'.
    MOVE 1 TO ACCEPT-SW.
    IF SEC-NO = 0 MOVE MSG-0 TO DISP-1A-9
    MOVE ZERO TO DISP-1A-3.
    IF SEC-NO = 1 MOVE MSG-1 TO DISP-1A-9
    MOVE COM-S TO DISP-1A-3.
    IF SEC-NO = 2 MOVE MSG-2 TO DISP-1A-9
    MOVE COM-S TO DISP-1A-3.
    MOVE "ENTER ALL KEYWORDS FOR " TO DISP-1A-22.
    MOVE " THEN ENTER THE WORD GO.    "
    TO DISP-1A-39.
    GO TO 160-SHOW.
100-CALL-PGM-MESSAGE.
    DISPLAY '100-CALL-PGM-MESSAGE.'.
    IF VERB-NO = 1 MOVE SPACE TO PROMPT-VERB.
    IF VERB-NO = 2 MOVE "ENTER" TO PROMPT-VERB.
    IF VERB-NO = 3 MOVE "INVALID" TO PROMPT-VERB.
    IF PROMPT-TYPE = 1
    MOVE 100 TO INX-CHR
    MOVE PROMPT-NOUN-C TO PROMPT-NOUN GO TO 120-DISPLAY-OUT.
    IF OPEN-SW = 0  OPEN INPUT Q-A-FILE.
    MOVE 1 TO OPEN-SW.
    MOVE CALL-NUM-KEY TO Q-A-KEY.
104-SEEK-QA.
    DISPLAY '104-SEEK-QA.' CALL-NUM-KEY '   ' Q-A-KEY.
    READ Q-A-FILE INVALID KEY GO TO 110-ERR-KEY.
    DISPLAY 'Q-A-FILE READ'.
    MOVE SPACE TO PROMPT-NOUN.
*    THE FOLLOWING STATEMENT MODIFIED THE ORIG. PROGRAM.
    MOVE 320 TO INX-CHR.
    DISPLAY ' LEAVING 104-SEEK-QA.'.
    MOVE CHARS TO PROMPT-NOUN.
    GO TO 120-DISPLAY-OUT.
110-ERR-KEY.
    DISPLAY "INVALID CALL-KEY-NO " CALL-NUM-KEY
    UPON INTYPER.
    GO TO 700-CLEAR-RETURN.
120-DISPLAY-OUT.
    DISPLAY '120-DISPLAY-OUT.'.
    SET INX-DISPLAY TO 1.
    DISPLAY 'SET INX-DISPLAY'.
    MOVE SPACE TO DISPLAY-AREA.
    DISPLAY 'MOVE SPACE TO DISPLAY-AREA.'.
    MOVE PROMPT-VERB TO DISPLY-1.
    DISPLAY 'MOVE PROMPT-VERB TO DISPLY-1.'.
130-CONDENSE-VERB.
    DISPLAY '130-CONDENSE-VERB.'.
    IF DISPY (INX-DISPLAY) = SPACE GO TO 140-NOUN.
    SET INX-DISPLAY UP BY 1.
    GO TO 130-CONDENSE-VERB.
140-NOUN.
    DISPLAY '140-NOUN.'.
    SET INX-NUN TO 1.
150-LOOP-NOUN.
    DISPLAY '150-LOOP-NOUN.'.
    SET INX-DISPLAY UP BY 1.
    MOVE PROMPT-NUN (INX-NUN) TO DISPY (INX-DISPLAY).
    SET INX-NUN UP BY 1.
    IF INX-DISPLAY > 319 GO TO 160-SHOW.
    IF INX-NUN > INX-CHR GO TO 160-SHOW.
    IF INX-NUN > 319 GO TO 160-SHOW.
    GO TO 150-LOOP-NOUN.
160-SHOW.
    DISPLAY '160-SHOW.'.
    DISPLAY DISPLY-1  UPON INTYPER.
    IF  DISPLY-2 NOT = SPACE
    DISPLAY DISPLY-2 UPON INTYPER.
    IF  DISPLY-3  NOT = SPACE
    DISPLAY DISPLY-3 UPON INTYPER.
    IF DISPLY-4  NOT = SPACE
    DISPLAY DISPLY-4 UPON INTYPER.
170-ACCEPT-TERMINAL.
    DISPLAY '170-ACCEPT-TERMINAL.'.
    IF ACCEPT-SW = ZERO
    GO TO 900-END.
    MOVE SPACE TO IO-FIELDMAN-DATA.
    ACCEPT IO-FIELDMAN-DATA FROM INTYPER.
ANALYSIS-IO-ROUTINE.
    DISPLAY 'ANALYSIS-IO-ROUTINE.' GO-SW.
    MOVE ZERO TO INX-IO  BLANK-CNT
    ERR-SW
    INX-KEYWORD-WK DATA-NAME-WORKS.
    MOVE SPACE TO KEYWORD-WORK.
    IF GO-SW = 0  GO TO 200-GET-KEYWORD.
180-GO-SW-1.
    ADD 1 TO INX-IO.
    IF IO-DATA (INX-IO) = SPACE GO TO 210-SPACE-5.
    IF IO-DATA (INX-IO) = "R"
    MOVE ZERO TO CNT-5
    GO TO 180-TEST-REPEAT.
180-CONT-GO-SW-1.
    DISPLAY '180-CONT-GO-SW-1.' INX-IO.
    IF IO-DATA (INX-IO) = "#" GO TO 182-2C.
    IF CHG-SW = ZERO SUBTRACT 1 FROM INX-IO
    GO TO 260-EDIT-TYPE.
    IF IO-DATA (INX-IO) = "Y" MOVE 1 TO INPUT-TYPE-SW
    GO TO 180-3A-EXIT.
    IF IO-DATA (INX-IO) = "N"  GO TO  180-DISPLAY-CHG.
    GO TO 182-2C.
180-DISPLAY-CHG.
    DISPLAY "ENTER SECTION NUMBER YOU WANT TO MAKE CHANGES IN"
    UPON INTYPER.
    ACCEPT CHG-SEC-NO FROM INTYPER.
    IF CHG-SEC-NO = 0 OR 1 OR 2 NEXT SENTENCE
    ELSE DISPLAY "INVALID SECTION NUMBER, 0 1 OR 2"
    UPON INTYPER
    GO TO 180-DISPLAY-CHG.
    IF CHG-SEC-NO = 0  GO TO 180-3A-EXIT.
    IF CHG-SEC-NO = 1 GO TO 180-LOCATION.
    IF CHG-SEC-NO = 2 GO TO 180-CLASS.
180-LOCATION.
    DISPLAY "ENTER LOCATION NUMBER YOU WANT TO MAKE CHANGES IN"
    UPON INTYPER.
    ACCEPT COM-LOC FROM INTYPER.
    IF COM-LOC LESS 1 OR COM-LOC GREATER 5
    DISPLAY "INVALID LOCATION NUMBER, SHOULD BE 1 THRU 5"
    GO TO 180-LOCATION.
    MOVE COM-LOC TO COM-S.
    GO TO 180-3A-EXIT.
180-CLASS.
    DISPLAY "ENTER CLASS NUMBER IN WHICH YOU WANT TO MAKE CHANGES".
    ACCEPT COM-CLS FROM INTYPER.
    IF COM-CLS LESS 1
    OR COM-CLS GREATER 30
    DISPLAY "INVALID CLASS NUMBER,SHOULD BE 1 THRU 30"
    GO TO 180-CLASS.
    MOVE COM-CLS TO COM-S.
180-3A-EXIT.
    MOVE 0 TO GO-SW.
    MOVE "ENTER ALL CHANGE KEYWORDS, THEN ENTER GO"
    TO DISPLAY-AREA.
    GO TO 160-SHOW.
182-2C.
    MOVE 9 TO CHG-SW.
    PERFORM 530-CHECK-ERR-SW THRU P-EXIT.
    MOVE 1 TO CHG-SW.
    IF SEC-NO = 0 MOVE "5003" TO Q-A-KEY.
    IF SEC-NO = 1 MOVE "5001" TO Q-A-KEY.
    IF SEC-NO = 2 MOVE "5002" TO Q-A-KEY.
    MOVE SPACES TO PROMPT-VERB.
    GO TO 104-SEEK-QA.
180-TEST-REPEAT.
    ADD 1 TO INX-IO, CNT-5.
    IF IO-DATA (INX-IO) = "E" NEXT SENTENCE ELSE
    GO TO 180-REPEAT-OUT.
    ADD 1 TO INX-IO, CNT-5.
    IF IO-DATA (INX-IO) = "P" NEXT SENTENCE ELSE
    GO TO 180-REPEAT-OUT.
    ADD 1 TO INX-IO, CNT-5.
    IF IO-DATA (INX-IO) = "E" NEXT SENTENCE ELSE
    GO TO 180-REPEAT-OUT.
    ADD 1 TO INX-IO, CNT-5.
    IF IO-DATA (INX-IO) = "A" NEXT SENTENCE ELSE
    GO TO 180-REPEAT-OUT.
    ADD 1 TO INX-IO, CNT-5.
    IF IO-DATA (INX-IO) = "T" NEXT SENTENCE ELSE
    GO TO 180-REPEAT-OUT.
    GO TO 160-SHOW.
180-REPEAT-OUT.
    SUBTRACT CNT-5 FROM INX-IO.
    GO TO 180-CONT-GO-SW-1.
200-GET-KEYWORD.
     DISPLAY '200-GET-KEYWORD.'.
    ADD 1 TO INX-IO.
    IF IO-DATA (INX-IO) = SPACE GO TO 210-SPACE-5.
202-KEYWORD-LOOP.
    IF IO-DATA (INX-IO) = "*" GO TO 220-LOSE-EQUAL-SIGN.
    IF  IO-DATA (INX-IO)  = "=" GO TO 230-MATCH-KEYWORD-TBL.
    ADD 1 TO INX-KEYWORD-WK.
    IF  INX-KEYWORD-WK  LESS 7
    MOVE IO-DATA (INX-IO) TO KEYWORD-WK (INX-KEYWORD-WK).
    IF INX-IO > 250 GO TO 370-NO-END-SIGN.
    IF IO-DATA (INX-IO) = "G" GO TO 204-GO.
    ADD 1 TO INX-IO.
    GO TO 202-KEYWORD-LOOP.
204-GO.
    DISPLAY '204-GO.'.
    ADD 1 TO INX-IO.
    IF IO-DATA (INX-IO) = "O" NEXT SENTENCE ELSE
    GO TO 202-KEYWORD-LOOP.
    ADD 1 TO INX-IO.
    IF IO-DATA (INX-IO) = " " GO TO 900-TEST-INPUT-SW.
    SUBTRACT 1 FROM INX-IO.
    GO TO 202-KEYWORD-LOOP.
210-SPACE-5.
    ADD 1 TO BLANK-CNT.
    IF BLANK-CNT > 4 GO TO 160-SHOW.
    IF GO-SW = 1  GO TO 180-GO-SW-1.
    GO TO 200-GET-KEYWORD.
220-LOSE-EQUAL-SIGN.
    IF INVAL-KW-SW = 1 NEXT SENTENCE ELSE
    DISPLAY KEYWORD-WORK "  ERROR." UPON INTYPER
    DISPLAY " THERE SHOULD BE AN = SIGN AFTER THE KEYWORD"
    UPON INTYPER.
    MOVE ZERO TO INX-KEYWORD-WK INVAL-KW-SW.
    MOVE SPACE TO KEYWORD-WORK.
    GO TO 200-GET-KEYWORD.
230-MATCH-KEYWORD-TBL.
    MOVE ZERO TO INX-KEYWORD.
    IF KEYWORD-WORK = "REPEAT" GO TO 160-SHOW.
    IF KEYWORD-WK2 = "GO" GO TO 900-TEST-INPUT-SW.
240-LOOP-KEYWORD.
    DISPLAY '240-LOOP-KEYWORD.' INX-KEYWORD.
    ADD 1 TO INX-KEYWORD.
    IF  KEYWORD (INX-KEYWORD)  = KEYWORD-WORK
    GO TO 260-EDIT-TYPE.
    IF KEYWORD (INX-KEYWORD) = "    "
    GO TO 250-INVALID-KEYWORD.
    IF INX-KEYWORD > 300 GO TO 250-INVALID-KEYWORD.
    GO TO 240-LOOP-KEYWORD.
250-INVALID-KEYWORD.
   MOVE 1 TO INVAL-KW-SW.
    DISPLAY "INVALID KEYWORD  " KEYWORD-WORK UPON INTYPER.
    MOVE 1 TO ERR-SW.  GO TO 530-CHECK-ERR-SW.
260-EDIT-TYPE.
    DISPLAY '260-EDIT-TYPE.' GO-SW.
    IF GO-SW = 1  MOVE CALL-EDIT-TYPE TO EDIT-TYPE-WK
    ELSE MOVE EDIT-TYPE (INX-KEYWORD) TO EDIT-TYPE-WK.
    IF EDIT-TYPE-WK  =  "B"  GO TO 525-B-TYPE.
    IF EDIT-TYPE-WK = "Y" GO TO 400-CR-DB.
    IF EDIT-TYPE-WK = "N" GO TO 320-NUM-EDIT.
    IF  EDIT-TYPE-WK = "A"  GO TO 510-ALPHA-EDIT.
    IF  EDIT-TYPE-WK = "T"  GO TO 440-T-EDIT.
    IF EDIT-TYPE-WK = "D" GO TO 270-DATE-TYPE.
    IF EDIT-TYPE-WK = "C" GO TO 265-C-TYPE.
    IF EDIT-TYPE-WK = "F" GO TO 501-F-TYPE.
    DISPLAY EDIT-TYPE-WK " INVALID EDIT TYPE" UPON INTYPER.
    GO TO 900-END.
265-C-TYPE.
    MOVE SPACES TO CLASS-TYPE.
    MOVE ZERO TO INX-C C-SW.
265-C-GO.
    ADD 1 TO INX-IO.
    IF INX-IO > 250 GO TO 370-NO-END-SIGN.
    IF GO-SW = 1 AND IO-DATA (INX-IO) = " " GO TO 268-EDIT.
    IF IO-DATA (INX-IO) = "*" GO TO 268-EDIT.
    IF IO-DATA (INX-IO) = "-" GO TO 266-TEST-C-SW.
    IF INX-C > 5 AND C-SW = 0
    DISPLAY KEYWORD-WORK " INVALID MISSING HYPHEN" UPON INTYPER
    MOVE 1 TO ERR-SW
    GO TO 530-CHECK-ERR-SW.
    IF C-SW = 2 GO TO 267-TEST-EXCLUSIONS.
    IF IO-DATA (INX-IO) = "S" AND C-SW = 1 MOVE 07 TO INX-C
    MOVE "S" TO CLASS-S MOVE 2 TO C-SW GO TO 265-C-GO.
    IF C-SW = 1 MOVE 2 TO C-SW MOVE 07 TO INX-C
    GO TO 267-TEST-EXCLUSIONS.
266-MOVE.
    ADD 1 TO INX-C.
    IF INX-C < 13 MOVE IO-DATA (INX-IO) TO C-TYPE (INX-C).
    GO TO 265-C-GO.
266-TEST-C-SW.
    IF C-SW = 0 MOVE 1 TO C-SW.
    GO TO 265-C-GO.
267-TEST-EXCLUSIONS.
    IF IO-DATA (INX-IO) = "Z" OR "X" OR "C" OR "U" OR "D" OR "E"
    GO TO 266-MOVE.
    MOVE 2 TO ERR-SW.
    GO TO 265-C-GO.
268-EDIT.
    IF ERR-SW = 2 MOVE 1 TO ERR-SW
    DISPLAY KEYWORD-WORK
    " INVALID EXCLUSION CODE NOT E X C U D OR Z".
    IF CLASS-NUM IS NUMERIC GO TO 530-CHECK-ERR-SW.
    DISPLAY KEYWORD-WORK
    " INVALID FIRST FOUR POSITIONS OF CLASS TYPE NOT NUMERIC"
    UPON INTYPER.
    MOVE 1 TO ERR-SW
    GO TO 530-CHECK-ERR-SW.
270-DATE-TYPE.
    MOVE SPACES TO DATE-TYPE. MOVE ZERO TO INX-D-TYPE.
270-D-TYPE.
    ADD 1 TO INX-IO.
    IF GO-SW = 1 AND INX-D-TYPE > 5
    GO TO 280-EDIT-DATE.
    IF INX-IO > 250 GO TO 370-NO-END-SIGN.
    IF IO-DATA (INX-IO) = SPACE  GO TO 270-D-TYPE.
    IF IO-DATA (INX-IO) = "/"  OR "-"
    GO TO 270-D-TYPE.
    IF IO-DATA (INX-IO) = "*"
    GO TO 280-EDIT-DATE.
    ADD 1 TO INX-D-TYPE.
    IF  INX-D-TYPE  LESS 7
    MOVE IO-DATA (INX-IO)  TO D-TYPE (INX-D-TYPE).
    GO TO 270-D-TYPE.
280-EDIT-DATE.
    IF  YR-TYPE  LESS 01    OR
    YR-TYPE  GREATER 99
    GO TO 310-ERROR-DATE.
    DIVIDE 4 INTO YR-TYPE GIVING QT REMAINDER REMD.
    IF REMD = ZERO
    MOVE 29 TO FEB-WK  ELSE
    MOVE 28 TO FEB-WK.
    SET INX-DATE TO 1.
290-LOOP-DATE.
    IF MO-TYPE = MO-WK (INX-DATE) GO TO 300-EDIT-DAY.
    IF INX-DATE > 11 GO TO 310-ERROR-DATE.
    SET INX-DATE UP BY 1.
    GO TO 290-LOOP-DATE.
300-EDIT-DAY.
    IF DA-TYPE  GREATER  DA-WK (INX-DATE)   OR
    DA-TYPE  LESS  01
    GO TO 310-ERROR-DATE.
    GO TO 530-CHECK-ERR-SW.
310-ERROR-DATE.
    DISPLAY KEYWORD-WORK " INVALID DATE, S/B MM/DD/YY "
    UPON INTYPER.  MOVE 1 TO ERR-SW.
    GO TO 530-CHECK-ERR-SW.
320-NUM-EDIT.
    MOVE ZERO TO NUMERIC-TYPE.
320-NUMERIC-EDIT.
    ADD 1 TO INX-IO.
    IF GO-SW = 1 AND IO-DATA (INX-IO) = " "
    MOVE INX-IO TO SAVE-IX-IO
    GO TO 350-DIGIT.
    IF  INX-IO  GREATER 250  GO TO 370-NO-END-SIGN.
    IF  IO-DATA (INX-IO) = "."  GO TO 330-DECIMAL.
    IF IO-DATA (INX-IO) = "*" MOVE INX-IO TO SAVE-IX-IO
    GO TO 350-DIGIT.
    GO  TO 320-NUMERIC-EDIT.
330-DECIMAL.
    MOVE 9  TO INX-NUM.  MOVE INX-IO TO SAVE-IX-IO.
340-DECIMAL.
    ADD 1 TO INX-IO.
    IF  INX-IO  GREATER 250  GO TO   370-NO-END-SIGN.
    IF IO-DATA (INX-IO) = "*" GO TO 350-DIGIT.
    IF GO-SW = 1 AND
    IO-DATA (INX-IO) = " " GO TO 350-DIGIT.
    IF  (IO-DATA (INX-IO) = "C" OR "D")
    AND (Y-SW2 = 1) GO TO 342-BYPASS-CR.
    IF  INX-NUM  GREATER 12  GO TO  340-DECIMAL.
    IF  IO-DATA (INX-IO) IS NUMERIC
    MOVE IO-DATA (INX-IO) TO NUM-TYPE (INX-NUM) ELSE
    GO TO 345-ERR-NUM.    ADD 1 TO INX-NUM.
    GO TO 340-DECIMAL.
342-BYPASS-CR.
    ADD 1 TO INX-IO.
    IF IO-DATA (INX-IO) = "R" OR "B",
    GO TO 340-DECIMAL.
    GO TO 345-ERR-NUM.
344-BYPASS-CR.
    SUBTRACT 1 FROM SAVE-IX-IO.
    IF IO-DATA (INX-IO) = "C" OR "D"
    GO TO 360-BACKWARD.
345-ERR-NUM.
    IF IO-DATA (INX-IO) = "*" OR " "
    GO TO 347-ERR-NUM.
    ADD 1  TO INX-IO.
    IF INX-IO  GREATER 250
    GO TO 347-ERR-NUM.
    GO TO 345-ERR-NUM.
347-ERR-NUM.
    DISPLAY KEYWORD-WORK  BAD-NUMERIC UPON INTYPER.
    IF INX-IO > 250 GO TO 370-NO-END-SIGN.
    MOVE 1 TO ERR-SW.
    GO TO 380-NUMERIC-EXIT.
350-DIGIT.
    MOVE 8 TO INX-NUM.
360-BACKWARD.
    SUBTRACT 1 FROM SAVE-IX-IO.
    IF GO-SW = 1 AND SAVE-IX-IO = 0
    GO TO 380-NUMERIC-EXIT.
    IF  IO-DATA (SAVE-IX-IO) = "," OR "$" OR "%" OR " "
    GO TO 360-BACKWARD.
    IF  IO-DATA (SAVE-IX-IO)  = "=" OR SPACE
    GO TO 380-NUMERIC-EXIT.
    IF (IO-DATA (SAVE-IX-IO) = "R" OR "B")
    AND  (Y-SW2 = 1)
    GO TO 344-BYPASS-CR.
    IF  INX-NUM  LESS  1
    GO TO 360-BACKWARD.
    IF IO-DATA (SAVE-IX-IO) IS NUMERIC
    MOVE IO-DATA (SAVE-IX-IO) TO NUM-TYPE (INX-NUM)
    ELSE GO TO 345-ERR-NUM.
    SUBTRACT 1 FROM INX-NUM.
    GO TO 360-BACKWARD.
370-NO-END-SIGN.
    MOVE ZERO TO B-EDIT-SW.
    IF GO-SW = 1
    DISPLAY " INCOMPLETE OR INCORRECT RESPONSE " ELSE
    DISPLAY KEYWORD-WORK " NO * SIGN AT END".
    GO TO 160-SHOW.
380-NUMERIC-EXIT.
    EXIT.
390-NUMERIC-BRANCH.
    GO TO 530-CHECK-ERR-SW.
400-CR-DB.
    MOVE INX-IO TO INX-Y.
410-Y-LOOP.
    MOVE 1 TO Y-SW2.
    ADD 1 TO INX-Y.
    IF INX-Y  GREATER  250   GO TO 370-NO-END-SIGN.
    IF GO-SW = 1 AND IO-DATA (INX-Y) = " "
    GO TO 435-ERR-Y.
    IF IO-DATA (INX-Y) = "*" GO TO 435-ERR-Y.
    IF IO-DATA (INX-Y) = "C"
    GO TO 420-CHECK-R.
    IF IO-DATA (INX-Y) = "D" GO TO 425-DB.
    GO TO 410-Y-LOOP.
420-CHECK-R.
    ADD 1 TO INX-Y.
    IF IO-DATA (INX-Y) = "R"
    MOVE 1 TO Y-SW  ELSE GO TO 435-ERR-Y.
422-CR-LOOP.
    ADD 1 TO INX-Y.
    IF INX-Y > 250 GO TO 370-NO-END-SIGN.
    IF GO-SW = 1 AND IO-DATA (INX-Y) = " "
    GO TO 430-MINUS-SIGN.
    IF IO-DATA (INX-Y) = "*"  GO TO 430-MINUS-SIGN.
    DISPLAY "INVALID CHARACTERS FOLLOWING CR *OR* DB"
    UPON INTYPER.
    MOVE 1 TO ERR-SW.
    ADD 1 TO INX-Y.
    GO TO 437-LOOP.
425-DB.
    ADD 1 TO INX-Y.
    IF IO-DATA (INX-Y) = "B" GO TO 422-CR-LOOP ELSE,
    GO TO 435-ERR-Y.
430-MINUS-SIGN.
    PERFORM 320-NUM-EDIT THRU 380-NUMERIC-EXIT.
    IF  Y-SW = 1
    MOVE ZERO TO Y-SW
    MULTIPLY -1 BY NUM-GRP-TYPE.
    GO TO 530-CHECK-ERR-SW.
435-ERR-Y.
    DISPLAY KEYWORD-WORK "  ERROR." UPON INTYPER.
    DISPLAY "MUST HAVE CR (OR) DB IMMEDIATELY AFTER THE NUMBER"
    UPON INTYPER.
    MOVE 1 TO ERR-SW.
437-LOOP.
    IF GO-SW = 1 AND IO-DATA (INX-Y) = " "
    GO TO 530-CHECK-ERR-SW.
    IF IO-DATA (INX-Y) = "*"
    GO TO 530-CHECK-ERR-SW.
    IF INX-Y > 250 GO TO 370-NO-END-SIGN.
    ADD 1 TO INX-Y.
    GO TO 437-LOOP.
440-T-EDIT.
    MOVE ZERO TO T-TYPE-ALL INX-T.
450-T-LOOP.
    ADD 1 TO INX-IO.
    IF  INX-IO  GREATER 250
    GO TO  370-NO-END-SIGN.
    IF  IO-DATA (INX-IO) = "."
    GO TO 460-T-DECIMAL.
    IF IO-DATA (INX-IO) = "B" AND B-EDIT-SW = 1
    MOVE "B" TO B-TYPE (INX-T) GO TO 450-T-LOOP.
    IF IO-DATA (INX-IO) = "-" OR "/" OR "*" OR " "
    MOVE INX-IO TO SAVE-IX-IO
    ADD 1 TO INX-T
    GO TO 480-DIGIT.
    GO TO 450-T-LOOP.
460-T-DECIMAL.
    MOVE 9 TO INX-NUM.
    MOVE INX-IO TO SAVE-IX-IO.
    ADD 1 TO INX-T.
470-T-DECIMAL.
    ADD 1 TO INX-IO.
    IF  INX-IO  GREATER 250  GO TO 370-NO-END-SIGN.
    IF IO-DATA (INX-IO) = "-" OR "/" OR "*" OR " "
    GO TO 480-DIGIT.
    IF INX-T > 4 GO TO 470-T-DECIMAL.
    IF  INX-NUM  GREATER 12  GO TO 470-T-DECIMAL.
    IF  IO-DATA (INX-IO) IS NUMERIC
    MOVE IO-DATA (INX-IO) TO TYPE-T (INX-T INX-NUM)
    ADD 1 TO INX-NUM
    GO TO 470-T-DECIMAL.
    IF IO-DATA (INX-IO) = "B" AND B-EDIT-SW = 1
    MOVE "B" TO B-TYPE (INX-T)
    ADD 1 TO  INX-NUM
    GO TO 470-T-DECIMAL.
    GO TO 345-ERR-NUM.
480-DIGIT.
    MOVE 8 TO INX-NUM.
490-BACKWARD.
    SUBTRACT 1 FROM SAVE-IX-IO.
    IF SAVE-IX-IO < 1 GO TO 500-CHECK-3.
    IF  IO-DATA (SAVE-IX-IO) = "=" OR
    "/" OR "*" OR " " OR "-"
    GO TO 500-CHECK-3.
    IF INX-T > 4 GO TO  490-BACKWARD.
    IF  INX-NUM  LESS 1
    GO TO 490-BACKWARD.
    IF IO-DATA (SAVE-IX-IO) = "," OR "$" OR "%" OR " "
    GO TO 490-BACKWARD.
    IF IO-DATA (SAVE-IX-IO) = "B" AND B-EDIT-SW = 1
    GO TO 490-BACKWARD.
    IF IO-DATA (SAVE-IX-IO)  IS NUMERIC
    MOVE IO-DATA (SAVE-IX-IO) TO TYPE-T (INX-T INX-NUM)
    ELSE  GO TO 345-ERR-NUM.
    SUBTRACT 1 FROM INX-NUM.
    GO TO 490-BACKWARD.
500-CHECK-3.
    IF GO-SW = 1 AND IO-DATA (INX-IO) = " "
    GO TO 390-NUMERIC-BRANCH.
    IF IO-DATA (INX-IO) = "*"
    GO TO 390-NUMERIC-BRANCH.
    GO TO 450-T-LOOP.
501-F-TYPE.
    MOVE SPACE TO F-TYPE.
    MOVE ZERO TO INX-A.
502-TEST-F.
    ADD 1 TO INX-IO INX-A.
    IF GO-SW = 1 AND IO-DATA (INX-IO) = " "
    GO TO 503-EDIT.
    IF INX-IO > 250 GO TO 370-NO-END-SIGN.
    IF IO-DATA (INX-IO) = "*" GO TO 503-EDIT.
    IF INX-A < 2 MOVE IO-DATA (INX-IO) TO F-TYPE.
    GO TO 502-TEST-F.
503-EDIT.
    IF F-TYPE = "Y" OR "N" GO TO 530-CHECK-ERR-SW.
    MOVE 1 TO ERR-SW.
    DISPLAY KEYWORD-WORK " INVALID MUST BE EITHER Y OR N"
    UPON INTYPER.
    GO TO 530-CHECK-ERR-SW.
510-ALPHA-EDIT.
    MOVE SPACE TO A-TYPE-40.
    MOVE ZERO  TO INX-A.
520-ALPHA.
    ADD 1 TO INX-IO.
    IF INX-IO > 250 GO TO 370-NO-END-SIGN.
    IF IO-DATA (INX-IO) = "*"
    GO TO 530-CHECK-ERR-SW.
    ADD 1 TO INX-A.
    IF INX-A < 41
    MOVE IO-DATA (INX-IO)  TO A-TYPE (INX-A).
    IF GO-SW = 1 AND INX-A > 39
    GO TO 530-CHECK-ERR-SW.
    GO TO 520-ALPHA.
525-B-TYPE.
    MOVE SPACE TO B-TYPE-ALL.
    MOVE 1 TO B-EDIT-SW GO TO 440-T-EDIT.
530-CHECK-ERR-SW.
    DISPLAY '530-CHECK-ERR-SW.' ERR-SW  GO-SW.
    MOVE ZERO TO B-EDIT-SW.
    IF  ERR-SW = 1
    GO TO P-EXIT.
    IF GO-SW = 1  MOVE CALL-NUM-KEY TO KEY-GO-TO ELSE
    MOVE NUMERIC-KEY (INX-KEYWORD)  TO KEY-GO-TO.
    DISPLAY 'BEFORE CALLING QUOTR1 OR QUOTR2.  KEY-GO-TO IS ' KEY-GO-TO.
*        IF KEY-GO-TO > 0 AND KEY-GO-TO < 141 
    DISPLAY 'CALLING QUOTR1'.
*       CALL QUOTR1 USING COMMON-AREA, WKS-SECT, Q-A-REC.
         IF KEY-GO-TO > 140 AND KEY-GO-TO <282
         CALL QUOTR2 USING COMMON-AREA, WKS-SECT, Q-A-REC.
P-EXIT.
    EXIT.
700-CLEAR-RETURN.
    DISPLAY '700-CLEAR-RETURN.' GO-SW.
    MOVE ZERO  TO INX-KEYWORD-WK
    BLANK-CNT  DATA-NAME-WORKS
    Y-SW2
     INX-D-TYPE.
    MOVE SPACE TO KEYWORD-WORK.
    IF GO-SW = 0 MOVE 0 TO ERR-SW GO TO 200-GET-KEYWORD.
    IF  ERR-SW = 1
    MOVE ZERO TO ERR-SW  GO TO 160-SHOW.
    GO TO 900-END.
900-TEST-INPUT-SW.
    IF INPUT-TYPE-SW NOT = 1 GO TO 900-END.
900-MOVE-Q-A-KEY.
    DISPLAY '900-MOVE-Q-A-KEY.' SEC-NO.
    IF SEC-NO = 0 MOVE "5004" TO Q-A-KEY.
    IF SEC-NO = 1 MOVE "5005" TO Q-A-KEY.
    IF SEC-NO = 2 MOVE "5006" TO Q-A-KEY.
    MOVE SPACES TO PROMPT-VERB.
    PERFORM 104-SEEK-QA THRU 170-ACCEPT-TERMINAL.
    IF IO-DATA (1) = "Y" MOVE 1 TO INPUT-TYPE
    GO TO 900-END.
    IF IO-DATA (1) = "N" MOVE 0 TO INPUT-TYPE
    GO TO 900-END.
    DISPLAY "INVALID RESPONSE S/B Y OR N" UPON INTYPER.
    GO TO 900-MOVE-Q-A-KEY.
900-END.
    MOVE ZERO TO CHG-SW INPUT-TYPE-SW PROMPT-TYPE.
    MOVE 1 TO GO-SW ACCEPT-SW.
    MOVE 2 TO VERB-NO.
910-EXIT-MODULE.
    DISPLAY '910-EXIT-MODULE.'.
    EXIT PROGRAM.
   ". /