IDENTIFICATION DIVISION.
PROGRAM-ID. QUOTR1.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
DATA DIVISION.
LINKAGE SECTION.
01  Q-A-REC.
  03 QA-REC-KEY   PIC 9(4).
   03  QA-KEYWORD   PIC X(6).
   03  QA-EDIT-TYPE PIC X.
   03  QA-SEC-NO    PIC X.
   03  Q-A-MESG   PIC  X(320).
  03 MESG-QA REDEFINES Q-A-MESG.
    07 BYTE-CNT   PIC X(12).
    07  CHARS   PIC X(320).
01  WKS-SECT.
 02 INX-CHR PIC 9(8).
 02 CHG-SW PIC 9.
 02 INPUT-TYPE-SW PIC 9.
 02 CNT-5 PIC 9.
 02 INX-KEYWORD PIC 999.
 02 Q-A-KEY PIC 9(4).
 02 INX-IO PIC 999.
 02 BLANK-CNT PIC 9.
 02 INX-KEYWORD-WK PIC 999.
 02 INX-D-TYPE PIC 999.
 02 INX-NUM PIC 99.
 02 INX-B1 PIC 9.
 02 INX-B2 PIC 9.
 02 QT PIC 9.
 02 REMD PIC 9.
 02 SAVE-IX-IO PIC 999.
 02 INX-Y PIC 999.
 02 Y-SW PIC 9.
 02 Y-SW2 PIC 9.
 02 INX-T PIC 999.
 02 BAD-NUMERIC PIC X(22).
 02 ERR-SW PIC 9.
 02 INX-A PIC 99.
 02 KEY-GO-TO PIC 999.
 02 PRE-SW PIC 9.
 02 EDIT-TYPE-WK PIC X.
 02 OPEN-SW PIC 9.
 02 TESTC PIC 99.
 02 INX-C PIC 99.
 02 C-SW PIC 9.
 02 QUOTRM-1 PIC X(10).
 02 F-TYPE PIC X.
 02 MSG-0 PIC X(9).
 02 MSG-1 PIC X(9).
 02 MSG-2 PIC X(9).
 02 INVAL-KW-SW PIC 9.
 02 B-EDIT-SW PIC 9.
 02 DATE-WORKS.
 03 DATE-WORK.
 05 FILLER PIC 9(6).
 05 FEB-WK PIC 99.
 05 FILLER PIC X(40).
 03 WORK-DATE REDEFINES DATE-WORK OCCURS 12 INDEXED BY INX-DATE.
 05 MO-WK PIC 99.
 05 DA-WK PIC 99.
 03 VERB-TABLE.
 05 FILLER PIC X(10).
 05 FILLER PIC X(10).
 05 FILLER PIC X(10).
 03 TABLE-BERB REDEFINES VERB-TABLE.
 05 VERB-TBL OCCURS 3 PIC X(10).
 03 A-TYPE-40.
 05 A-TYPE OCCURS 40 TIMES PIC X.
 03 PROMPT-AREA.
 05 PROMPT-VERB PIC X(10).
 05 PROMPT-NOUN PIC X(320).
 05 FILER2 REDEFINES PROMPT-NOUN.
 07 PROMPT-NUN PIC X OCCURS 320 INDEXED BY INX-NUN.
 03 DISPLAY-AREA.
 05 DISPLY-1 PIC X(80).
 05 DISPLY-1A REDEFINES DISPLY-1.
 10 DISP-1A-22 PIC X(23).
 10 DISP-1A-9 PIC X(9).
 10 DISP-1A-3 PIC ZZ9.
 10 DISP-1A-39 PIC X(35).
 10 FILLER PIC X(10).
 05 DISPLY-2 PIC X(80).
 05 DISPLY-3 PIC X(80).
 05 DISPLY-4 PIC X(80).
 03 AREA-DISPLAY REDEFINES DISPLAY-AREA.
 05 DISPY PIC X OCCURS 320 INDEXED BY INX-DISPLAY.
 02 KEYWORD-TABLE.
 03 TABLE-KEYWORDS PIC X(3600).
 03 TABLE-ENTRY REDEFINES TABLE-KEYWORDS OCCURS 300.
 05 KEYWORD PIC X(6).
 05 NUMERIC-KEY PIC 9(4).
 05 EDIT-TYPE PIC X.
 05 SEC-TYPE PIC X.
 02 IO-FIELDMAN-DATA.
 03 IO-DATA OCCURS 250 TIMES PIC X.
 02 KEYWORD-WORK6.
 03 KEYWORD-WORK.
 05 KEYWORD-WK OCCURS 6 PIC X.
 03 KEY-WORD REDEFINES KEYWORD-WORK.
 05 KEYWORD-WK2 PIC XX.
 05 FILLER PIC X(4).
 02 DATA-NAME-WORKS.
 03 DATE-TYPE.
 05 D-TYPE OCCURS 6 TIMES PIC X.
 03 TYPE-DATE REDEFINES DATE-TYPE.
 05 MO-TYPE PIC 99.
 05 DA-TYPE PIC 99.
 05 YR-TYPE PIC 99.
 03 NUMERIC-TYPE.
 05 NUM-TYPE OCCURS 12 TIMES PIC X.
 03 NUM-GRP-TYPE REDEFINES NUMERIC-TYPE PIC S9(8)V9(4).
 03 T-TYPE-ALL.
 05 T-TYPE OCCURS 4 TIMES.
 07 TYPE-T OCCURS 12 TIMES PIC X.
 03 ALL-T-TYPE REDEFINES T-TYPE-ALL.
 05 T-TYPE-1 PIC S9(8)V9(4).
 05 T-TYPE-2 PIC S9(8)V9(4).
 05 T-TYPE-3 PIC S9(8)V9(4).
 05 T-TYPE-4 PIC S9(8)V9(4).
 03 B-TYPE-ALL.
 05 B-TYPE OCCURS 4 PIC X.
 03 CLASS-TYPE.
 05 C-TYPE OCCURS 12 TIMES PIC X.
 03 TYPE-CLASS REDEFINES CLASS-TYPE.
 05 CLASS-NUM PIC 9999.
 05 CLASS-ALPHA PIC XX.
 05 CLASS-S PIC X.
 05 CLASS-EXCLUS PIC X(5).
01  COMMON-AREA.
 02 X-COMMON-AREA.
  03 SUPMON-TERMMOD-AREA PIC X(2000).
  03 SUPAREA REDEFINES SUPMON-TERMMOD-AREA.
    05 MONITOR-SWITCHES.
      10 GO-SW PIC 9.
      10 ACCEPT-SW PIC 9.
      10 ACTION-SW PIC 9.
      10 ALL-SIXES PIC 9.
      10 RESTART-SW PIC 9.
      10 RESTART-SECT PIC 9.
      10 S1L PIC 9.
      10 COM-LOC PIC 9.
      10 COM-CLS PIC 99.
      10 COM-S PIC 99.
      10 IDENT-SW PIC 99 OCCURS 10.
      10 IDEN-SEC PIC 9.
    05 MONITOR-DATA.
      10 COM-DATE-TIME.
       13 COM-DATE.
        15 COM-DTE-MO PIC 99.
        15 FILLER PIC X.
        15 COM-DTE-DA PIC 99.
        15 FILLER PIC X.
        15 COM-DTE-YR PIC 99.
       13 COM-TIME.
        15 COM-HOUR PIC 99.
        15 FILLER PIC X.
        15 COM-MIN PIC 99.
        15 FILLER PIC X.
        15 COM-SEC PIC 99.
      10 CALL-NUM-KEY PIC 9(4).
      10 CALL-EDIT-TYPE PIC X.
      10 SEC-NO PIC 9.
      10 VERB-NO PIC 9.
      10 PROMPT-TYPE PIC 9.
      10 PROMPT-NOUN-C PIC X(100).
      10 CHG-SEC-NO PIC 9.
      10 DISAS-SW PIC 9.
      10 S0-PRINT-SW PIC X.
      10 INPUT-TYPE PIC 9.
      10 USER-ID-WK.
        15 FILLER PIC XX.
        15 USR-ID4.
          20 FILLER PIC X.
          20 USR-ID-NUM PIC XXX.
        15 FILLER PIC XX.
    05 SEC-SUP-END-ITEM PIC X.
  03 SECTION-ZERO-AREA PIC X(500).
  03 SECZERO REDEFINES SECTION-ZERO-AREA.
    05 SECTION-0-DATA.
      10 OLD-QUOTE PIC 99.
      10 SAVE-QUOTE PIC 99.
      10 COM-USER-NAME PIC X(25).
      10 COM-PRODUCER-NO PIC 9(8).
      10 COM-APPLICANT-NAME PIC X(40).
      10 COM-APPLICANT-ADDR1 PIC X(40).
      10 COM-APPLICANT-ADDR2 PIC X(40).
      10 COM-APPLICANT-STATE PIC X(4).
      10 COM-APPLICANT-ZIP PIC 9(5).
      10 COM-EFF-DATE PIC 9(6).
      10 COM-POLICY-TERM PIC 9.
      10 COM-DTG-POLICY-MODIFY PIC X(8).
      10 COM-QUOTE-PLAN PIC X(7).
      10 COM-USER-LIMIT PIC 9(7).
      10 COM-BRANCH-NO PIC 99.
      10 COM-SESSION-TYPE PIC X.
      10 COM-QUOTE-DATE PIC X(8).
      10 COM-EFFECTIVE-DATE PIC X(8).
    05 SEC-COM-END-ITEM PIC X.
  03 SECTION-ONE-AREA PIC X(5000).
  03 SECONE REDEFINES SECTION-ONE-AREA.
    05 SECTION-1-DATA.
***** TOTAL PREMIUM FOR SECTION-ONE
      10 S1-TOT-PREM PIC 9(6)V99.
*****KEYWORD NUMBER
*****0075
      10 S1-LOCNSW PIC 9.
*****0076
      10 S1-EXPNOV PIC X.
      10 S1DS-GRP OCCURS 100.
        15 S1DS OCCURS 5 PIC 9.
      10 M-D PIC X(20).
      10 S1-DEDC-MIN PIC 9(6).
      10 S1-B-RISKSV PIC X.
      10 S1-C-RISKSV PIC X.
      10 S1-G-RISKSV PIC X.
      10 S1TOTLOC PIC 9.
      10 S1-ANOTHERLOC PIC X.
      10 MDS.
          20 M-D1 PIC X(8).
          20 M-D2 PIC 9(5)V9(3).
      10 PROMPT-INFO.
          20 S1-CVG-NUM PIC 99.
          20 S1-VERB-NO PIC 9.
          20 S1-CALL-NUM-KEY PIC 9(4).
          20 S1-CK-QT-INDX PIC 99.
          20 S1-CALL-EDIT-TYPE PIC X.
      10 S1-CVGSW-INDXD.
          20 SCI.
            25 S1CVG OCCURS 13 PIC 9.
          20 SCIC.
            25 S1CVGCHG OCCURS 13 PIC X.
      10 COVERAGES.
        15 CVG OCCURS 5 INDEXED BY INX-CVG.
          20 S1-CVGSW.
            25 S1-B-SW PIC 9.
            25 S1-C-SW PIC 9.
            25 S1-G-SW PIC 9.
            25 S1-O-SW PIC 9.
            25 S1-T-SW PIC 9.
            25 S1-I-SW PIC 9.
            25 S1-R-SW PIC 9.
            25 S1-V-SW PIC 9.
            25 S1-P-SW PIC 9.
            25 S1-N-SW PIC 9.
            25 S1-M-SW PIC 9.
            25 S1-F-SW PIC 9.
            25 S1-X-SW PIC 9.
            25 S1-BR-SW PIC 9.
          20 S1-CVGSW-CHG.
            25 S1-B-CHG PIC X.
            25 S1-C-CHG PIC X.
            25 S1-G-CHG PIC X.
            25 S1-O-CHG PIC X.
            25 S1-T-CHG PIC X.
            25 S1-I-CHG PIC X.
            25 S1-R-CHG PIC X.
            25 S1-V-CHG PIC X.
            25 S1-P-CHG PIC X.
            25 S1-N-CHG PIC X.
            25 S1-M-CHG PIC X.
            25 S1-F-CHG PIC X.
            25 S1-X-CHG PIC X.
            25 S1-BR-CHG PIC X.
          20 S1-LOC-TOT-PREM PIC 9(6)V99.
*****0062
          20 S1-CLSCD PIC 9.
          20 S1-STCD PIC 99.
         20 S1-AREACD PIC 99.
*****0061
          20 S1-B-FIRE PIC 9V999.
          20 S1-B-EC PIC 9V999.
          20 S1-B-VMM PIC 9V999.
*****0063
          20 S1-B-COIN-FIRE PIC 9V999.
          20 S1-B-COIN-EC PIC 9V999.
          20 S1-B-COIN-VMM PIC 9V999.
****0064
          20 S1-SPRKLR PIC X.
*****0065
          20 S1-B-RISK PIC X.
*****0066
          20 S1-C-RISK PIC X.
*****0067
          20 S1-CHGRSK PIC X.
*****0068
          20 S1-X-BURG.
            25 S1-C-BURG PIC X.
            25 S1-G-BURG PIC X.
            25 S1-O-BURG PIC X.
*****0069
          20 S1-DISC PIC 9V999.
          20 S1-DEDC PIC 9(6).
          20 S1-RFTERR PIC 99.
          20 S1-G-FIRE PIC 9V999.
          20 S1-G-EC PIC 9V999.
          20 SS-G-VMM PIC 9V999.
          20 S1-FMM OCCURS 13 PIC V999.
          20 S1-DEDCPCT PIC V99.
          20 S1-RESTART-SW PIC 9.
*****0070
          20 S1-RF-CVG PIC X(5).
*****0071
          20 S1-RF-BAS PIC X.
          20 S1-RF-BAS-B PIC X.
          20 S1-RF-BAS-C PIC X.
          20 S1-RF-BAS-G PIC X.
*****0072
*****BUILDING WORK-AREA
          20 S1-B-LIM-LBL-PCT PIC 9(7).
          20 S1-B-LIM-COIN-PCT PIC V999.
*****CONTENTS WORKAREA
*****0073
          20 S1-C-LIM-LBL-PCT PIC 9(7).
          20 S1-C-LIM-COIN-PCT PIC V999.
*****CUSTOMER GOODS WORKAREA
*****0074
          20 S1-G-LIM-LBL-PCT PIC 9(7).
          20 S1-G-LIM-COIN-PCT PIC V999.
          20 S1-G-RISK PIC X.
*****OTHER PROPERT WORKAREA
*****0077
          20 S1-O-RATE PIC V999.
          20 S1-O-LIM-LBL PIC 9(7).
          20 S1-O-COIN-PCT PIC V999.
          20 S1-O-STATE PIC 99.
          20 S1-O-FIRE PIC 9V999.
          20 S1-O-EC PIC 9V999.
*****PROPERTY IN TRANSIT WORKAREA
          20 S1-T-RATE PIC V999.
          20 S1-T-LIM-LBL PIC 9(7).
          20 S1-T-RISKFORM PIC X.
          20 S1-T-NET-RATE PIC 9V999.
*****INCOME INTERRUPTION WORKAREA
          20 S1-I-LIM-LBL PIC 9(7).
          20 S1-I-COIN-PCT PIC V999.
          20 S1-I-CTF.
            25 S1-I-CLASS PIC XXX.
            25 S1-I-FORM PIC X.
            25 S1-I-TYPE PIC X.
*****ACCOUNTS RECEIVABLE
          20 S1-R-LIM-LBL PIC 9(7).
          20 S1-R-LIM-LBLAVG PIC 9(7).
          20 R-COIN-PCT PIC V999.
          20 S1-R-RECPTL PIC X.
          20 S1-R-RCPTYP PIC X(4).
          20 S1-R-CRED PIC V999.
*****0087
          20 S1-R-RCDDUP PIC 99.
*****0088
          20 S1-R-ARRKCL PIC X.
          20 S1-R-RATE PIC 9V999.
          20 S1-R-NRFPREM PIC 9(5)V99.
          20 S1-R-RFPREM PIC 9(5)V99.
*****VALUABLE PAPERS WORKAREA
          20 S1-V-LIM-LBL PIC 9(7).
          20 S1-V-COIN-PCT PIC V999.
*****0089
          20 S1-V-RECPTL PIC X.
*****0090
          20 S1-V-RCPTYP PIC X(4).
*****PLATE GLASS WORK AREA
          20 S1-P-LIM-LBL PIC 9(7).
          20 S1-P-COINCT PIC V999.
*****NEON SIGNS WORK AREA
          20 S1-N-LIM-LBL PIC 9(7).
          20 S1-N-NUMOFSIGNS PIC 99.
*****MARINE WORKAREA
          20 S1-M-RATE PIC V999.
          20 S1-M-LIM-LBL PIC 9(7).
          20 S1-M-COIN-PCT PIC V999.
*****FIRE WORKAREA
          20 S1-F-LIM-LBL PIC 9(7).
          20 S1-F-COIN-PCT PIC V999.
          20 S1-BPREMIUM PIC 9(5)V99.
          20 S1-CPREMIUM PIC 9(5)V99.
          20 S1-GPREMIUM PIC 9(5)V99.
          20 S1-TPREMIUM PIC 9(5)V99.
          20 S1-OPREMIUM PIC 9(5)V99.
          20 S1-RPREMIUM PIC 9(5)V99.
          20 S1-VPREMIUM PIC 9(5)V99.
          20 S1-RISKFORM-CODE PIC X.
***** INDEX FOR S1DS DATA SWITCHES
          20 S1DSINDX PIC 99.
          20 S1-C-FIRE PIC 9V999.
          20 S1-C-EC PIC 9V999.
          20 S1-C-VMM PIC 9V999.
***** RESULTS OF S1-B-FIRE S1-B-EC *.95 OR *.90
          20 S1-BF PIC 99V999.
          20 S1-BEC PIC 99V999.
***** ADJUSTED BY .70 FOR VIRGINIA APT
          20 S1-BFVA PIC 99V999.
          20 S1-BECVA PIC 99V999.
          20 S1-STATE PIC XX.
          20 S1-BF-NET-RATE PIC 99V999.
          20 S1-BEC-NET-RATE PIC 99V999.
          20 S1-BFORM-NET-RATE PIC 99V999.
***** RESULTS OF S1-BLDG-LIM * NET-RATES
          20 S1-BF-PREM PIC 9(5)V99.
          20 S1-BEC-PREM PIC 9(5)V99.
          20 S1-BFORM-PREM PIC 9(5)V99.
***** RESULTS OF S1-C-FIRE S1-C-EC *.95 OR *.90
          20 S1-CF PIC 99V999.
          20 S1-CEC PIC 99V999.
***** ADJUSTED BY .70 FOR VIRGINIA APT
          20 S1-CEVA PIC 99V999.
          20 S1-CECVA PIC 99V999.
          20 S1-CF-NET-RATE PIC 99V999.
          20 S1-CEC-NET-RATE PIC 99V999.
          20 S1-CFORM-NET-RATE PIC 99V999.
***** RESULTS OF S1-CNTS-LIM * NET-RATES
          20 S1-CF-PREM PIC 9(5)V99.
          20 S1-CEC-PREM PIC 9(5)V99.
          20 S1-CFORM-PREM PIC 9(5)V99.
***** RESULTS OF S1-G-FIRE S1-G-EC *.95 OR *.90
          20 S1-GF PIC 99V999.
          20 S1-GEC PIC 99V999.
***** ADJUSTED BY .70 FOR VIRGINIA APT
          20 S1-GEVA PIC 99V999.
          20 S1-GECVA PIC 99V999.
          20 S1-GF-NET-RATE PIC 99V999.
          20 S1-GEC-NET-RATE PIC 99V999.
          20 S1-GFORM-NET-RATE PIC 99V999.
***** RESULTS OF S1-BLDG-LIM * NET-RATES
          20 S1-GF-PREM PIC 9(5)V99.
          20 S1-GEC-PREM PIC 9(5)V99.
          20 S1-GFORM-PREM PIC 9(5)V99.
* KW00 DS#
          20 S1-I-CFT PIC X(40).
          20 S1-I-CLASS PIC XXX.
          20 S1-I-FORM PIC X.
          20 S1-I-TYPE PIC X.
          20 S1-B-BLNKT PIC X.
          20 S1-B-DISCAMT PIC 9(6).
          20 S1-C-DISCAMT PIC 9(6).
          20 S1-G-DISCAMT PIC 9(6).
          20 S1-O-DISCAMT PIC 9(6).
          20 S1-T-DISCAMT PIC 9(6).
          20 S1-I-DISCAMT PIC 9(6).
          20 S1-R-DISCAMT PIC 9(6).
          20 S1-V-DISCAMT PIC 9(6).
          20 S1-P-DISCAMT PIC 9(6).
          20 S1-N-DISCAMT PIC 9(6).
          20 S1-M-DISCAMT PIC 9(6).
          20 S1-F-DISCAMT PIC 9(6).
          20 S1-X-DISCAMT PIC 9(6).
          20 S1-CVGCHG PIC X.
          20 S1-L-STA PIC 99.
          20 S1-LOCAD1 PIC X(40).
          20 S1-LOCAD2 PIC X(40).
          20 S1-C-RFCVF PIC X.
          20 S1-G-RFCVF PIC X.
          20 S1-O-RFCVF PIC X.
          20 S1-R-RFCVF PIC X.
          20 S1-CRF-SA PIC X.
          20 S1-GRF-SA PIC X.
          20 S1-ORF-SA PIC X.
          20 S1-RRF-SA PIC X.
          20 S1-G-RFSLIM PIC 9(7).
          20 S1-C-RFSLIM PIC 9(7).
          20 S1-O-RFSLIM PIC 9(7).
          20 S1-R-RFSLIM PIC 9(7).
          20 S1-C-NRFCV PIC X.
          20 S1-G-NRFCV PIC X.
          20 S1-O-NRFCV PIC X.
          20 S1-R-NRFCV PIC X.
      10 S1-C-RFALIM PIC 9(7).
      10 S1-G-RFALIM PIC 9(7).
      10 S1-O-RFALIM PIC 9(7).
      10 S1-R-RFALIM PIC 9(7).
      10 S1-CVGALPHA PIC X(40).
      10 S1-ALL-SIXES PIC 9.
      10 S1-MORLOC PIC X.
      10 S1-TACKON OCCURS 5.
        15 S1-CF-BLNKT PIC X.
        15 S1-CEC-BLNKT PIC X.
        15 S1-BF-BLNKT PIC X.
        15 S1-BEC-BLNKT PIC X.
        15 S1-CB-BLNKT PIC X.
    05 SEC-1-END-ITEM PIC X.
  03 SECTION-ONE-BURG PIC X(20500).
  03 BURGLARY-SECTION REDEFINES SECTION-ONE-BURG.
      10 S1-BURGLARY-SW OCCURS 5 PIC 9.
      10 BURG-COV-SWS.
        15 B-COV-SWS OCCURS 5 PIC 9(7).
      10 B-COV-SWS-1 REDEFINES BURG-COV-SWS.
        15 B-COV-SW-1 OCCURS 5.
          20 B-COV-SW OCCURS 7 PIC 9.
      10 B-COV-REDEF REDEFINES BURG-COV-SWS.
        15 B-COV-RED OCCURS 5.
          20 S1-MOS-COV-SW PIC 9.
          20 S1-MS-COV-SW PIC 9.
          20 S1-MR-COV-SW PIC 9.
          20 S1-BFMS-COV-SW PIC 9.
          20 S1-BFS-COV-SW PIC 9.
          20 S1-SBR-COV-SW PIC 9.
          20 S1-OBR-COV-SW PIC 9.
      10 S1-B-DATA-SWITCHES OCCURS 5.
        15 B-BMON01-SW PIC 9.
        15 B-BMON02-SW PIC 9.
        15 B-BMON03-SW PIC 9.
        15 B-BMON04-SW PIC 9.
        15 B-BMON05-SW PIC 9.
        15 B-BMON06-SW PIC 9.
        15 B-BMON07-SW PIC 9.
        15 B-BMON08-SW PIC 9.
        15 B-BMON11-SW PIC 9.
        15 B-BMON12-SW PIC 9.
        15 B-BMON13-SW PIC 9.
        15 B-BMON14-SW PIC 9.
        15 B-BMON15-SW PIC 9.
        15 B-BMON16-SW PIC 9.
        15 B-BMON17-SW PIC 9.
        15 B-BMON18-SW PIC 9.
        15 B-BMON19-SW PIC 9.
        15 BURG-COV-INPUT-SW PIC 9.
      10 B-MOS-DATA-SWITCHES.
        15 MOS-SWITCHES OCCURS 5 PIC X(44).
      10 B-MOS-DATA-SWS REDEFINES B-MOS-DATA-SWITCHES.
        15 MOS-DATA-SWS OCCURS 5.
          20 MOS-COMMON-SWS PIC 99.
          20 MOS-DIV-SWS OCCURS 3.
            25 MOS-DIV-SW PIC 9(14).
      10 B-MOS-SWS REDEFINES B-MOS-DATA-SWITCHES.
        15 MOS-SWS OCCURS 5.
          20 B-MOS-01-SW PIC 9.
          20 B-MOS-02W PIC 9.
          20 B-MOS-DIV OCCURS 3.
            25 B-MOS-10-SW PIC 9.
            25 B-MOS-11-SW PIC 9.
            25 B-MOS-12-SW PIC 9.
            25 B-MOS-13-SW PIC 9.
            25 B-MOS-14-SW PIC 9.
            25 B-MOS-15-SW PIC 9.
            25 B-MOS-16-SW PIC 9.
            25 B-MOS-17-SW PIC 9.
            25 B-MOS-18-SW PIC 9.
            25 B-MOS-19-SW PIC 9.
            25 B-MOS-20-SW PIC 9.
            25 B-MOS-21-SW PIC 9.
            25 B-MOS-22-SW PIC 9.
            25 B-MOS-23-SW PIC 9.
      10 B-MS-DATA-SWITCHES.
        15 MS-SWITCHES OCCURS 5 PIC X(20).
      10 B-MS-DATA-SWS REDEFINES B-MS-DATA-SWITCHES.
        15 MS-DATA-SWS OCCURS 5.
          20 B-MS-001-SW PIC 9.
          20 B-MS-002-SW PIC 9.
          20 B-MS-003-SW PIC 9.
          20 B-MS-004-SW PIC 9.
          20 B-MS-005-SW PIC 9.
          20 B-MS-006-SW PIC 9.
          20 B-MS-007-SW PIC 9.
          20 B-MS-008-SW PIC 9.
          20 B-MS-009-SW PIC 9.
          20 B-MS-010-SW PIC 9.
          20 B-MS-011-SW PIC 9.
          20 B-MS-012-SW PIC 9.
          20 B-MS-013-SW PIC 9.
          20 B-MS-014-SW PIC 9.
          20 B-MS-015-SW PIC 9.
          20 B-MS-016-SW PIC 9.
          20 B-MS-017-SW PIC 9.
          20 B-MS-018-SW PIC 9.
          20 B-MS-019-SW PIC 9.
          20 B-MS-020-SW PIC 9.
      10 B-MR-DATA-SWITCHES.
        15 MR-SWITCHES OCCURS 5 PIC X(43).
      10 B-MR-DATA-SWS REDEFINES B-MR-DATA-SWITCHES.
        15 MR-DATA-SWS OCCURS 5.
          20 MR-COMMON-SWS PIC 999.
          20 MR-INSIDE-SWS PIC 9(9).
          20 MR-COM-MSGR-SW PIC 9.
          20 MR-MSGR-SWS OCCURS 5.
            25 MR-MSGR-SW PIC 9(6).
      10 B-MR-SWS REDEFINES B-MR-DATA-SWITCHES.
        15 MR-SWS OCCURS 5.
          20 B-MR-001-SW PIC 9.
          20 B-MR-002-SW PIC 9.
          20 B-MR-003-SW PIC 9.
          20 B-MR-100-SW PIC 9.
          20 B-MR-101-SW PIC 9.
          20 B-MR-102-SW PIC 9.
          20 B-MR-103-SW PIC 9.
          20 B-MR-104-SW PIC 9.
          20 B-MR-105-SW PIC 9.
          20 B-MR-106-SW PIC 9.
          20 B-MR-107-SW PIC 9.
          20 B-MR-108-SW PIC 9.
          20 B-1-SW PIC 9.
          20 B-MR-MSGRS OCCURS 5.
            25 B-MR-202-SW PIC 9.
            25 B-MR-203-SW PIC 9.
            25 B-MR-204-SW PIC 9.
            25 B-MR-205-SW PIC 9.
            25 B-MR-206-SW PIC 9.
            25 B-MR-207-SW PIC 9.
      10 B-BFMS-DATA-SWITCHES.
        15 BFMS-SWITCHES OCCURS 5 PIC X(58).
      10 B-BFMS-DATA-SWS REDEFINES B-BFMS-DATA-SWITCHES.
        15 BFMS-DATA-SWS OCCURS 5.
          20 BFMS-COMMON-SWS PIC 9(4).
          20 BFMS-INSIDE-SWS PIC 9(17).
          20 BFMS-COM-MSGR-SW PIC 9.
          20 BFMS-MSGR-SW OCCURS 5.
            25 BFMS-MSGR-SWS PIC 9(6).
          20 BFMS-COM-AMV-SW PIC 9.
          20 BFMS-AMV-SW PIC 9(5).
      10 B-BFMS-SWS REDEFINES B-BFMS-DATA-SWITCHES.
        15 BFMS-SWS OCCURS 5.
          20 B-BF-001-SW PIC 9.
          20 B-BF-002-SW PIC 9.
          20 B-BF-003-SW PIC 9.
          20 B-BF-004-SW PIC 9.
          20 B-BF-100-SW PIC 9.
          20 B-BF-101-SW PIC 9.
          20 B-BF-103-SW PIC 9.
          20 B-BF-104-SW PIC 9.
          20 B-BF-105-SW PIC 9.
          20 B-BF-106-SW PIC 9.
          20 B-BF-107-SW PIC 9.
          20 B-BF-108-SW PIC 9.
          20 B-BF-109-S PIC 9.
          20 B-BF-110-SW PIC 9.
          20 B-BF-111-SW PIC 9.
          20 B-BF-112-SW PIC 9.
          20 B-BF-113-SW PIC 9.
          20 B-BF-114-SW PIC 9.
          20 B-BF-115-SW PIC 9.
          20 B-BF-116-SW PIC 9.
          20 B-BF-117-SW PIC 9.
          20 B-BF-201-SW PIC 9.
          20 B-BF-MSGRS OCCURS 5.
            25 B-BF-202-SW PIC 9.
            25 B-BF-203-SW PIC 9.
            25 B-BF-204-SW PIC 9.
            25 B-BF-205-SW PIC 9.
            25 B-BF-206-SW PIC 9.
            25 B-BF-207-SW PIC 9.
          20 B-BF-301-SW PIC 9.
          20 B-BF-302-SW OCCURS 5 PIC 9.
      10 B-BFS-DATA-SWITCHES.
        15 BFS-SWITCHES OCCURS 5 PIC 99.
      10 B-BFS-DATA-SWS REDEFINES B-BFS-DATA-SWITCHES.
        15 BFS-DATA-SWS OCCURS 5.
          20 B-BFS-01-SW PIC 9.
          20 B-BFS-02-SW PIC 9.
      10 B-SBR-DATA-SWITCHES.
        15 SBR-SWITCHES OCCURS 5 PIC 99.
      10 B-SBR-DATA-SWS REDEFINES B-SBR-DATA-SWITCHES.
        15 SBR-DATA-SWS OCCURS 5.
          20 B-SBR-01-SW PIC 9.
          20 B-SBR-02-SW PIC 9.
      10 B-OBR-DATA-SWITCHES.
        15 OBR-SWITCHES OCCURS 5 PIC 9(12).
      10 B-OBR-DATA-SWS REDEFINES B-OBR-DATA-SWITCHES.
        15 OBR-DATA-SWS OCCURS 5.
          20 OBR-COMMON-SWS PIC 9(7).
          20 OBR-PSD-SW OCCURS 5 PIC 9.
      10 B-OBR-SWS REDEFINES B-OBR-DATA-SWITCHES.
        15 OBR-SWS OCCURS 5.
          20 B-OBR-01-SW PIC 9.
          20 B-OBR-02-SW PIC 9.
          20 B-OBR-03-SW PIC 9.
          20 B-OBR-04-SW PIC 9.
          20 B-OBR-05-SW PIC 9.
          20 B-OBR-06-SW PIC 9.
          20 B-OBR-07-SW PIC 9.
          20 B-OBR-08-SW OCCURS 5 PIC 9.
      10 B-DDS-TABLE.
        15 B-DDS-TBL OCCURS 5 PIC 9(7).
      10 B-DDS-TBL-1 REDEFINES B-DDS-TABLE.
        15 B-DDS-T OCCURS 5.
          20 B-DDS OCCURS 7 PIC 9.
      10 B-DDS-RED REDEFINES B-DDS-TABLE.
        15 B-DDS-R OCCURS 5.
          20 B-MOS000-SW PIC 9.
          20 B-MS0000-SW PIC 9.
          20 B-MR0000-SW PIC 9.
          20 B-BFMS00-SW PIC 9.
          20 B-BFS000-SW PIC 9.
          20 B-SBR000-SW PIC 9.
          20 B-OBR000-SW PIC 9.
      10 B-RISK-CLASS OCCURS 5 PIC 99.
      10 B-MS-RISK-CLASS OCCURS 5 PIC 99.
      10 B-MR-RISK-CLASS OCCURS 5 PIC 99.
      10 B-BFMS-RISK-CLASS OCCURS 5 PIC 99.
      10 B-BFS-RISK-CLASS OCCURS 5 PIC 99.
      10 B-SBR-RISK-CLASS OCCURS 5 PIC 99.
      10 BRG-EXCEPT OCCURS 5 PIC X.
      10 BRG-OPEN-24-HRS-IND OCCURS 5 PIC X.
      10 BRG-PKG-MOD-1 OCCURS 5 PIC S99V999.
      10 BRG-PKG-MOD-2 OCCURS 5 PIC S99V999.
      10 BRG-PKG-MOD-3 OCCURS 5 PIC S99V999.
      10 BRG-SCFM-INDICATOR OCCURS 5 PIC X.
      10 BRG-TERR-CODE OCCURS 5 PIC 9(4).
      10 B-MOS-CHANGE-IND OCCURS 5 PIC X.
      10 B-MOS-DIV-CHANGE-IND OCCURS 5 PIC 999.
      10 B-MR-IP-CHANGE-IND OCCURS 5 PIC X.
      10 B-MR-OP-CHANGE-IND OCCURS 5 PIC X.
      10 B-MR-OP-MSGR-CHANGES OCCURS 5 PIC 9(5).
      10 B-BFMS-IP-CHANGE-IND OCCURS 5 PIC X.
      10 B-BFMS-OP-CHANGE-IND OCCURS 5 PIC X.
      10 B-BFMS-OP-MSGR-CHNGE OCCURS 5 PIC 9(5).
      10 B-BFMS-AMV-CHNGE-IND OCCURS 5 PIC X.
      10 BURG-YN OCCURS 5 PIC X.
      10 B-COV-INPUT.
        15 BURG-COV-INPUT OCCURS 5 PIC X(40).
      10 BURG-COV-INPUT-1 REDEFINES B-COV-INPUT.
        15 BUR-COV-INPUT OCCURS 5.
          20 B-COV-INPUT-BYTE OCCURS 40 PIC X.
      10 B-COV-HOLD.
        15 BURG-COV-HOLD OCCURS 5 PIC X(7).
      10 BURG-COV-HOLD-1 REDEFINES B-COV-HOLD.
        15 BUR-COV-HOLD OCCURS 5.
          20 B-COV-HOLD-BYTE OCCURS 7 PIC X.
      10 BURG-COV-TABLE.
        15 B-COV-TABLE OCCURS 5.
          20 BURG-COV-YN-TABLE PIC X(7).
      10 B-COV-YN REDEFINES BURG-COV-TABLE.
        15 B-COV-YN-TAB OCCURS 5.
          20 BURG-COV-YN OCCURS 7 PIC X.
      10 BURG-COV-INPUT-REDEF REDEFINES BURG-COV-TABLE.
        15 B-COV-INPUT-R OCCURS 5.
          20 B-MOS-COV-SW PIC X.
          20 B-MS-COV-SW PIC X.
          20 B-MR-COV-SW PIC X.
          20 B-BFMS-COV-SW PIC X.
          20 B-BFS-COV-SW PIC X.
          20 B-SBR-COV-SW PIC X.
          20 B-OBR-COV-SW PIC X.
      10 BRG-CHANGE OCCURS 5 PIC 9.
      10 BRG-RESTART-SW PIC 9.
      10 DIVSUB PIC 9.
      10 MSGRSUB PIC 9.
      10 B-BASE-RATE PIC 99V999.
      10 B-TBL-RATE PIC 9(5)V99.
      10 B-BASE-AMOUNT PIC 9(6)V999.
      10 B-S-CASH-REG PIC 9(5)V99.
      10 B-S-KLS PIC 9(5)V99.
      10 B-D-WATCHMAN PIC 99V999.
      10 B-D-PRM-ALARM PIC 99V999.
      10 B-D-BR-GLASS PIC 99V999.
      10 B-D-SECURITIES PIC 99V999.
      10 B-D-24-HRS PIC 99V999.
      10 B-D-TEAR-GAS PIC 99V999.
      10 B-D-SAFE-VAULT PIC 99V999.
      10 B-D-BR-ENCL PIC 99V999.
      10 B-D-BRE-ALARM PIC 99V999.
      10 B-D-PB-ALARM PIC 99V999.
      10 B-D-GUARD PIC 99V999.
      10 B-D-HOLDUP PIC 99V999.
      10 B-D-MSG-BAG PIC 99V999.
      10 B-D-PRIV-CONV PIC 99V999.
      10 B-D-R-ROUTE PIC 99V999.
      10 B-D-BRG-ALARM PIC 99V999.
      10 B-S-SCFM PIC 99V999.
      10 B-ATR-A PIC 9(5)V99.
      10 B-ATR-B PIC 9(5)V99.
      10 B-ATR-C PIC 9(5)V99.
      10 B-ATR-D PIC 9(5)V99.
      10 B-ATR-E PIC 9(5)V99.
      10 B-ATR-F PIC 9(5)V99.
      10 B-ATR-G PIC 9(5)V99.
      10 B-ATR-H PIC 9(5)V99.
      10 B-ATR-I PIC 9(5)V99.
      10 B-ATR-J PIC 9(5)V99.
      10 B-ATR-K PIC 9(5)V99.
      10 B-ATR-L PIC 9(5)V99.
      10 B-ATR-M PIC 9(5)V99.
      10 B-ATR-N PIC 9(5)V99.
      10 B-ATR-O PIC 9(5)V99.
      10 B-ATR-P PIC 9(5)V99.
      10 B-ATR-Q PIC 9(5)V99.
      10 B-ATR-R PIC 9(5)V99.
      10 B-ATR-S PIC 9(5)V99.
      10 B-BASE-PREMIUM PIC 9(7).
      10 B-ADJ-PREMIUM PIC 9(7).
      10 B-ADJ-BASE-RATE-3 PIC 9(5)V99.
      10 B-SURCD-TBL-RATE PIC 9(5)V99.
      10 B-DSCT-TBL-RATE PIC 9(5)V99.
      10 B-ADJ-BASE-RATE-1 PIC 9(5)V99.
      10 B-ADJ-BASE-RATE-2 PIC 9(5)V99.
      10 B-MOS-DVD-COVERAGE OCCURS 5 PIC X.
      10 B-MOS-DIV-COUNT OCCURS 5 PIC 9.
      10 BDIV PIC 9.
      10 B-MOS-LOCATIONS OCCURS 5.
        15 B-MOS-DIVISIONS OCCURS 3.
          20 B-MOS-TRD-GRP PIC 9.
          20 B-MOS-INS-AMOUNT PIC 9(9).
          20 B-MOS-WMN-INDICATOR PIC X.
          20 B-MOS-WMN-CLASS-A PIC 99.
          20 B-MOS-WMN-CLASS-B PIC 99.
          20 B-MOS-WMN-CLASS-C PIC 99.
          20 B-MOS-WMN-CLASS-D PIC 99.
          20 B-MOS-WMN-CLASS-E PIC 99.
          20 B-MOS-WMN-CLASS-F PIC 99.
          20 B-MOS-PA-INDICATOR PIC X.
          20 B-MOS-PA-DATA.
            25 B-MOS-PA-CATG PIC 9.
            25 B-MOS-PA-INSTL PIC 9.
            25 B-MOS-PA-CLASS PIC X.
          20 B-MOS-BG-INDICATOR PIC X.
          20 B-MOS-TF-INDICATOR PIC X.
          20 B-MOS-TF-DATA.
            25 B-MOS-TF-CATG PIC 9.
            25 B-MOS-TF-AMOUNT PIC 9(9).
          20 B-MOS-TF-SURCD PIC 9(5)V99.
          20 B-MOS-TERR-MULT PIC 99V999.
          20 B-MOS-TF-RATE PIC 99V999.
          20 B-MOS-WMN-DSCT PIC 9(5)V99.
          20 B-MOS-PA-DSCT PIC 9(5)V99.
          20 B-MOS-BRG-DSCT PIC 9(5)V99.
          20 B-MOS-BASE-PREMIUM PIC 9(7).
          20 B-MOS-ADJ-PREMIUM PIC 9(7).
          20 B-MOS-ADJ-BASE-RATE-1 PIC 9(5)V99.
          20 B-MOS-ADJ-BASE-RATE-2 PIC 9(5)V99.
          20 B-MOS-ADJ-BASE-RATE-3 PIC 9(5)V99.
          20 B-MOS-PMOD-RATE-1 PIC 9(5)V99.
          20 B-MOS-SURCD-RATE PIC 9(5)V99.
          20 B-MOS-DSCTD-RATE PIC 9(5)V99.
          20 B-MOS-FINAL-PREMIUM PIC 9(7).
          20 B-MOS-PREMIUM PIC 9(7).
          20 B-MOS-TBL-RATE PIC 9(5)V99.
      10 B-MS-SAFE-CLASS OCCURS 5 PIC XX.
      10 B-MS-INS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-MS-CASH-INDICATOR OCCURS 5 PIC X.
      10 B-MS-CASH-DATA OCCURS 5.
        15 B-MS-CASH-TYPE PIC 9.
        15 B-MS-CASH-AMOUNT PIC 9(9).
      10 B-MS-KLS-INDICATOR OCCURS 5 PIC X.
      10 B-MS-KLS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-MS-SEC-INDICATOR OCCURS 5 PIC X.
      10 B-MS-TGS-INDICATOR OCCURS 5 PIC X.
      10 B-MS-WMN-INDICATOR OCCURS 5 PIC X.
      10 B-MS-WMN-CLASS-A OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-B OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-C OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-D OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-E OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-F OCCURS 5 PIC 99.
      10 B-MS-SVA-INDICATOR OCCURS 5 PIC X.
      10 B-MS-SVA-DATA OCCURS 5.
        15 B-MS-SVA-SYSTEM PIC X.
        15 B-MS-SVA-INSTL PIC 9.
        15 B-MS-SVA-CLASS PIC X.
      10 B-MS-PAS-INDICATOR OCCURS 5 PIC X.
      10 B-MS-PAS-DATA OCCURS 5.
        15 B-MS-PAS-CATG PIC 9.
        15 B-MS-PAS-INSTL PIC 9.
        15 B-MS-PAS-CLASS PIC X.
      10 B-MS-CASH-SURCH OCCURS 5 PIC 9(5)V99.
      10 B-MS-KLS-SURCH OCCURS 5 PIC 9(5)V99.
      10 B-MS-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-MS-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MS-CASH OCCURS 5 PIC 9(5)V99.
      10 B-MS-KLS OCCURS 5 PIC 9(5)V99.
      10 B-MS-SURC-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MS-WMN-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-PA-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-SEC-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-24-HRS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-TEAR-GAS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-SAFE-VAULT-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-DSCT-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MS-PMOD-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MS-ADJ-BASE-RATE-1 OCCURS 5 PIC 9(5)V99.
      10 B-MS-ADJ-BASE-RATE-2 OCCURS 5 PIC 9(5)V99.
      10 B-MS-ADJ-BASE-RATE-3 OCCURS 5 PIC 9(5)V99.
      10 B-MS-BASIC-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-SCFM-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-CRCD-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-FINAL-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-MULT-EXP OCCURS 5 PIC 9(9).
      10 B-BFS-INS-AMOUNT OCCURS 5 PIC 9(4).
      10 B-BFS-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-BFS-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-BFS-SCFM-RATE OCCURS 5 PIC 99V999.
      10 B-BFS-FINAL-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFS-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFS-ADJ-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFS-ADJ-RATE-1 OCCURS 5 PIC 9(5)V99.
      10 B-BFS-ADJ-RATE-2 OCCURS 5 PIC 9(5)V99.
      10 B-BFS-ADJ-RATE OCCURS 5 PIC 9(5)V99.
      10 B-SBR-INS-AMOUNT OCCURS 5 PIC 9(4).
      10 B-SBR-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-SBR-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-SBR-SCFM-RATE OCCURS 5 PIC 99V99.
      10 B-SBR-FINAL-PREMIUM OCCURS 5 PIC 9(7).
      10 B-SBR-PREMIUM OCCURS 5 PIC 9(7).
      10 B-SBR-ADJ-PREMIUM OCCURS 5 PIC 9(7).
      10 B-SBR-ADJ-RATE-1 OCCURS 5 PIC 9(5)V99.
      10 B-SBR-ADJ-RATE-2 OCCURS 5 PIC 9(5)V99.
      10 B-SBR-ADJ-RATE OCCURS 5 PIC 9(5)V99.
      10 B-OBR-INS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-OBR-MSD-COVERAGE OCCURS 5 PIC X.
      10 B-OBR-MSD-AMOUNT OCCURS 5 PIC 9(9).
      10 B-OBR-MSD-MEDIA OCCURS 5 PIC X.
      10 B-OBR-MSD-SEC-ONLY OCCURS 5 PIC X.
      10 B-OBR-PSD-COVERAGE OCCURS 5 PIC X.
      10 B-OBR-PSD-PEOPLE OCCURS 5 PIC 9.
      10 BPPL PIC 9.
      10 B-OBR-BASIC-PREMIUM OCCURS 5 PIC 9(7)V99.
      10 B-OBR-WS-F OCCURS 5 PIC 9(5)V99.
      10 B-OBR-MSD-SURCH OCCURS 5 PIC 9(5)V99.
      10 B-OBR-ADJ-MSD-SURCH OCCURS 5 PIC 9(5)V99.
      10 B-OBR-ADJ-PREMIUM OCCURS 5 PIC 9(7)V99.
      10 B-OBR-ADJ-PREMIUM-2 OCCURS 5 PIC 9(7)V99.
      10 B-OBR-ADJ-1 OCCURS 5 PIC 9(7)V99.
      10 B-OBR-ADJ-2 OCCURS 5 PIC 9(7)V99.
      10 B-OBR-ADJ-3 OCCURS 5 PIC 9(7)V99.
      10 B-OBR-MSD-ADJ-1 OCCURS 5 PIC 9(5)V99.
      10 B-OBR-MSD-ADJ-2 OCCURS 5 PIC 9(5)V99.
      10 B-OBR-MSD-ADJ-3 OCCURS 5 PIC 9(5)V99.
      10 B-OBR-LOCATIONS OCCURS 5.
        15 B-OBR-PEOPLE OCCURS 5.
          20 B-OBR-PSD-AMOUNT PIC 9(9).
          20 B-OBR-PSD-SURCH PIC 9(5)V99.
          20 B-OBR-PSD-ADJ-1 PIC 9(4)V99.
          20 B-OBR-PSD-ADJ-2 PIC 9(5)V99.
          20 B-OBR-PSD-ADJ-3 PIC 9(5)V99.
      10 B-BF-IP-COVERAGE OCCURS 5 PIC X.
      10 B-BF-OP-COVERAGE OCCURS 5 PIC X.
      10 B-BF-AV-COVERAGE OCCURS 5 PIC X.
      10 B-BF-SEC-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-INS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-BFI-SAFE-CLASS OCCURS 5 PIC XX.
      10 B-BFI-TGS-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-WMN-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-WMN-CLASS-A OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-B OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-C OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-D OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-E OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-F OCCURS 5 PIC 99.
      10 B-BFI-GUARDS-IND OCCURS 5 PIC X.
      10 B-BFI-FT-GUARDS OCCURS 5 PIC 99.
      10 B-BFI-PBA-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-HAPS-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-BAS-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-BAS-DATA OCCURS 5.
        15 B-BFI-BAS-KIND PIC X.
        15 B-BFI-BAS-INSTL PIC 9.
        15 B-BFI-BAS-CLASS PIC X.
      10 B-BFI-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-BFI-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-BFI-WMN-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-SEC-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-24-HR-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-TEAR-GAS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-PBA-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-GUARD-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-HAPS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-BAS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-PMOD-RATE OCCURS 5 PIC 9(5)V99.
      10 B-BFI-ADJ-BASE-RTE-1 OCCURS 5 PIC 9(5)V99.
      10 B-BFI-ADJ-BASE-RTE-2 OCCURS 5 PIC 9(5)V99.
      10 B-BFI-ADJ-RATE OCCURS 5 PIC 9(5)V99.
      10 B-BFI-BASIC-PREM OCCURS 5 PIC 9(7).
      10 B-BFI-FINAL-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFI-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFI-MULT-EXP OCCURS 5 PIC 9(9).
      10 B-BFO-NO-MSGRS OCCURS 5 PIC 99.
      10 B-BFO-LOCATIONS OCCURS 5.
        15 B-BFO-MESSENGERS OCCURS 5.
          20 B-BFO-MSGR-GUARDS PIC 99.
          20 B-BFO-INS-AMOUNT PIC 9(9).
          20 B-BFO-PC-INDICATOR PIC X.
          20 B-BFO-MSGR-BAG-IND PIC X.
          20 B-BFO-MSGR-BAG-CLASS PIC X.
          20 B-BFO-RR-INDICATOR PIC X.
          20 B-BFO-TERR-MULT PIC 99V999.
          20 B-BFO-TBL-RATE PIC 9(5)V99.
          20 B-BFO-SEC-DSCT PIC 9(5)V99.
          20 B-BFO-24-HR-DSCT PIC 9(5)V99.
          20 B-BFO-MSG-BAG-DSCT PIC 9(5)V99.
          20 B-BFO-PC-DSCT PIC 9(5)V99.
          20 B-BFO-RR-DSCT PIC 9(5)V99.
          20 B-BFO-PMOD-RATE PIC 9(5)V99.
          20 B-BFO-ADJ-RATE-1 PIC 9(5)V99.
          20 B-BFO-ADJ-RATE-2 PIC 9(5)V99.
          20 B-BFO-ADJ-RATE PIC 9(5)V99.
          20 B-BFO-BASIC-PREM PIC 9(7).
          20 B-BFO-FINAL-PREMIUM PIC 9(7).
          20 B-BFO-PREMIUM PIC 9(7).
          20 B-BFO-MULT-EXP PIC 9(7).
      10 B-BFA-VEHICLES OCCURS 5 PIC 99.
      10 BAMV PIC 9.
      10 B-BFA-LOCATIONS OCCURS 5.
        15 B-BFA-VEH OCCURS 5.
          20 B-BFA-VEH-INSURANCE PIC 9(9).
          20 B-BFA-TERR-MULT PIC 99V999.
          20 B-BFA-TBL-RATE PIC 9(5)V99.
          20 B-BFA-SEC-DSCT PIC 9(5)V99.
          20 B-BFA-PC-DSCT PIC 9(5)V99.
          20 B-BFA-PMOD-RATE PIC 9(5)V99.
          20 B-BFA-ADJ-RATE-1 PIC 9(5)V99.
          20 B-BFA-ADJ-RATE-2 PIC 9(5)V99.
          20 B-BFA-ADJ-RATE PIC 9(5)V99.
          20 B-BFA-BASIC-PREM PIC 9(7).
          20 B-BFA-FINAL-PREMIUM PIC 9(7).
          20 B-BFA-PREMIUM PIC 9(7).
          20 B-BFA-MULT-EXP PIC 9(7).
      10 B-MR-IP-COVERAGE OCCURS 5 PIC X.
      10 B-MR-OP-COVERAGE OCCURS 5 PIC X.
      10 B-MR-SEC-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-INS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-MRI-DUTY-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-BRE-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-BREAS-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-TGS-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-GUARDS-INDICATOR OCCURS 5 PIC 99.
      10 B-MRI-PBA-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-HAPS-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-MRI-IP-SW OCCURS 5 PIC X.
      10 B-MRI-MP-EXCEP.
        15 B-MRI-MP-CLASS-1 OCCURS 5.
          20 B-MRI-MP-CL1-1 PIC 999.
          20 B-MRI-MP-CL1-2 PIC 999.
        15 B-MRI-MP-CLASS-2 OCCURS 5.
          20 B-MRI-MP-CL2-1 PIC 999.
          20 B-MRI-MP-CL2-2 PIC 999.
        15 B-MRI-MP-CLASS-3 OCCURS 5.
          20 B-MRI-MP-CL3-1 PIC 999.
          20 B-MRI-MP-CL3-2 PIC 999.
        15 B-MRI-MP-CLASS-4 OCCURS 5.
          20 B-MRI-MP-CL4-1 PIC 999.
          20 B-MRI-MP-CL4-2 PIC 999.
      10 B-MRI-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MRI-SEC-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-BRE-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-BREAS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-TGS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-GUARD-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-PBA-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-HAPS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-PMOD-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MRI-ADJ-RATE-1 OCCURS 5 PIC 9(5)V99.
      10 B-MRI-ADJ-RATE-2 OCCURS 5 PIC 9(5)V99.
      10 B-MRI-ADJ-BASE-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MRI-BASIC-PREM OCCURS 5 PIC 9(7).
      10 B-MRI-FINAL-PREM OCCURS 5 PIC 9(7).
      10 B-MRI-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MRI-MULT-EXP OCCURS 5 PIC 9(9).
      10 B-MRO-MESSENGERS OCCURS 5 PIC 99.
      10 BMSGR PIC 99.
      10 B-MRO-LOCATIONS OCCURS 5.
        15 B-MRO-MSGRS OCCURS 5.
          20 B-MRO-NO-GUARDS PIC 99.
          20 B-MRO-INS-AMOUNT PIC 9(9).
          20 B-MRO-BSSW-INDICATOR PIC X.
          20 B-MRO-BSSW-CLASS PIC X.
          20 B-MRO-PC-INDICATOR PIC X.
          20 B-MRO-RR-INDICATOR PIC X.
          20 B-MRO-TERR-MULT PIC 99V999.
          20 B-MRO-MULT-EXP PIC 9(7).
          20 B-MRO-TBL-RATE PIC 9(5)V99.
          20 B-MRO-SEC-DSCT PIC 9(5)V99.
          20 B-MRO-MSG-BAG-DSCT PIC 9(5)V99.
          20 B-MRO-PC-DSCT PIC 9(5)V99.
          20 B-MRO-RR-DSCT PIC 9(5)V99.
          20 B-MRO-PMOD-RATE PIC 9(5)V99.
          20 B-MRO-ADJ-RATE-1 PIC 9(5)V99.
          20 B-MRO-ADJ-RATE-2 PIC 9(5)V99.
          20 B-MRO-ADJ-RATE PIC 9(5)V99.
          20 B-MRO-BASIC-PREM PIC 9(7).
          20 B-MRO-FINAL-PREM PIC 9(7).
          20 B-MRO-PREMIUM PIC 9(7).
      15 B-MRO-3YR-PREMIUM PIC 9(7).
      15 B-MRO-ANNUAL-DPP PIC 9(7).
    10 B-IK-NO-BEDROOMS OCCURS 5 PIC 9(4).
    10 B-IK-POLICY-INCR OCCURS 5 PIC 9(9).
    10 B-IK-EXCLUSIONS OCCURS 5 PIC 9(6).
    10 B-IK-EXCLUDES.
      15 B-IK-EXCLS OCCURS 5.
        20 B-IK-EXCL OCCURS 6 PIC X.
    10 B-IK-EXCLUDE REDEFINES B-IK-EXCLUDES.
      15 B-IK-EXCLUD OCCURS 5.
        20 B-IK-EXCL-1 PIC X.
        20 B-IK-EXCL-2 PIC X.
        20 B-IK-EXCL-3 PIC X.
        20 B-IK-EXCL-4 PIC X.
        20 B-IK-EXCL-5 PIC X.
        20 B-IK-EXCL-6 PIC X.
    10 B-IK-BASE-PREMIUM OCCURS 5 PIC 9(7).
    10 B-IK-ADJ-PREMIUM OCCURS 5 PIC 9(7).
    10 B-IK-MP-SW OCCURS 5 PIC X.
    10 B-IK-PI-RATE OCCURS 5 PIC 9(5)V99.
    10 B-IK-PI-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E1-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E2-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E3-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E4-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E5-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-DSCTD-PREMIUM OCCURS 5 PIC 9(7).
    10 B-IK-3YR-PREMIUM OCCURS 5 PIC 9(7).
    10 B-IK-ANNUAL-DPP OCCURS 5 PIC 9(7).
    10 B-ET-TYPE-COVERAGE OCCURS 5 PIC 9.
    10 B-ET-NO-EMPLOYEES OCCURS 5 PIC 99.
    10 B-ET-GROUP-AMOUNT OCCURS 5 PIC 9(9).
    10 B-ET-RATE OCCURS 5 PIC 9(7).
    10 B-ET-ADJ-RATE OCCURS 5 PIC 9(7).
    10 B-ET-INDIVIDUAL-LIMITS.
      15 B-ET-INDIV-LIMIT OCCURS 5.
        20 B-ET-LIMIT OCCURS 20 PIC 9(9).
    10 B-ET-INDIV-LIM REDEFINES B-ET-INDIVIDUAL-LIMITS.
      15 B-ET-IND-LIM OCCURS 5.
        20 B-ET-LIMIT-1 PIC 9(9).
        20 B-ET-LIMIT-2 PIC 9(9).
        20 B-ET-LIMIT-3 PIC 9(9).
        20 B-ET-LIMIT-4 PIC 9(9).
        20 B-ET-LIMIT-5 PIC 9(9).
        20 B-ET-LIMIT-6 PIC 9(9).
        20 B-ET-LIMIT-7 PIC 9(9).
        20 B-ET-LIMIT-8 PIC 9(9).
        20 B-ET-LIMIT-9 PIC 9(9).
        20 B-ET-LIMIT-10 PIC 9(9).
        20 B-ET-LIMIT-11 PIC 9(9).
        20 B-ET-LIMIT12 PIC 9(9).
        20 B-ET-LIMIT-13 PIC 9(9).
        20 B-ET-LIMIT-14 PIC 9(9).
        20 B-ET-LIMIT-15 PIC 9(9).
        20 B-ET-LIMIT-16 PIC 9(9).
        20 B-ET-LIMIT-17 PIC 9(9).
        20 B-ET-LIMIT-18 PIC 9(9).
        20 B-ET-LIMIT-19 PIC 9(9).
        20 B-ET-LIMIT-20 PIC 9(9).
    10 B-ET-MOD-RATE OCCURS 5 PIC 9(7).
    10 B-ET-BASIC-PREMIUM OCCURS 5 PIC 9(7).
    10 B-ET-MP-SW OCCURS 5 PIC X.
    10 B-ET-3YR-PREMIUM OCCURS 5 PIC 9(7).
    10 B-ET-ANNUAL-DPP OCCURS 5 PIC 9(7).
    10 B-CH-OPTION OCCURS 5 PIC 9.
    10 B-CH-INS-AMOUNT OCCURS 5 PIC 9(9).
    10 B-CH-MS-AMOUNT OCCURS 5 PIC 9(9).
    10 B-CH-PP-AMOUNT OCCURS 5 PIC 9(9).
    10 B-CH-MS-OPTION OCCURS 5 PIC X.
    10 B-CH-PP-OPTION OCCURS 5 PIC X.
    10 B-CH-BASIC-PREMIUM OCCURS 5 PIC 9(7).
    10 B-CH-ADJ-PREMIUM OCCURS 5 PIC 9(7).
    10 B-CH-MP-SW OCCURS 5 PIC X.
    10 B-CH-PREMIUM OCCURS 5 PIC 9(7).
    10 B-CH-MS-SURCHG OCCURS 5 PIC 9(7).
    10 B-CH-ADJ-MS-SURCHG OCCURS 5 PIC 9(7).
    10 B-CH-PP-SURCHG OCCURS 5 PIC 9(7).
    10 B-CH-ADJ-PP-SURCHG OCCURS 5 PIC 9(7).
    10 B-CH-3YR-PREMIUM OCCURS 5 PIC 9(7).
    10 B-CH-ANNUAL-DPP OCCURS 5 PIC 9(7).
    10 SEC-BRG-END-ITEM PIC X.
 03 SECTION-TWO-BILL PIC X(40000).
 03 SECTWOBILL REDEFINES SECTION-TWO-BILL.
  05 SEC-TWO-COM-MAP.
    10 CLS-CDE-CTL-BLK OCCURS 30.
      15 COVERAGE-SWITCHES.
        20 S2-BASE PIC X.
        20 S2-DPDCOVSW PIC X.
        20 S2-XCUCOVSW PIC X.
        20 S2-WATEREXC PIC X.
        20 S2-LESSORSW PIC X.
        20 S2-VENDORSW PIC X.
        20 S2-ARCHSW PIC X.
        20 S2-EMPSW PIC X.
        20 S2-GOVALLSW PIC X.
        20 S2-GOVOCPSW PIC X.
        20 S2-COMPSW PIC X.
        20 S2-KULAS-PRV PIC X.
      15 DATA-SWITCHS.
        20 BASE.
          25 S2-TERSW PIC X.
          25 S2-CLASSW PIC X.
          25 S2-BIRATESW PIC X.
          25 S2-BIMINSW PIC X.
          25 S2-PDRATESW PIC X.
          25 S2-PDMINSW PIC X.
          25 S2-EXPOSESW PIC X.
        20 DPD.
          25 S2-DPDYNSW PIC X.
          25 S2-DEDAMTSW PIC X.
          25 S2-DEDTYPSW PIC X.
        20 XCU.
          25 S2-XCUSW PIC X.
        20 WATER.
          25 S2-WATERSW PIC X.
        20 LESSOR.
          25 S2-QUALIFY PIC X.
        20 VENDOR.
          25 S2-VENDTYPE PIC X.
          25 S2-VBASESW PIC X.
        20 ARCH.
          25 S2-ARCHCOVG PIC X.
        20 EMP.
          25 S2-EMPCOVG PIC X.
        20 GOVA.
          25 S2-GOVUSESW PIC X.
          25 S2-GOVNOSW PIC X.
          25 S2-GOVALLCV PIC X.
        20 GOVO.
          25 S2-GOVOCPCV PIC X.
          25 S2-OCPBASW PIC X.
        20 CPL.
          25 S2-ACRESW PIC X.
      15 DATA-ELEMENTS.
        20 BASE.
          25 S2-STATE PIC 99.
          25 S2-AREA PIC 99.
          25 S2-CLASS PIC X(12).
          25 S2-CLASSX PIC X(12).
          25 S2-BIRATE PIC 9(4)V9(4).
          25 S2-BIMIN PIC 9(4)V9(4).
          25 S2-PDRATE PIC 9(4)V9(4).
          25 S2-PDMIN PIC 9(4)V9(4).
          25 S2-PREMBASE PIC 9(12).
        20 DPD.
          25 S2-DPD PIC X.
          25 S2-DEDUCT PIC 9(4).
          25 S2-DEDTYPE PIC X.
        20 XCU.
          25 S2-XCU PIC X.
        20 WATER.
          25 S2-WATER PIC X.
        20 LESSOR.
          25 S2-LESSOR PIC X.
          25 S2-LESS50 PIC V99.
        20 VENDOR.
          25 S2-VENDOR PIC X.
          25 S2-VENDBASE PIC 9(8).
        20 ARCH.
          25 S2-INTARCH PIC X.
        20 EMP.
          25 S2-INTEMP PIC X.
        20 GOVA.
          25 S2-GOVUSE PIC X.
          25 S2-GOVNUMB PIC 99.
          25 S2-GOVTALL PIC X.
        20 GOVO.
          25 S2-GOVTOCP PIC X.
          25 S2-OCPBASE PIC 99.
        20 CPL.
          25 S2-CPACRES PIC X.
      15 INDICATIVE-INFORMATION.
        20 BASE.
          25 S2-FILECODE PIC 99.
          25 S2-PRMBASE PIC 99.
          25 S2-DESCRIBE PIC X(60).
          25 S2-RATEKEY PIC 99.
          25 S2-FACTOR PIC 9(9).
          25 S2-UNIT PIC 9(7)V99.
          25 S2-MINKEY PIC 99.
          25 S2-MINSAVEBI-LOC PIC 9(3)V99.
          25 S2-MINSAVEBI-POL PIC 9(3)V99.
          25 S2-MINSAVEPD-LOC PIC 9(3)V99.
          25 S2-MINSAVEPD-POL PIC 9(3)V99.
          25 S2-XCU-BI-RATE PIC 9V9(3).
          25 S2-XCU-BI-PREM PIC 9(3)V99.
          25 S2-XCU-PD-RATE PIC 9V9(3).
          25 S2-XCU-PD-PREM PIC 9(3)V99.
        20 DPD.
          25 S2-DEDRATE PIC V99.
        20 XCU.
          25 S2-BIXCURAT PIC 9V999.
          25 S2-BIXCUMIN PIC 999V99.
          25 S2-PDXCURAT PIC 9V999.
          25 S2-PDXCUMIN PIC 999V99.
        20 WATER.
          25 S2-WATER80 PIC V99.
          25 S2-WATRPREM PIC V999.
        20 VENDOR.
          25 S2-VPERCENT PIC V99.
          25 S2-VEND100 PIC 9(3).
          25 S2-VENDUNIT PIC 9(7).
        20 ARCH.
          25 S2-ARCH10 PIC V99.
        20 EMP.
          25 S2-EMP10 PIC V99.
        20 GOVA.
          25 S2-GOVALLBI PIC 9V99.
          25 S2-GOVALLPD PIC 9V99.
             20 GOVO.
          25 S2-GOVOCPBI PIC V99.
          25 S2-GOVOCPPD PIC V99.
        20 CPL.
          25 S2-ACRECHG PIC 9V99.
          25 S2-PERATE PIC 99V99.
        20 INCRLIM.
          25 S2-INCRLIMA-BI PIC 9V99.
          25 S2-INCRLIMB-BI PIC 9V99.
          25 S2-INCRLIMA-PD PIC 9V99.
          25 S2-INCRLIMB-PD PIC 9V99.
    10 OTH-CTL-WRD.
      15 SUBSCRIPTS.
        20 SUB1 PIC 99.
        20 Q REDEFINES SUB1 PIC 99.
      15 FOUNDATION.
        20 S2-FOUND PIC X.
        20 S2-PDSWITCH PIC X.
        20 S2-BISWITCH PIC X.
        20 S2-PDOCCUR PIC 9(8).
        20 S2-BIOCCUR PIC 9(8).
        20 S2-BIAGGR PIC 9(8).
        20 S2-PDAGGR PIC 9(8).
      15 OTHER.
        20 S2-OTHERSW PIC X.
        20 OTHER.
          25 S2-OTHERCVG PIC X.
          25 S2-INTOTHER PIC X.
          25 S2-OTHER10 PIC V99.
      15 INJURY.
        20 S2-INJURYSW PIC X.
        20 INJURY.
          25 S2-PINJURY PIC X.
          25 S2-PERSINJ PIC X.
          25 S2-INJURY15 PIC V99.
      15 MED.
        20 S2-MEDPAYSW PIC X.
        20 MED.
          25 S2-MEDICAL PIC X.
          25 S2-MEDLIMSW PIC X.
          25 S2-MEDPAY PIC X.
          25 S2-MEDLIMP PIC 9(4).
          25 S2-MEDLIMA PIC 9(5).
          25 S2-MEDMA1 PIC 9V999.
          25 S2-MEDMB1 PIC 9V999.
          25 S2-MEDMA2 PIC 9V999.
          25 S2-MEDMB2 PIC 9V999.
          25 S2-MEDMA3 PIC 9V999.
          25 S2-MEDMB3 PIC 9V999.
          25 S2-MEDMA4 PIC 9V999.
          25 S2-MEDMB4 PIC 9V999.
          25 S2-MINMA1 PIC 99V99.
          25 S2-MINMB1 PIC 99V99.
          25 S2-MINMA2 PIC 99V99.
          25 S2-MINMB2 PIC 99V99.
          25 S2-MINMA3 PIC 99V99.
          25 S2-MINMB3 PIC 99V99.
          25 S2-MINMA4 PIC 99V99.
          25 S2-MINMB4 PIC 99V99.
      15 CLP.
          25 S2-CPLSW PIC X.
          25 S2-PERLIMSW PIC X.
          25 S2-CPLLIM PIC 9(6).
          25 S2-PERLIM PIC 9(4).
  05 SAM-DATA.
    10 DUMMY.
      15 S2-OTHER-BODY-PREM PIC 9(6)V9(2).
      15 S2-OTHER-PROP-PREM PIC 9(6)V9(2).
      15 S2-PI-ONLY-PREM PIC 9(6)V9(2).
      15 S2-MED-ONLY-PREM PIC 9(6)V9(2).
    10 RATE-TABLE OCCURS 30.
      15 S2-EMP-BODY-PREM PIC 9(6)V9(2).
      15 S2-EMP-PROP-PREM PIC 9(6)V9(2).
      15 S2-ARC-BODY-PREM PIC 9(6)V9(2).
      15 S2-ARC-PROP-PREM PIC 9(6)V9(2).
      15 S2-VEND-BODY-PREM PIC 9(6)V9(2).
      15 S2-VEND-PROP-PREM PIC 9(6)V9(2).
      15 S2-OCP-BODY-PREM PIC 9(6)V9(2).
      15 S2-OCP-PROP-PREM PIC 9(6)V9(2).
      15 S2-GOVALL-BODY-PREM PIC 9(6)V9(2).
      15 S2-GOVALL-PROP-PREM PIC 9(6)V9(2).
      15 S2-CPL-ONLY-PREM PIC 9(6)V9(2).
      15 S2-BODILY-PREM PIC 9(6)V9(2).
      15 S2-PROP-PREM PIC 9(6)V9(2).
      15 S2-EMPBIPRM PIC 9(6)V9(2).
      15 S2-EMPPDPRM PIC 9(6)V9(2).
    10 ABC.
      15 SECTION2-TOTAL PIC 9(6)V99.
      15 S2-GROUPA PIC 9(4)V9(4).
      15 S2-GROUPB PIC 9(4)V9(4).
      15 S2-GROUPC PIC 9(4)V9(4).
      15 S2-GROUPD PIC 9(4)V9(4).
      15 S2-GROUPE PIC 9(4)V9(4).
      15 S2-GROUPF PIC 9(4)V9(4).
      15 S2-GROUPG PIC 9(4)V9(4).
      15 S2-GROUPH PIC 9(4)V9(4).
      15 S2-OTHBIPRM PIC 9(6)V9(2).
      15 S2-OTHPDPRM PIC 9(6)V9(2).
      15 DUMM OCCURS 30.
        20 S2-BIRATE9 PIC 9(6)V9(2).
        20 S2-PDRATE9 PIC 9(6)V9(2).
        20 S2-MOD1 PIC 9V9(3).
        20 S2-MOD2 PIC 9V9(3).
        20 S2-MOD3 PIC 9V9(3).
        20 S2-ARCBIPRM PIC 9(6)V9(2).
        20 S2-ARCPDPRM PIC 9(6)V9(2).
        20 S2-OCPPRMPD PIC 9V9(2).
        20 S2-OCPPRMBI PIC 9(6)V9(2).
        20 S2-GOVPRMBI PIC 9(6)V9(2).
        20 S2-GOVPRMPD PIC 9(6)V9(2).
        20 S2-VNDPRMBI PIC 9(6)V9(2).
        20 S2-VNDPRMPD PIC 9(6)V9(2).
        20 S2-WORKBI PIC 9(4)V9(4).
        20 S2-WORKPD PIC 9(4)V9(4).
        20 S2-CPLPREM PIC 9(6)V9(2).
      15 DUMDUM.
        20 S2-PIPREM PIC 9(6)V9(2).
        20 S2-MEDPREM PIC 9(6)V9(2).
        20 S2-BIRESULT PIC 9(3)V9(1).
        20 S2-PDRESULT PIC 9(3)V9(1).
        20 S2-CHARGE5 PIC 9(1).
        20 S2-CNTR PIC 99.
        20 S2-BIFLAT PIC 9(6)V9(2).
        20 S2-PDFLAT PIC 9(6)V9(2).
        20 S2-PROMPTS PIC X(20).
        20 S2-BIGSW PIC X.
    10 BLANKET-CONTR-LIAB.
      15 SWITCHES.
        20 S2-BLANKCVG PIC X.
        20 S2-BLANKSW PIC X.
      15 DATA-ITEMS.
        20 S2-BLANKET PIC X.
        20 S2-BLANKET10 PIC V99.
        20 S2-BLNK-BODY-PREM PIC 9(6)V99.
        20 S2-BLNK-PROP-PREM PIC 9(6)V99.
    10 S2-INTER-RESULTS OCCURS 30.
      15 S2-BIRATE8 PIC 9(4)V9(4).
      15 S2-PDRATE8 PIC 9(4)V9(4).
      15 S2-BIRATE4 PIC 9(4)V9(4).
      15 S2-PDRATE4 PIC 9999V9999.
      15 S2-BIRATE5 PIC 9999V9999.
      15 S2-PDRATE5 PIC 9999V9999.
      15 S2-CPLRATE2 PIC 9999V9999.
      15 S2-CPLRATE3 PIC 9999V9999.
      15 S2-CPLRATE4 PIC 999V9999.
      15 S2-CPLRATE6 PIC 9999V9999.
    10 CONCESSIONAIRES OCCURS 30.
      15 S2-CONCESCVG PIC X.
      15 S2-CONCESW PIC X.
      15 S2-CONCES PIC X.
      15 S2-CONCES25 PIC V99.
    10 PROFESSIONAL-LIABILITY-LIMITS.
      15 S2-DRUGLIMCVG PIC X.
      15 S2-DRUGLIMSW PIC X.
      15 S2-DRUGOCCUR PIC 9(8).
      15 S2-DRUGAGGR PIC 9(8).
      15 S2-DENTLIMCVG PIC X.
      15 S2-DENTLIMSW PIC X.
      15 S2-DENTOCCUR PIC 9(8).
      15 S2-NTAGGR PIC 9(8).
      15 S2-VETLIMCVG PIC X.
      15 S2-VETLIMSW PIC X.
      15 S2-VETOCCUR PIC 9(8).
      15 S2-VETAGGR PIC 9(8).
      15 S2-OPTLIMCVG PIC X.
      15 S2-OPTLIMSW PIC X.
      15 S2-OPTOCCUR PIC 9(8).
      15 S2-OPTAGGR PIC 9(8).
      15 S2-MORTLIMCVG PIC X.
      15 S2-MORTLIMSW PIC X.
      15 S2-MORTOCCUR PIC 9(8).
      15 S2-MORTAGGR PIC 9(8).
      15 S2BEAUTLIMCVG PIC X.
      15 S2-BEAUTLIMSW PIC X.
      15 S2-BEAUTOCCUR PIC 9(8).
      15 S2-BEAUTAGGR PIC 9(8).
      15 S2-WIGLIMCVG PIC X.
      15 S2-WIGLIMSW PIC X.
      15 S2-WIGOCCUR PIC 9(8).
      15 S2-WIGAGGR PIC 9(8).
    10 CONCESSIONAIRES-CALC OCCURS 30.
      15 S2-CONBIPRM PIC 9(6)V99.
      15 S2-CON-BODY-PREM PIC 9(6)V99.
    10 SEC-2-END-ITEM PIC X.
PROCEDURE DIVISION USING COMMON-AREA, WKS-SECT, Q-A-REC.
010-START.
    DISPLAY 'GOT-QUOTR2.     KEY-GO-TO IS ' KEY-GO-TO.
    GO TO
    P71,  P72,  P73,  P74,  P75,  P76,  P77,  P78,  P79,  P80,
    P81,  P82,  P83,  P84,  P85,  P86,  P87,  P88,  P89,  P90,
    P91,  P92,  P93,  P94,  P95,  P96,  P97,  P98,  P99,  P100,
    P101, P102, P103, P104, P105, P106, P107, P108, P109, P110,
    P111, P112, P113, P114, P115, P116, P117, P118, P119, P120,
    P121, P122, P123, P124, P125, P126, P127, P138, P119, P120,
    P131, P132, P133, P134, P135, P136, P137, P138, P139, P140,
    DEPENDING ON KEY-GO-TO.
P71.
    IF  CHG-SW  GREATER 8  GO TO P-EXIT.
    MOVE  A-TYPE-40  TO S1-RF-BAS  (COM-S).
    MOVE 9  TO  S1DS (12, COM-S)
    GO TO P-EXIT.
P72.
    IF  CHG-SW  GREATER 8  GO TO P72-A.
    MOVE T-TYPE-1  TO  S1-B-LIM-LBL-PCT (COM-S).
    MOVE T-TYPE-2  TO  S1-B-LIM-COIN-PCT (COM-S).
    MOVE T-TYPE-3 TO S1-B-DISCAMT (COM-S).
    MOVE 9  TO S1DS  (13, COM-S).
P72-A.
    IF S1-B-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-B-SW (COM-S) NOT = 7 GO TO P-72-B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P-72-B.
    MOVE 9 TO S1-B-SW (COM-S).
    GO TO P-EXIT.
P73.
    IF  CHG-SW  GREATER 8  GO TO P73-A.
    MOVE T-TYPE-1 TO  S1-C-LIM-LBL-PCT  (COM-S).
    MOVE T-TYPE-2 TO  S1-C-LIM-COIN-PCT (COM-S).
    MOVE 9  TO S1DS  (14 , COM-S).
P73-A.
    IF S1-C-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-C-SW (COM-S) NOT = 7 GO TO P-73-B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P-73-B.
    MOVE 9 TO S1-C-SW (COM-S).
    GO TO P-EXIT.
P74.
    IF CHG-SW > 8 GO TO P-74-A.
    MOVE T-TYPE-1  TO  S1-G-LIM-LBL-PCT  (COM-S).
    MOVE T-TYPE-2  TO  S1-G-LIM-COIN-PCT (COM-S).
    MOVE 9 TO S1DS  (15 , COM-S).
P-74-A.
    IF S1-G-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-G-SW (COM-S) NOT = 7 GO TO P-74-B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P-74-B.
    MOVE 9 TO S1-G-SW (COM-S).
    GO TO P-EXIT.
P75.
    IF  CHG-SW  GREATER 8  GO TO P-EXIT.
    MOVE NUM-GRP-TYPE TO S1-LOCNSW.
    MOVE  9  TO  S1DS (16 , COM-S).
    GO TO P-EXIT.
P76.
    IF  CHG-SW  GREATER 8  GO TO P-EXIT.
    MOVE  A-TYPE-40  TO  S1-EXPNOV.
    MOVE  9  TO  S1DS (17 , COM-S).
    GO TO P-EXIT.
P-42-COVG.
    IF  IDEN-SEC  LESS 5  GO TO P-EXIT.
    IF  IDEN-SEC  NOT = 7 GO TO P-42-COVG-B.
    IF  CHG-SW = ZERO  GO TO P-EXIT.
P-42-COVG-B.
    MOVE 9 TO  IDEN-SEC.
    GO TO P-EXIT.
P77.
    IF  CHG-SW GREATER THAN 8 GO TO P77A.
    MOVE T-TYPE-1 TO S1-O-LIM-LBL (COM-S).
    MOVE T-TYPE-2 TO S1-O-COIN-PCT (COM-S).
    MOVE 9 TO S1DS (18,, COM-S).
P77A.
    IF  S1-O-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-O-SW   (COM-S) NOT = 7 GO TO P77B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P77B.
    MOVE 9 TO S1-O-SW (COM-S).
    GO TO P-EXIT.
P78.
    IF  CHG-SW GREATER THAN 8 GO TO P78A.
    MOVE A-TYPE-40    TO S1-I-CTF    (COM-S).
    MOVE 9 TO S1DS (22,, COM-S).
P78A.
    IF  S1-I-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-I-SW   (COM-S) NOT = 7 GO TO P78B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P78B.
    MOVE 9 TO S1-I-SW (COM-S).
    GO TO P-EXIT.
P79.
    IF  CHG-SW GREATER THAN 8 GO TO P79A.
    MOVE T-TYPE-1    TO S1-T-RATE    (COM-S).
    MOVE T-TYPE-2    TO S1-T-LIM-LBL  (COM-S).
    MOVE 9 TO S1DS (19,, COM-S).
P79A.
    IF  S1-T-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-T-SW   (COM-S) NOT = 7 GO TO P79B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P79B.
    MOVE 9 TO S1-T-SW (COM-S).
    GO TO P-EXIT.
P80.
    IF  CHG-SW GREATER THAN 8 GO TO P80A.
    MOVE NUM-GRP-TYPE    TO S1-R-LIM-LBL  (COM-S).
    MOVE 9 TO S1DS (23,, COM-S).
P80A.
    IF  S1-R-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-R-SW   (COM-S) NOT = 7 GO TO P80B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P80B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P81.
    IF  CHG-SW GREATER THAN 8 GO TO P81A.
    MOVE T-TYPE-1    TO S1-T-RATE    (COM-S).
    MOVE T-TYPE-2    TO S1-T-LIM-LBL  (COM-S).
    MOVE 9 TO S1DS (20,, COM-S).
P81A.
    IF  S1-T-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-T-SW   (COM-S) NOT = 7 GO TO P81B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P81B.
    MOVE 9 TO S1-T-SW (COM-S).
    GO TO P-EXIT.
P82.
    IF  CHG-SW GREATER THAN 8 GO TO P82A.
    MOVE T-TYPE-1    TO S1-I-LIM-LBL  (COM-S).
    MOVE T-TYPE-2    TO S1-I-COIN-PCT (COM-S).
    MOVE 9 TO S1DS (21,, COM-S).
P82A.
    IF  S1-I-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-I-SW   (COM-S) NOT = 7 GO TO P82B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P82B.
    MOVE 9 TO S1-I-SW (COM-S).
    GO TO P-EXIT.
P83.
    IF  CHG-SW GREATER THAN 8 GO TO P83A.
    MOVE A-TYPE-40    TO S1-R-LIM-LBLAVG (COM-S).
    MOVE 9 TO S1DS (24,, COM-S).
P83A.
    IF  S1-R-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-R-SW   (COM-S) NOT = 7 GO TO P83B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P83B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P84.
    IF  CHG-SW GREATER THAN 8 GO TO P84A.
    MOVE A-TYPE-40    TO S1-V-LIM-LBL (COM-S).
    MOVE 9 TO S1DS (31,, COM-S).
P84A.
    IF  S1-V-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-V-SW   (COM-S) NOT = 7 GO TO P84B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P84B.
    MOVE 9 TO S1-V-SW (COM-S).
    GO TO P-EXIT.
P85.
    IF  CHG-SW GREATER THAN 8 GO TO P85A.
    MOVE A-TYPE-40    TO S1-R-RECPTL  (COM-S).
    MOVE 9 TO S1DS (25,, COM-S).
P85A.
    IF  S1-R-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-R-SW   (COM-S) NOT = 7 GO TO P85B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P85B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P86.
    IF  CHG-SW GREATER THAN 8 GO TO P86A.
    MOVE A-TYPE-40    TO S1-R-RCPTYP  (COM-S).
    MOVE 9 TO S1DS (26,, COM-S).
P86A.
    IF  S1-R-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-R-SW   (COM-S) NOT = 7 GO TO P86B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P86B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P87.
    IF  CHG-SW GREATER THAN 8 GO TO P87A.
    MOVE NUM-GRP-TYPE    TO S1-R-RCDDUP  (COM-S).
    MOVE 9 TO S1DS (27,, COM-S).
P87A.
    IF  S1-R-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-R-SW   (COM-S) NOT = 7 GO TO P87B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P87B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P88.
    IF  CHG-SW GREATER THAN 8 GO TO P88A.
    MOVE A-TYPE-40    TO S1-R-ARRKCL  (COM-S).
    MOVE 9 TO S1DS (28,, COM-S).
P88A.
    IF  S1-R-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-R-SW   (COM-S) NOT = 7 GO TO P88B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P88B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P89.
    IF  CHG-SW GREATER THAN 8 GO TO P89A.
    MOVE A-TYPE-40    TO S1-V-RECPTL  (COM-S).
    MOVE 9 TO S1DS (29,, COM-S).
P89A.
    IF  S1-V-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF  S1-V-SW   (COM-S) NOT = 7 GO TO P89B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P89B.
    MOVE 9 TO S1-V-SW (COM-S).
    GO TO P-EXIT.
P90.
    IF  CHG-SW GREATER THAN 8 GO TO P90A.
    MOVE A-TYPE-40    TO S1-V-RCPTYP  (COM-S).
    MOVE 9 TO S1DS (30,, COM-S).
P90A.
    IF  S1-R-SW   (COM-S) LESS THAN 5 GO TO P-EXIT.
    IF S1-R-SW  (COM-S) NOT = 7 GO TO P90B.
    IF  CHG-SW = ZERO GO TO P-EXIT.
P90B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P91.
    IF CHG-SW > 8 GO TO P91A.
    MOVE NUM-GRP-TYPE TO  B-RISK-CLASS (COM-S).
    MOVE 9 TO B-BMON01-SW (COM-S).
P91A.
    IF S1-BURGLARY-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S)    NOT = 7 GO TO P91B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P91B.
    MOVE 9 TO S1-BURGLARY-SW (COM-S).
    GO TO P-EXIT.
P92.
    IF CHG-SW > 8 GO TO P92A.
    MOVE F-TYPE TO BRG-OPEN-24-HRS-IND (COM-S).
    MOVE 9 TO B-BMON02-SW (COM-S).
P92A.
    IF S1-BURGLARY-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S)    NOT = 7 GO TO P92B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P92B.
    MOVE 9 TO S1-BURGLARY-SW (COM-S)
    GO TO P-EXIT.
P93.
    IF CHG-SW > 8 GO TO P93A.
    MOVE F-TYPE TO BRG-SCFM-INDICATOR  (COM-S).
    MOVE 9 TO B-BMON03-SW (COM-S).
P93A.
    IF S1-BURGLARY-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S)    NOT = 7 GO TO P93B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P93B.
    MOVE 9 TO S1-BURGLARY-SW (COM-S)
    GO TO P-EXIT.
P94. GO TO P-EXIT.
P95.
    IF CHG-SW > 8 GO TO P95A.
    MOVE F-TYPE TO B-MOS-DVD-COVERAGE  (COM-S).
    MOVE 9 TO B-MOS-01-SW  (COM-S).
P95A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P95B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P95B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S).
    GO TO P-EXIT.
P96.
    IF CHG-SW > 8 GO TO P96A.
    MOVE NUM-GRP-TYPE TO  B-MOS-DIV-COUNT (COM-S).
*   MOVE 9 TO B-MOS-02-SW  (COM-S).
P96A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P96B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P96B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P97.
    IF CHG-SW > 8 GO TO P97A.
    MOVE NUM-GRP-TYPE TO  B-MOS-TRD-GRP  (COM-S BDIV).
    MOVE 9 TO B-MOS-10-SW  (COM-S BDIV).
P97A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P97B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P97B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P98.
    IF CHG-SW > 8 GO TO P98A.
    MOVE NUM-GRP-TYPE TO  B-MOS-INS-AMOUNT (COM-S BDIV).
    MOVE 9 TO B-MOS-11-SW  (COM-S BDIV).
P98A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P98B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P98B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P99.
    IF CHG-SW > 8 GO TO P99A.
    MOVE F-TYPE TO B-MOS-WMN-INDICATOR (COM-S BDIV).
    MOVE 9 TO B-MOS-12-SW  (COM-S BDIV).
P99A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P99B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P99B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P100.
    IF CHG-SW > 8 GO TO P100A.
    MOVE NUM-GRP-TYPE TO  B-MOS-WMN-CLASS-A (COM-S BDIV).
    MOVE 9 TO B-MOS-13-SW  (COM-S BDIV).
P100A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P100B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P100B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P101.
    IF CHG-SW > 8 GO TO P101A.
    MOVE NUM-GRP-TYPE TO  B-MOS-WMN-CLASS-B (COM-S BDIV).
    MOVE 9 TO B-MOS-14-SW  (COM-S BDIV).
P101A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P101B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P101B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P102.
    IF CHG-SW > 8 GO TO P102A.
    MOVE NUM-GRP-TYPE TO  B-MOS-WMN-CLASS-C (COM-S BDIV).
    MOVE 9 TO B-MOS-15-SW  (COM-S BDIV).
P102A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P102B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P102B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P103.
    IF CHG-SW > 8 GO TO P103A.
    MOVE NUM-GRP-TYPE TO  B-MOS-WMN-CLASS-D (COM-S BDIV).
    MOVE 9 TO B-MOS-16-SW  (COM-S BDIV).
P103A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P103B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P103B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P104.
    IF CHG-SW > 8 GO TO P104A.
    MOVE NUM-GRP-TYPE TO  B-MOS-WMN-CLASS-E (COM-S BDIV).
    MOVE 9 TO B-MOS-17-SW  (COM-S BDIV).
P104A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P104B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P104B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P105.
    IF CHG-SW > 8 GO TO P105A.
    MOVE NUM-GRP-TYPE TO  B-MOS-WMN-CLASS-F (COM-S BDIV).
    MOVE 9 TO B-MOS-18-SW  (COM-S BDIV).
P105A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P105B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P105B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P106.
    IF CHG-SW > 8 GO TO P106A.
    MOVE F-TYPE TO B-MOS-PA-INDICATOR  (COM-S BDIV).
    MOVE 9 TO B-MOS-19-SW  (COM-S BDIV).
P106A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P106B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P106B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P107.
    IF CHG-SW > 8 GO TO P107A.
    MOVE A-TYPE-40    TO B-MOS-PA-DATA (COM-S BDIV).
    MOVE 9 TO B-MOS-20-SW  (COM-S BDIV).
P107A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P107B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P107B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P108.
    IF CHG-SW > 8 GO TO P108A.
    MOVE F-TYPE TO B-MOS-BG-INDICATOR  (COM-S BDIV).
    MOVE 9 TO B-MOS-21-SW  (COM-S BDIV).
P108A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P108B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P108B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P109.
    IF CHG-SW > 8 GO TO P109A.
    MOVE F-TYPE TO B-MOS-TF-INDICATOR  (COM-S BDIV).
    MOVE 9 TO B-MOS-22-SW  (COM-S BDIV).
P109A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P109B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P109B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P110.
    IF CHG-SW > 8 GO TO P110A.
    MOVE T-TYPE-1 TO B-MOS-TF-CATG (COM-S BDIV).
    MOVE T-TYPE-2 TO B-MOS-TF-AMOUNT (COM-S BDIV).
    MOVE 9 TO B-MOS-23-SW  (COM-S BDIV).
P110A.
    IF S1-MOS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S)    NOT = 7 GO TO P110B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P110B.
    MOVE 9 TO S1-MOS-COV-SW  (COM-S)
    GO TO P-EXIT.
P111. GO TO P-EXIT.
P112.
    IF CHG-SW > 8 GO TO P112A.
    MOVE A-TYPE-40    TO B-MS-SAFE-CLASS (COM-S).
    MOVE 9 TO B-MS-001-SW  (COM-S).
P112A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P112B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P112B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P113.
    IF CHG-SW > 8 GO TO P113A.
    MOVE NUM-GRP-TYPE TO  B-MS-INS-AMOUNT (COM-S).
    MOVE 9 TO B-MS-002-SW  (COM-S).
P113A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P113B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P113B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P114.
    IF CHG-SW > 8 GO TO P114A.
    MOVE F-TYPE TO B-MS-CASH-INDICATOR (COM-S).
    MOVE 9 TO B-MS-003-SW  (COM-S).
P114A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P114B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P114B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P115.
    IF CHG-SW > 8 GO TO P115A.
    MOVE T-TYPE-1 TO B-MS-CASH-TYPE (COM-S).
    MOVE T-TYPE-2 TO B-MS-CASH-AMOUNT (COM-S).
    MOVE 9 TO B-MS-004-SW  (COM-S).
P115A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P115B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P115B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P116.
    IF CHG-SW > 8 GO TO P116A.
    MOVE F-TYPE TO B-MS-KLS-INDICATOR  (COM-S).
    MOVE 9 TO B-MS-005-SW  (COM-S).
P116A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P116B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P116B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P117.
    IF CHG-SW > 8 GO TO P117A.
    MOVE NUM-GRP-TYPE TO  B-MS-KLS-AMOUNT (COM-S).
    MOVE 9 TO B-MS-006-SW  (COM-S).
P117A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P117B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P117B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P118.
    IF CHG-SW > 8 GO TO P118A.
    MOVE A-TYPE-40    TO B-MS-SEC-INDICATOR (COM-S).
    MOVE 9 TO B-MS-007-SW  (COM-S).
P118A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P118B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P118B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P119.
    IF CHG-SW > 8 GO TO P119A.
    MOVE A-TYPE-40    TO B-MS-TGS-INDICATOR (COM-S).
    MOVE 9 TO B-MS-008-SW  (COM-S).
P119A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P119B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P119B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P120.
    IF CHG-SW > 8 GO TO P120A.
    MOVE F-TYPE TO B-MS-WMN-INDICATOR  (COM-S).
    MOVE 9 TO B-MS-009-SW  (COM-S).
P120A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P120B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P120B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P121.
    IF CHG-SW > 8 GO TO P121A.
    MOVE NUM-GRP-TYPE TO  B-MS-WMN-CLASS-A (COM-S).
    MOVE 9 TO B-MS-010-SW  (COM-S).
P121A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P121B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P121B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P122.
    IF CHG-SW > 8 GO TO P122A.
    MOVE NUM-GRP-TYPE TO  B-MS-WMN-CLASS-B (COM-S).
    MOVE 9 TO B-MS-011-SW  (COM-S).
P122A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P122B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P122B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P123.
    IF CHG-SW > 8 GO TO P123A.
    MOVE NUM-GRP-TYPE TO  B-MS-WMN-CLASS-C (COM-S).
    MOVE 9 TO B-MS-012-SW  (COM-S).
P123A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P123B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P123B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P124.
    IF CHG-SW > 8 GO TO P124A.
    MOVE NUM-GRP-TYPE TO  B-MS-WMN-CLASS-D (COM-S).
    MOVE 9 TO B-MS-013-SW  (COM-S).
P124A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P124B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P124B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P125.
    IF CHG-SW > 8 GO TO P125A.
    MOVE NUM-GRP-TYPE TO  B-MS-WMN-CLASS-E (COM-S).
    MOVE 9 TO B-MS-014-SW  (COM-S).
P125A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P125B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P125B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P126.
    IF CHG-SW > 8 GO TO P126A.
    MOVE NUM-GRP-TYPE TO  B-MS-WMN-CLASS-F (COM-S).
    MOVE 9 TO B-MS-015-SW  (COM-S).
P126A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P126B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P126B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P127.
    IF CHG-SW > 8 GO TO P127A.
    MOVE F-TYPE TO B-MS-SVA-INDICATOR  (COM-S).
    MOVE 9 TO B-MS-016-SW  (COM-S).
P127A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P127B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P127B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P128.
    IF CHG-SW > 8 GO TO P128A.
    MOVE A-TYPE-40    TO B-MS-SVA-DATA (COM-S).
    MOVE 9 TO B-MS-017-SW  (COM-S).
P128A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P128B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P128B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P129.
    IF CHG-SW > 8 GO TO P129A.
    MOVE F-TYPE TO B-MS-PAS-INDICATOR  (COM-S).
    MOVE 9 TO B-MS-018-SW  (COM-S).
P129A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P129B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P129B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P130.
    IF CHG-SW > 8 GO TO P130A.
    MOVE A-TYPE-40    TO B-MS-PAS-DATA (COM-S).
    MOVE 9 TO B-MS-019-SW  (COM-S).
P130A.
    IF S1-MS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW  (COM-S)    NOT = 7 GO TO P130B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P130B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P131. GO TO P-EXIT.
P132.
    IF CHG-SW > 8 GO TO P132A.
    MOVE F-TYPE TO B-MR-IP-COVERAGE (COM-S).
    MOVE 9 TO B-MR-001-SW  (COM-S).
P132A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P132B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P132B.
    MOVE 9 TO S1-MR-COV-SW  (COM-S).
    GO TO P-EXIT.
P133.
    IF CHG-SW > 8 GO TO P133A.
    MOVE F-TYPE TO B-MR-OP-COVERAGE (COM-S).
    MOVE 9 TO B-MR-002-SW  (COM-S).
P133A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P133B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P133B.
    MOVE 9 TO S1-MR-COV-SW  (COM-S).
    GO TO P-EXIT.
P134.
    IF CHG-SW > 8 GO TO P134A.
    MOVE F-TYPE TO B-MR-SEC-INDICATOR (COM-S).
    MOVE 9 TO B-MR-003-SW  (COM-S).
P134A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P134B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P134B.
    MOVE 9 TO S1-MR-COV-SW  (COM-S).
    GO TO P-EXIT.
P135. GO TO P-EXIT.
P136.
    IF CHG-SW > 8 GO TO P136A.
    MOVE NUM-GRP-TYPE TO  B-MRI-INS-AMOUNT (COM-S).
    MOVE 9 TO B-MR-101-SW  (COM-S).
P136A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P136B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P136B.
    MOVE 9 TO S1-MR-COV-SW  (COM-S).
    GO TO P-EXIT.
P137.
    IF CHG-SW > 8 GO TO P137A.
    MOVE A-TYPE-40    TO B-MRI-DUTY-INDICATOR (COM-S).
    MOVE 9 TO B-MR-102-SW  (COM-S).
P137A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P137B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P137B.
    MOVE 9 TO S1-MR-COV-SW  (COM-S).
    GO TO P-EXIT.
P138.
    IF CHG-SW > 8 GO TO P138A.
    MOVE F-TYPE TO B-MRI-BRE-INDICATOR (COM-S).
    MOVE 9 TO B-MR-103-SW  (COM-S).
P138A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P138B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P138B.
    MOVE 9 TO S1-MR-COV-SW  (COM-S).
    GO TO P-EXIT.
P139.
    IF CHG-SW > 8 GO TO P139A.
    MOVE F-TYPE TO B-MRI-BREAS-INDICATOR (COM-S).
    MOVE 9 TO B-MR-104-SW  (COM-S).
P139A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P139B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P139B.
    MOVE 9 TO S1-MR-COV-SW  (COM-S).
    GO TO P-EXIT.
P140.
    IF CHG-SW > 8 GO TO P140A.
    MOVE F-TYPE TO B-MRI-TGS-INDICATOR (COM-S).
    MOVE 9 TO B-MR-105-SW  (COM-S).
P140A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P140B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P140B.
    MOVE 9 TO S1-MR-COV-SW  (COM-S).
    GO TO P-EXIT.
P-EXIT.
    EXIT PROGRAM.
 Lj»