IDENTIFICATION DIVISION.
PROGRAM-ID. QUOTR2.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 KEYGOTO PIC 999.
LINKAGE SECTION.
01  Q-A-REC USAGE DISPLAY-7.
  03 QA-REC-KEY   PIC 9(4).
   03  QA-KEYWORD   PIC X(6).
   03  QA-EDIT-TYPE PIC X.
   03  QA-SEC-NO    PIC X.
   03  Q-A-MESG   PIC  X(320).
  03 MESG-QA REDEFINES Q-A-MESG.
    07 FILLER PIC XXXX.
    07 BYTE-CNT   PIC 9(8).
    07  CHARS   PIC X(320).
01  WKS-SECT.
 02 INX-CHR PIC 9(8).
 02 CHG-SW PIC 9.
 02 INPUT-TYPE-SW PIC 9.
 02 CNT-5 PIC 9.
 02 INX-KEYWORD PIC 999.
 02 Q-A-KEY PIC 9(4) USAGE DISPLAY-7.
 02 INX-IO PIC 999.
 02 BLANK-CNT PIC 9.
 02 INX-KEYWORD-WK PIC 999.
 02 INX-D-TYPE PIC 999.
 02 INX-NUM PIC 99.
 02 INX-B1 PIC 9.
 02 INX-B2 PIC 9.
 02 QT PIC 9.
 02 REMD PIC 9.
 02 SAVE-IX-IO PIC 999.
 02 INX-Y PIC 999.
 02 Y-SW PIC 9.
 02 Y-SW2 PIC 9.
 02 INX-T PIC 999.
 02 BAD-NUMERIC PIC X(22).
 02 ERR-SW PIC 9.
 02 INX-A PIC 99.
 02 KEY-GO-TO PIC 999.
 02 PRE-SW PIC 9.
 02 EDIT-TYPE-WK PIC X.
 02 OPEN-SW PIC 9.
 02 TESTC PIC 99.
 02 INX-C PIC 99.
 02 C-SW PIC 9.
 02 QUOTRM-1 PIC X(10).
 02 F-TYPE PIC X.
 02 MSG-0 PIC X(9).
 02 MSG-1 PIC X(9).
 02 MSG-2 PIC X(9).
 02 INVAL-KW-SW PIC 9.
 02 B-EDIT-SW PIC 9.
 02 DATE-WORKS.
 03 DATE-WORK.
 05 FILLER PIC 9(6).
 05 FEB-WK PIC 99.
 05 FILLER PIC X(40).
 03 WORK-DATE REDEFINES DATE-WORK OCCURS 12 INDEXED BY INX-DATE.
 05 MO-WK PIC 99.
 05 DA-WK PIC 99.
 03 VERB-TABLE.
 05 FILLER PIC X(10).
 05 FILLER PIC X(10).
 05 FILLER PIC X(10).
 03 TABLE-BERB REDEFINES VERB-TABLE.
 05 VERB-TBL OCCURS 3 PIC X(10).
 03 A-TYPE-40.
 05 A-TYPE OCCURS 40 TIMES PIC X.
 03 PROMPT-AREA.
 05 PROMPT-VERB PIC X(10).
 05 PROMPT-NOUN PIC X(320).
 05 FILER2 REDEFINES PROMPT-NOUN.
 07 PROMPT-NUN PIC X OCCURS 320 INDEXED BY INX-NUN.
 03 DISPLAY-AREA.
 05 DISPLY-1 PIC X(80).
 05 DISPLY-1A REDEFINES DISPLY-1.
 10 DISP-1A-22 PIC X(23).
 10 DISP-1A-9 PIC X(9).
 10 DISP-1A-3 PIC ZZ9.
 10 DISP-1A-39 PIC X(35).
 10 FILLER PIC X(10).
 05 DISPLY-2 PIC X(80).
 05 DISPLY-3 PIC X(80).
 05 DISPLY-4 PIC X(80).
 03 AREA-DISPLAY REDEFINES DISPLAY-AREA.
 05 DISPY PIC X OCCURS 320 INDEXED BY INX-DISPLAY.
 02 KEYWORD-TABLE.
 03 TABLE-KEYWORDS PIC X(3600).
 03 TABLE-ENTRY REDEFINES TABLE-KEYWORDS OCCURS 300.
 05 KEYWORD PIC X(6).
 05 NUMERIC-KEY PIC 9(4).
 05 EDIT-TYPE PIC X.
 05 SEC-TYPE PIC X.
 02 IO-FIELDMAN-DATA.
 03 IO-DATA OCCURS 250 TIMES PIC X.
 02 KEYWORD-WORK6.
 03 KEYWORD-WORK.
 05 KEYWORD-WK OCCURS 6 PIC X.
 03 KEY-WORD REDEFINES KEYWORD-WORK.
 05 KEYWORD-WK2 PIC XX.
 05 FILLER PIC X(4).
 02 DATA-NAME-WORKS.
 03 DATE-TYPE.
 05 D-TYPE OCCURS 6 TIMES PIC X.
 03 TYPE-DATE REDEFINES DATE-TYPE.
 05 MO-TYPE PIC 99.
 05 DA-TYPE PIC 99.
 05 YR-TYPE PIC 99.
 03 NUMERIC-TYPE.
 05 NUM-TYPE OCCURS 12 TIMES PIC X.
 03 NUM-GRP-TYPE REDEFINES NUMERIC-TYPE PIC S9(8)V9(4).
 03 T-TYPE-ALL.
 05 T-TYPE OCCURS 4 TIMES.
 07 TYPE-T OCCURS 12 TIMES PIC X.
 03 ALL-T-TYPE REDEFINES T-TYPE-ALL.
 05 T-TYPE-1 PIC S9(8)V9(4).
 05 T-TYPE-2 PIC S9(8)V9(4).
 05 T-TYPE-3 PIC S9(8)V9(4).
 05 T-TYPE-4 PIC S9(8)V9(4).
 03 B-TYPE-ALL.
 05 B-TYPE OCCURS 4 PIC X.
 03 CLASS-TYPE.
 05 C-TYPE OCCURS 12 TIMES PIC X.
 03 TYPE-CLASS REDEFINES CLASS-TYPE.
 05 CLASS-NUM PIC 9999.
 05 CLASS-ALPHA PIC XX.
 05 CLASS-S PIC X.
 05 CLASS-EXCLUS PIC X(5).
01  COMMON-AREA.
 02 X-COMMON-AREA.
  03 SUPMON-TERMMOD-AREA PIC X(2000).
  03 SUPAREA REDEFINES SUPMON-TERMMOD-AREA.
    05 MONITOR-SWITCHES.
      10 GO-SW PIC 9.
      10 ACCEPT-SW PIC 9.
      10 ACTION-SW PIC 9.
      10 ALL-SIXES PIC 9.
      10 RESTART-SW PIC 9.
      10 RESTART-SECT PIC 9.
      10 S1L PIC 9.
      10 COM-LOC PIC 9.
      10 COM-CLS PIC 99.
      10 COM-S PIC 99.
      10 IDENT-SW PIC 99 OCCURS 10.
      10 IDEN-SEC PIC 9.
    05 MONITOR-DATA.
      10 COM-DATE-TIME.
       13 COM-DATE.
        15 COM-DTE-MO PIC 99.
        15 FILLER PIC X.
        15 COM-DTE-DA PIC 99.
        15 FILLER PIC X.
        15 COM-DTE-YR PIC 99.
       13 COM-TIME.
        15 COM-HOUR PIC 99.
        15 FILLER PIC X.
        15 COM-MIN PIC 99.
        15 FILLER PIC X.
        15 COM-SEC PIC 99.
      10 CALL-NUM-KEY PIC 9(4).
      10 CALL-EDIT-TYPE PIC X.
      10 SEC-NO PIC 9.
      10 VERB-NO PIC 9.
      10 PROMPT-TYPE PIC 9.
      10 PROMPT-NOUN-C PIC X(100).
      10 CHG-SEC-NO PIC 9.
      10 DISAS-SW PIC 9.
      10 S0-PRINT-SW PIC X.
      10 INPUT-TYPE PIC 9.
      10 USER-ID-WK.
        15 FILLER PIC XX.
        15 USR-ID4.
          20 FILLER PIC X.
          20 USR-ID-NUM PIC XXX.
        15 FILLER PIC XX.
    05 SEC-SUP-END-ITEM PIC X.
  03 SECTION-ZERO-AREA PIC X(500).
  03 SECZERO REDEFINES SECTION-ZERO-AREA.
    05 SECTION-0-DATA.
      10 OLD-QUOTE PIC 99.
      10 SAVE-QUOTE PIC 99.
      10 COM-USER-NAME PIC X(25).
      10 COM-PRODUCER-NO PIC 9(8).
      10 COM-APPLICANT-NAME PIC X(40).
      10 COM-APPLICANT-ADDR1 PIC X(40).
      10 COM-APPLICANT-ADDR2 PIC X(40).
      10 COM-APPLICANT-STATE PIC X(4).
      10 COM-APPLICANT-ZIP PIC 9(5).
      10 COM-EFF-DATE PIC 9(6).
      10 COM-POLICY-TERM PIC 9.
      10 COM-DTG-POLICY-MODIFY PIC X(8).
      10 COM-QUOTE-PLAN PIC X(7).
      10 COM-USER-LIMIT PIC 9(7).
      10 COM-BRANCH-NO PIC 99.
      10 COM-SESSION-TYPE PIC X.
      10 COM-QUOTE-DATE PIC X(8).
      10 COM-EFFECTIVE-DATE PIC X(8).
    05 SEC-COM-END-ITEM PIC X.
  03 SECTION-ONE-AREA PIC X(5000).
  03 SECONE REDEFINES SECTION-ONE-AREA.
    05 SECTION-1-DATA.
***** TOTAL PREMIUM FOR SECTION-ONE
      10 S1-TOT-PREM PIC 9(6)V99.
*****KEYWORD NUMBER
*****0075
      10 S1-LOCNSW PIC 9.
*****0076
      10 S1-EXPNOV PIC X.
      10 S1DS-GRP OCCURS 100.
        15 S1DS OCCURS 5 PIC 9.
      10 M-D PIC X(20).
      10 S1-DEDC-MIN PIC 9(6).
      10 S1-B-RISKSV PIC X.
      10 S1-C-RISKSV PIC X.
      10 S1-G-RISKSV PIC X.
      10 S1TOTLOC PIC 9.
      10 S1-ANOTHERLOC PIC X.
      10 MDS.
          20 M-D1 PIC X(8).
          20 M-D2 PIC 9(5)V9(3).
      10 PROMPT-INFO.
          20 S1-CVG-NUM PIC 99.
          20 S1-VERB-NO PIC 9.
          20 S1-CALL-NUM-KEY PIC 9(4).
          20 S1-CK-QT-INDX PIC 99.
          20 S1-CALL-EDIT-TYPE PIC X.
      10 S1-CVGSW-INDXD.
          20 SCI.
            25 S1CVG OCCURS 13 PIC 9.
          20 SCIC.
            25 S1CVGCHG OCCURS 13 PIC X.
      10 COVERAGES.
        15 CVG OCCURS 5 INDEXED BY INX-CVG.
          20 S1-CVGSW.
            25 S1-B-SW PIC 9.
            25 S1-C-SW PIC 9.
            25 S1-G-SW PIC 9.
            25 S1-O-SW PIC 9.
            25 S1-T-SW PIC 9.
            25 S1-I-SW PIC 9.
            25 S1-R-SW PIC 9.
            25 S1-V-SW PIC 9.
            25 S1-P-SW PIC 9.
            25 S1-N-SW PIC 9.
            25 S1-M-SW PIC 9.
            25 S1-F-SW PIC 9.
            25 S1-X-SW PIC 9.
            25 S1-BR-SW PIC 9.
          20 S1-CVGSW-CHG.
            25 S1-B-CHG PIC X.
            25 S1-C-CHG PIC X.
            25 S1-G-CHG PIC X.
            25 S1-O-CHG PIC X.
            25 S1-T-CHG PIC X.
            25 S1-I-CHG PIC X.
            25 S1-R-CHG PIC X.
            25 S1-V-CHG PIC X.
            25 S1-P-CHG PIC X.
            25 S1-N-CHG PIC X.
            25 S1-M-CHG PIC X.
            25 S1-F-CHG PIC X.
            25 S1-X-CHG PIC X.
            25 S1-BR-CHG PIC X.
          20 S1-LOC-TOT-PREM PIC 9(6)V99.
*****0062
          20 S1-CLSCD PIC 9.
          20 S1-STCD PIC 99.
         20 S1-AREACD PIC 99.
*****0061
          20 S1-B-FIRE PIC 9V999.
          20 S1-B-EC PIC 9V999.
          20 S1-B-VMM PIC 9V999.
*****0063
          20 S1-B-COIN-FIRE PIC 9V999.
          20 S1-B-COIN-EC PIC 9V999.
          20 S1-B-COIN-VMM PIC 9V999.
****0064
          20 S1-SPRKLR PIC X.
*****0065
          20 S1-B-RISK PIC X.
*****0066
          20 S1-C-RISK PIC X.
*****0067
          20 S1-CHGRSK PIC X.
*****0068
          20 S1-X-BURG.
            25 S1-C-BURG PIC X.
            25 S1-G-BURG PIC X.
            25 S1-O-BURG PIC X.
*****0069
          20 S1-DISC PIC 9V999.
          20 S1-DEDC PIC 9(6).
          20 S1-RFTERR PIC 99.
          20 S1-G-FIRE PIC 9V999.
          20 S1-G-EC PIC 9V999.
          20 SS-G-VMM PIC 9V999.
          20 S1-FMM OCCURS 13 PIC V999.
          20 S1-DEDCPCT PIC V99.
          20 S1-RESTART-SW PIC 9.
*****0070
          20 S1-RF-CVG PIC X(5).
*****0071
          20 S1-RF-BAS PIC X.
          20 S1-RF-BAS-B PIC X.
          20 S1-RF-BAS-C PIC X.
          20 S1-RF-BAS-G PIC X.
*****0072
*****BUILDING WORK-AREA
          20 S1-B-LIM-LBL-PCT PIC 9(7).
          20 S1-B-LIM-COIN-PCT PIC V999.
*****CONTENTS WORKAREA
*****0073
          20 S1-C-LIM-LBL-PCT PIC 9(7).
          20 S1-C-LIM-COIN-PCT PIC V999.
*****CUSTOMER GOODS WORKAREA
*****0074
          20 S1-G-LIM-LBL-PCT PIC 9(7).
          20 S1-G-LIM-COIN-PCT PIC V999.
          20 S1-G-RISK PIC X.
*****OTHER PROPERT WORKAREA
*****0077
          20 S1-O-RATE PIC V999.
          20 S1-O-LIM-LBL PIC 9(7).
          20 S1-O-COIN-PCT PIC V999.
          20 S1-O-STATE PIC 99.
          20 S1-O-FIRE PIC 9V999.
          20 S1-O-EC PIC 9V999.
*****PROPERTY IN TRANSIT WORKAREA
          20 S1-T-RATE PIC V999.
          20 S1-T-LIM-LBL PIC 9(7).
          20 S1-T-RISKFORM PIC X.
          20 S1-T-NET-RATE PIC 9V999.
*****INCOME INTERRUPTION WORKAREA
          20 S1-I-LIM-LBL PIC 9(7).
          20 S1-I-COIN-PCT PIC V999.
          20 S1-I-CTF.
            25 S1-I-CLASS PIC XXX.
            25 S1-I-FORM PIC X.
            25 S1-I-TYPE PIC X.
*****ACCOUNTS RECEIVABLE
          20 S1-R-LIM-LBL PIC 9(7).
          20 S1-R-LIM-LBLAVG PIC 9(7).
          20 R-COIN-PCT PIC V999.
          20 S1-R-RECPTL PIC X.
          20 S1-R-RCPTYP PIC X(4).
          20 S1-R-CRED PIC V999.
*****0087
          20 S1-R-RCDDUP PIC 99.
*****0088
          20 S1-R-ARRKCL PIC X.
          20 S1-R-RATE PIC 9V999.
          20 S1-R-NRFPREM PIC 9(5)V99.
          20 S1-R-RFPREM PIC 9(5)V99.
*****VALUABLE PAPERS WORKAREA
          20 S1-V-LIM-LBL PIC 9(7).
          20 S1-V-COIN-PCT PIC V999.
*****0089
          20 S1-V-RECPTL PIC X.
*****0090
          20 S1-V-RCPTYP PIC X(4).
*****PLATE GLASS WORK AREA
          20 S1-P-LIM-LBL PIC 9(7).
          20 S1-P-COINCT PIC V999.
*****NEON SIGNS WORK AREA
          20 S1-N-LIM-LBL PIC 9(7).
          20 S1-N-NUMOFSIGNS PIC 99.
*****MARINE WORKAREA
          20 S1-M-RATE PIC V999.
          20 S1-M-LIM-LBL PIC 9(7).
          20 S1-M-COIN-PCT PIC V999.
*****FIRE WORKAREA
          20 S1-F-LIM-LBL PIC 9(7).
          20 S1-F-COIN-PCT PIC V999.
          20 S1-BPREMIUM PIC 9(5)V99.
          20 S1-CPREMIUM PIC 9(5)V99.
          20 S1-GPREMIUM PIC 9(5)V99.
          20 S1-TPREMIUM PIC 9(5)V99.
          20 S1-OPREMIUM PIC 9(5)V99.
          20 S1-RPREMIUM PIC 9(5)V99.
          20 S1-VPREMIUM PIC 9(5)V99.
          20 S1-RISKFORM-CODE PIC X.
***** INDEX FOR S1DS DATA SWITCHES
          20 S1DSINDX PIC 99.
          20 S1-C-FIRE PIC 9V999.
          20 S1-C-EC PIC 9V999.
          20 S1-C-VMM PIC 9V999.
***** RESULTS OF S1-B-FIRE S1-B-EC *.95 OR *.90
          20 S1-BF PIC 99V999.
          20 S1-BEC PIC 99V999.
***** ADJUSTED BY .70 FOR VIRGINIA APT
          20 S1-BFVA PIC 99V999.
          20 S1-BECVA PIC 99V999.
          20 S1-STATE PIC XX.
          20 S1-BF-NET-RATE PIC 99V999.
          20 S1-BEC-NET-RATE PIC 99V999.
          20 S1-BFORM-NET-RATE PIC 99V999.
***** RESULTS OF S1-BLDG-LIM * NET-RATES
          20 S1-BF-PREM PIC 9(5)V99.
          20 S1-BEC-PREM PIC 9(5)V99.
          20 S1-BFORM-PREM PIC 9(5)V99.
***** RESULTS OF S1-C-FIRE S1-C-EC *.95 OR *.90
          20 S1-CF PIC 99V999.
          20 S1-CEC PIC 99V999.
***** ADJUSTED BY .70 FOR VIRGINIA APT
          20 S1-CEVA PIC 99V999.
          20 S1-CECVA PIC 99V999.
          20 S1-CF-NET-RATE PIC 99V999.
          20 S1-CEC-NET-RATE PIC 99V999.
          20 S1-CFORM-NET-RATE PIC 99V999.
***** RESULTS OF S1-CNTS-LIM * NET-RATES
          20 S1-CF-PREM PIC 9(5)V99.
          20 S1-CEC-PREM PIC 9(5)V99.
          20 S1-CFORM-PREM PIC 9(5)V99.
***** RESULTS OF S1-G-FIRE S1-G-EC *.95 OR *.90
          20 S1-GF PIC 99V999.
          20 S1-GEC PIC 99V999.
***** ADJUSTED BY .70 FOR VIRGINIA APT
          20 S1-GEVA PIC 99V999.
          20 S1-GECVA PIC 99V999.
          20 S1-GF-NET-RATE PIC 99V999.
          20 S1-GEC-NET-RATE PIC 99V999.
          20 S1-GFORM-NET-RATE PIC 99V999.
***** RESULTS OF S1-BLDG-LIM * NET-RATES
          20 S1-GF-PREM PIC 9(5)V99.
          20 S1-GEC-PREM PIC 9(5)V99.
          20 S1-GFORM-PREM PIC 9(5)V99.
* KW00 DS#
          20 S1-I-CFT PIC X(40).
          20 S1-I-CLASS PIC XXX.
          20 S1-I-FORM PIC X.
          20 S1-I-TYPE PIC X.
          20 S1-B-BLNKT PIC X.
          20 S1-B-DISCAMT PIC 9(6).
          20 S1-C-DISCAMT PIC 9(6).
          20 S1-G-DISCAMT PIC 9(6).
          20 S1-O-DISCAMT PIC 9(6).
          20 S1-T-DISCAMT PIC 9(6).
          20 S1-I-DISCAMT PIC 9(6).
          20 S1-R-DISCAMT PIC 9(6).
          20 S1-V-DISCAMT PIC 9(6).
          20 S1-P-DISCAMT PIC 9(6).
          20 S1-N-DISCAMT PIC 9(6).
          20 S1-M-DISCAMT PIC 9(6).
          20 S1-F-DISCAMT PIC 9(6).
          20 S1-X-DISCAMT PIC 9(6).
          20 S1-CVGCHG PIC X.
          20 S1-L-STA PIC 99.
          20 S1-LOCAD1 PIC X(40).
          20 S1-LOCAD2 PIC X(40).
          20 S1-C-RFCVF PIC X.
          20 S1-G-RFCVF PIC X.
          20 S1-O-RFCVF PIC X.
          20 S1-R-RFCVF PIC X.
          20 S1-CRF-SA PIC X.
          20 S1-GRF-SA PIC X.
          20 S1-ORF-SA PIC X.
          20 S1-RRF-SA PIC X.
          20 S1-G-RFSLIM PIC 9(7).
          20 S1-C-RFSLIM PIC 9(7).
          20 S1-O-RFSLIM PIC 9(7).
          20 S1-R-RFSLIM PIC 9(7).
          20 S1-C-NRFCV PIC X.
          20 S1-G-NRFCV PIC X.
          20 S1-O-NRFCV PIC X.
          20 S1-R-NRFCV PIC X.
      10 S1-C-RFALIM PIC 9(7).
      10 S1-G-RFALIM PIC 9(7).
      10 S1-O-RFALIM PIC 9(7).
      10 S1-R-RFALIM PIC 9(7).
      10 S1-CVGALPHA PIC X(40).
      10 S1-ALL-SIXES PIC 9.
      10 S1-MORLOC PIC X.
      10 S1-TACKON OCCURS 5.
        15 S1-CF-BLNKT PIC X.
        15 S1-CEC-BLNKT PIC X.
        15 S1-BF-BLNKT PIC X.
        15 S1-BEC-BLNKT PIC X.
        15 S1-CB-BLNKT PIC X.
    05 SEC-1-END-ITEM PIC X.
  03 SECTION-ONE-BURG PIC X(20500).
  03 BURGLARY-SECTION REDEFINES SECTION-ONE-BURG.
      10 S1-BURGLARY-SW OCCURS 5 PIC 9.
      10 BURG-COV-SWS.
        15 B-COV-SWS OCCURS 5 PIC 9(7).
      10 B-COV-SWS-1 REDEFINES BURG-COV-SWS.
        15 B-COV-SW-1 OCCURS 5.
          20 B-COV-SW OCCURS 7 PIC 9.
      10 B-COV-REDEF REDEFINES BURG-COV-SWS.
        15 B-COV-RED OCCURS 5.
          20 S1-MOS-COV-SW PIC 9.
          20 S1-MS-COV-SW PIC 9.
          20 S1-MR-COV-SW PIC 9.
          20 S1-BFMS-COV-SW PIC 9.
          20 S1-BFS-COV-SW PIC 9.
          20 S1-SBR-COV-SW PIC 9.
          20 S1-OBR-COV-SW PIC 9.
      10 S1-B-DATA-SWITCHES OCCURS 5.
        15 B-BMON01-SW PIC 9.
        15 B-BMON02-SW PIC 9.
        15 B-BMON03-SW PIC 9.
        15 B-BMON04-SW PIC 9.
        15 B-BMON05-SW PIC 9.
        15 B-BMON06-SW PIC 9.
        15 B-BMON07-SW PIC 9.
        15 B-BMON08-SW PIC 9.
        15 B-BMON11-SW PIC 9.
        15 B-BMON12-SW PIC 9.
        15 B-BMON13-SW PIC 9.
        15 B-BMON14-SW PIC 9.
        15 B-BMON15-SW PIC 9.
        15 B-BMON16-SW PIC 9.
        15 B-BMON17-SW PIC 9.
        15 B-BMON18-SW PIC 9.
        15 B-BMON19-SW PIC 9.
        15 BURG-COV-INPUT-SW PIC 9.
      10 B-MOS-DATA-SWITCHES.
        15 MOS-SWITCHES OCCURS 5 PIC X(44).
      10 B-MOS-DATA-SWS REDEFINES B-MOS-DATA-SWITCHES.
        15 MOS-DATA-SWS OCCURS 5.
          20 MOS-COMMON-SWS PIC 99.
          20 MOS-DIV-SWS OCCURS 3.
            25 MOS-DIV-SW PIC 9(14).
      10 B-MOS-SWS REDEFINES B-MOS-DATA-SWITCHES.
        15 MOS-SWS OCCURS 5.
          20 B-MOS-01-SW PIC 9.
          20 B-MOS-02W PIC 9.
          20 B-MOS-DIV OCCURS 3.
            25 B-MOS-10-SW PIC 9.
            25 B-MOS-11-SW PIC 9.
            25 B-MOS-12-SW PIC 9.
            25 B-MOS-13-SW PIC 9.
            25 B-MOS-14-SW PIC 9.
            25 B-MOS-15-SW PIC 9.
            25 B-MOS-16-SW PIC 9.
            25 B-MOS-17-SW PIC 9.
            25 B-MOS-18-SW PIC 9.
            25 B-MOS-19-SW PIC 9.
            25 B-MOS-20-SW PIC 9.
            25 B-MOS-21-SW PIC 9.
            25 B-MOS-22-SW PIC 9.
            25 B-MOS-23-SW PIC 9.
      10 B-MS-DATA-SWITCHES.
        15 MS-SWITCHES OCCURS 5 PIC X(20).
      10 B-MS-DATA-SWS REDEFINES B-MS-DATA-SWITCHES.
        15 MS-DATA-SWS OCCURS 5.
          20 B-MS-001-SW PIC 9.
          20 B-MS-002-SW PIC 9.
          20 B-MS-003-SW PIC 9.
          20 B-MS-004-SW PIC 9.
          20 B-MS-005-SW PIC 9.
          20 B-MS-006-SW PIC 9.
          20 B-MS-007-SW PIC 9.
          20 B-MS-008-SW PIC 9.
          20 B-MS-009-SW PIC 9.
          20 B-MS-010-SW PIC 9.
          20 B-MS-011-SW PIC 9.
          20 B-MS-012-SW PIC 9.
          20 B-MS-013-SW PIC 9.
          20 B-MS-014-SW PIC 9.
          20 B-MS-015-SW PIC 9.
          20 B-MS-016-SW PIC 9.
          20 B-MS-017-SW PIC 9.
          20 B-MS-018-SW PIC 9.
          20 B-MS-019-SW PIC 9.
          20 B-MS-020-SW PIC 9.
      10 B-MR-DATA-SWITCHES.
        15 MR-SWITCHES OCCURS 5 PIC X(43).
      10 B-MR-DATA-SWS REDEFINES B-MR-DATA-SWITCHES.
        15 MR-DATA-SWS OCCURS 5.
          20 MR-COMMON-SWS PIC 999.
          20 MR-INSIDE-SWS PIC 9(9).
          20 MR-COM-MSGR-SW PIC 9.
          20 MR-MSGR-SWS OCCURS 5.
            25 MR-MSGR-SW PIC 9(6).
      10 B-MR-SWS REDEFINES B-MR-DATA-SWITCHES.
        15 MR-SWS OCCURS 5.
          20 B-MR-001-SW PIC 9.
          20 B-MR-002-SW PIC 9.
          20 B-MR-003-SW PIC 9.
          20 B-MR-100-SW PIC 9.
          20 B-MR-101-SW PIC 9.
          20 B-MR-102-SW PIC 9.
          20 B-MR-103-SW PIC 9.
          20 B-MR-104-SW PIC 9.
          20 B-MR-105-SW PIC 9.
          2R-106-SW PIC 9.
          20 B-MR-107-SW PIC 9.
          20 B-MR-108-SW PIC 9.
          20 B-MR-201-SW PIC 9.
          20 B-MR-MSGRS OCCURS 5.
            25 B-MR-202-SW PIC 9.
            25 B-MR-203-SW PIC 9.
            25 B-MR-204-SW PIC 9.
            25 B-MR-205-SW PIC 9.
            25 B-MR-206-SW PIC 9.
            25 B-MR-207-SW PIC 9.
      10 B-BFMS-DATA-SWITCHES.
        15 BFMS-SWITCHES OCCURS 5 PIC X(58).
      10 B-BFMS-DATA-SWS REDEFINES B-BFMS-DATA-SWITCHES.
        15 BFMS-DATA-SWS OCCURS 5.
          20 BFMS-COMMON-SWS PIC 9(4).
          20 BFMS-INSIDE-SWS PIC 9(17).
          20 BFMS-COM-MSGR-SW PIC 9.
          20 BFMS-MSGR-SW OCCURS 5.
            25 BFMS-MSGR-SWS PIC 9(6).
          20 BFMS-COM-AMV-SW PIC 9.
          20 BFMS-AMV-SW PIC 9(5).
      10 B-BFMS-SWS REDEFINES B-BFMS-DATA-SWITCHES.
        15 BFMS-SWS OCCURS 5.
          20 B-BF-001-SW PIC 9.
          20 B-BF-002-SW PIC 9.
          20 B-BF-003-SW PIC 9.
          20 B-BF-004-SW PIC 9.
          20 B-BF-100-SW PIC 9.
          20 B-BF-101-SW PIC 9.
          20 B-BF-103-SW PIC 9.
          20 B-BF-104-SW PIC 9.
          20 B-BF-105-SW PIC 9.
          20 B-BF-106-SW PIC 9.
          20 B-BF-107-SW PIC 9.
          20 B-BF-108-SW PIC 9.
          20 B-BF-109-S PIC 9.
          20 B-BF-110-SW PIC 9.
          20 B-BF-111-SW PIC 9.
          20 B-BF-112-SW PIC 9.
          20 B-BF-113-SW PIC 9.
          20 B-BF-114-SW PIC 9.
          20 B-BF-115-SW PIC 9.
          20 B-BF-116-SW PIC 9.
          20 B-BF-117-SW PIC 9.
          20 B-BF-201-SW PIC 9.
          20 B-BF-MSGRS OCCURS 5.
            25 B-BF-202-SW PIC 9.
            25 B-BF-203-SW PIC 9.
            25 B-BF-204-SW PIC 9.
            25 B-BF-205-SW PIC 9.
            25 B-BF-206-SW PIC 9.
            25 B-BF-207-SW PIC 9.
          20 B-BF-301-SW PIC 9.
          20 B-BF-302-SW OCCURS 5 PIC 9.
      10 B-BFS-DATA-SWITCHES.
        15 BFS-SWITCHES OCCURS 5 PIC 99.
      10 B-BFS-DATA-SWS REDEFINES B-BFS-DATA-SWITCHES.
        15 BFS-DATA-SWS OCCURS 5.
          20 B-BFS-01-SW PIC 9.
          20 B-BFS-02-SW PIC 9.
      10 B-SBR-DATA-SWITCHES.
        15 SBR-SWITCHES OCCURS 5 PIC 99.
      10 B-SBR-DATA-SWS REDEFINES B-SBR-DATA-SWITCHES.
        15 SBR-DATA-SWS OCCURS 5.
          20 B-SBR-01-SW PIC 9.
          20 B-SBR-02-SW PIC 9.
      10 B-OBR-DATA-SWITCHES.
        15 OBR-SWITCHES OCCURS 5 PIC 9(12).
      10 B-OBR-DATA-SWS REDEFINES B-OBR-DATA-SWITCHES.
        15 OBR-DATA-SWS OCCURS 5.
          20 OBR-COMMON-SWS PIC 9(7).
          20 OBR-PSD-SW OCCURS 5 PIC 9.
      10 B-OBR-SWS REDEFINES B-OBR-DATA-SWITCHES.
        15 OBR-SWS OCCURS 5.
          20 B-OBR-01-SW PIC 9.
          20 B-OBR-02-SW PIC 9.
          20 B-OBR-03-SW PIC 9.
          20 B-OBR-04-SW PIC 9.
          20 B-OBR-05-SW PIC 9.
          20 B-OBR-06-SW PIC 9.
          20 B-OBR-07-SW PIC 9.
          20 B-OBR-08-SW OCCURS 5 PIC 9.
      10 B-DDS-TABLE.
        15 B-DDS-TBL OCCURS 5 PIC 9(7).
      10 B-DDS-TBL-1 REDEFINES B-DDS-TABLE.
        15 B-DDS-T OCCURS 5.
          20 B-DDS OCCURS 7 PIC 9.
      10 B-DDS-RED REDEFINES B-DDS-TABLE.
        15 B-DDS-R OCCURS 5.
          20 B-MOS000-SW PIC 9.
          20 B-MS0000-SW PIC 9.
          20 B-MR0000-SW PIC 9.
          20 B-BFMS00-SW PIC 9.
          20 B-BFS000-SW PIC 9.
          20 B-SBR000-SW PIC 9.
          20 B-OBR000-SW PIC 9.
      10 B-RISK-CLASS OCCURS 5 PIC 99.
      10 B-MS-RISK-CLASS OCCURS 5 PIC 99.
      10 B-MR-RISK-CLASS OCCURS 5 PIC 99.
      10 B-BFMS-RISK-CLASS OCCURS 5 PIC 99.
      10 B-BFS-RISK-CLASS OCCURS 5 PIC 99.
      10 B-SBR-RISK-CLASS OCCURS 5 PIC 99.
      10 BRG-EXCEPT OCCURS 5 PIC X.
      10 BRG-OPEN-24-HRS-IND OCCURS 5 PIC X.
      10 BRG-PKG-MOD-1 OCCURS 5 PIC S99V999.
      10 BRG-PKG-MOD-2 OCCURS 5 PIC S99V999.
      10 BRG-PKG-MOD-3 OCCURS 5 PIC S99V999.
      10 BRG-SCFM-INDICATOR OCCURS 5 PIC X.
      10 BRG-TERR-CODE OCCURS 5 PIC 9(4).
      10 B-MOS-CHANGE-IND OCCURS 5 PIC X.
      10 B-MOS-DIV-CHANGE-IND OCCURS 5 PIC 999.
      10 B-MR-IP-CHANGE-IND OCCURS 5 PIC X.
      10 B-MR-OP-CHANGE-IND OCCURS 5 PIC X.
      10 B-MR-OP-MSGR-CHANGES OCCURS 5 PIC 9(5).
      10 B-BFMS-IP-CHANGE-IND OCCURS 5 PIC X.
      10 B-BFMS-OP-CHANGE-IND OCCURS 5 PIC X.
      10 B-BFMS-OP-MSGR-CHNGE OCCURS 5 PIC 9(5).
      10 B-BFMS-AMV-CHNGE-IND OCCURS 5 PIC X.
      10 BURG-YN OCCURS 5 PIC X.
      10 B-COV-INPUT.
        15 BURG-COV-INPUT OCCURS 5 PIC X(40).
      10 BURG-COV-INPUT-1 REDEFINES B-COV-INPUT.
        15 BUR-COV-INPUT OCCURS 5.
          20 B-COV-INPUT-BYTE OCCURS 40 PIC X.
      10 B-COV-HOLD.
        15 BURG-COV-HOLD OCCURS 5 PIC X(7).
      10 BURG-COV-HOLD-1 REDEFINES B-COV-HOLD.
        15 BUR-COV-HOLD OCCURS 5.
          20 B-COV-HOLD-BYTE OCCURS 7 PIC X.
      10 BURG-COV-TABLE.
        15 B-COV-TABLE OCCURS 5.
          20 BURG-COV-YN-TABLE PIC X(7).
      10 B-COV-YN REDEFINES BURG-COV-TABLE.
        15 B-COV-YN-TAB OCCURS 5.
          20 BURG-COV-YN OCCURS 7 PIC X.
      10 BURG-COV-INPUT-REDEF REDEFINES BURG-COV-TABLE.
        15 B-COV-INPUT-R OCCURS 5.
          20 B-MOS-COV-SW PIC X.
          20 B-MS-COV-SW PIC X.
          20 B-MR-COV-SW PIC X.
          20 B-BFMS-COV-SW PIC X.
          20 B-BFS-COV-SW PIC X.
          20 B-SBR-COV-SW PIC X.
          20 B-OBR-COV-SW PIC X.
      10 BRG-CHANGE OCCURS 5 PIC 9.
      10 BRG-RESTART-SW PIC 9.
      10 DIVSUB PIC 9.
      10 MSGRSUB PIC 9.
      10 B-BASE-RATE PIC 99V999.
      10 B-TBL-RATE PIC 9(5)V99.
      10 B-BASE-AMOUNT PIC 9(6)V999.
      10 B-S-CASH-REG PIC 9(5)V99.
      10 B-S-KLS PIC 9(5)V99.
      10 B-D-WATCHMAN PIC 99V999.
      10 B-D-PRM-ALARM PIC 99V999.
      10 B-D-BR-GLASS PIC 99V999.
      10 B-D-SECURITIES PIC 99V999.
      10 B-D-24-HRS PIC 99V999.
      10 B-D-TEAR-GAS PIC 99V999.
      10 B-D-SAFE-VAULT PIC 99V999.
      10 B-D-BR-ENCL PIC 99V999.
      10 B-D-BRE-ALARM PIC 99V999.
      10 B-D-PB-ALARM PIC 99V999.
      10 B-D-GUARD PIC 99V999.
      10 B-D-HOLDUP PIC 99V999.
      10 B-D-MSG-BAG PIC 99V999.
      10 B-D-PRIV-CONV PIC 99V999.
      10 B-D-R-ROUTE PIC 99V999.
      10 B-D-BRG-ALARM PIC 99V999.
      10 B-S-SCFM PIC 99V999.
      10 B-ATR-A PIC 9(5)V99.
      10 B-ATR-B PIC 9(5)V99.
      10 B-ATR-C PIC 9(5)V99.
      10 B-ATR-D PIC 9(5)V99.
      10 B-ATR-E PIC 9(5)V99.
      10 B-ATR-F PIC 9(5)V99.
      10 B-ATR-G PIC 9(5)V99.
      10 B-ATR-H PIC 9(5)V99.
      10 B-ATR-I PIC 9(5)V99.
      10 B-ATR-J PIC 9(5)V99.
      10 B-ATR-K PIC 9(5)V99.
      10 B-ATR-L PIC 9(5)V99.
      10 B-ATR-M PIC 9(5)V99.
      10 B-ATR-N PIC 9(5)V99.
      10 B-ATR-O PIC 9(5)V99.
      10 B-ATR-P PIC 9(5)V99.
      10 B-ATR-Q PIC 9(5)V99.
      10 B-ATR-R PIC 9(5)V99.
      10 B-ATR-S PIC 9(5)V99.
      10 B-BASE-PREMIUM PIC 9(7).
      10 B-ADJ-PREMIUM PIC 9(7).
      10 B-ADJ-BASE-RATE-3 PIC 9(5)V99.
      10 B-SURCD-TBL-RATE PIC 9(5)V99.
      10 B-DSCT-TBL-RATE PIC 9(5)V99.
      10 B-ADJ-BASE-RATE-1 PIC 9(5)V99.
      10 B-ADJ-BASE-RATE-2 PIC 9(5)V99.
      10 B-MOS-DVD-COVERAGE OCCURS 5 PIC X.
      10 B-MOS-DIV-COUNT OCCURS 5 PIC 9.
      10 BDIV PIC 9.
      10 B-MOS-LOCATIONS OCCURS 5.
        15 B-MOS-DIVISIONS OCCURS 3.
          20 B-MOS-TRD-GRP PIC 9.
          20 B-MOS-INS-AMOUNT PIC 9(9).
          20 B-MOS-WMN-INDICATOR PIC X.
          20 B-MOS-WMN-CLASS-A PIC 99.
          20 B-MOS-WMN-CLASS-B PIC 99.
          20 B-MOS-WMN-CLASS-C PIC 99.
          20 B-MOS-WMN-CLASS-D PIC 99.
          20 B-MOS-WMN-CLASS-E PIC 99.
          20 B-MOS-WMN-CLASS-F PIC 99.
          20 B-MOS-PA-INDICATOR PIC X.
          20 B-MOS-PA-DATA.
            25 B-MOS-PA-CATG PIC 9.
            25 B-MOS-PA-INSTL PIC 9.
            25 B-MOS-PA-CLASS PIC X.
          20 B-MOS-BG-INDICATOR PIC X.
          20 B-MOS-TF-INDICATOR PIC X.
          20 B-MOS-TF-DATA.
            25 B-MOS-TF-CATG PIC 9.
            25 B-MOS-TF-AMOUNT PIC 9(9).
          20 B-MOS-TF-SURCD PIC 9(5)V99.
          20 B-MOS-TERR-MULT PIC 99V999.
          20 B-MOS-TF-RATE PIC 99V999.
          20 B-MOS-WMN-DSCT PIC 9(5)V99.
          20 B-MOS-PA-DSCT PIC 9(5)V99.
          20 B-MOS-BRG-DSCT PIC 9(5)V99.
          20 B-MOS-BASE-PREMIUM PIC 9(7).
          20 B-MOS-ADJ-PREMIUM PIC 9(7).
          20 B-MOS-ADJ-BASE-RATE-1 PIC 9(5)V99.
          20 B-MOS-ADJ-BASE-RATE-2 PIC 9(5)V99.
          20 B-MOS-ADJ-BASE-RATE-3 PIC 9(5)V99.
          20 B-MOS-PMOD-RATE-1 PIC 9(5)V99.
          20 B-MOS-SURCD-RATE PIC 9(5)V99.
          20 B-MOS-DSCTD-RATE PIC 9(5)V99.
          20 B-MOS-FINAL-PREMIUM PIC 9(7).
          20 B-MOS-PREMIUM PIC 9(7).
          20 B-MOS-TBL-RATE PIC 9(5)V99.
      10 B-MS-SAFE-CLASS OCCURS 5 PIC XX.
      10 B-MS-INS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-MS-CASH-INDICATOR OCCURS 5 PIC X.
      10 B-MS-CASH-DATA OCCURS 5.
        15 B-MS-CASH-TYPE PIC 9.
        15 B-MS-CASH-AMOUNT PIC 9(9).
      10 B-MS-KLS-INDICATOR OCCURS 5 PIC X.
      10 B-MS-KLS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-MS-SEC-INDICATOR OCCURS 5 PIC X.
      10 B-MS-TGS-INDICATOR OCCURS 5 PIC X.
      10 B-MS-WMN-INDICATOR OCCURS 5 PIC X.
      10 B-MS-WMN-CLASS-A OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-B OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-C OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-D OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-E OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-F OCCURS 5 PIC 99.
      10 B-MS-SVA-INDICATOR OCCURS 5 PIC X.
      10 B-MS-SVA-DATA OCCURS 5.
        15 B-MS-SVA-SYSTEM PIC X.
        15 B-MS-SVA-INSTL PIC 9.
        15 B-MS-SVA-CLASS PIC X.
      10 B-MS-PAS-INDICATOR OCCURS 5 PIC X.
      10 B-MS-PAS-DATA OCCURS 5.
        15 B-MS-PAS-CATG PIC 9.
        15 B-MS-PAS-INSTL PIC 9.
        15 B-MS-PAS-CLASS PIC X.
      10 B-MS-CASH-SURCH OCCURS 5 PIC 9(5)V99.
      10 B-MS-KLS-SURCH OCCURS 5 PIC 9(5)V99.
      10 B-MS-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-MS-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MS-CASH OCCURS 5 PIC 9(5)V99.
      10 B-MS-KLS OCCURS 5 PIC 9(5)V99.
      10 B-MS-SURC-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MS-WMN-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-PA-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-SEC-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-24-HRS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-TEAR-GAS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-SAFE-VAULT-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-DSCT-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MS-PMOD-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MS-ADJ-BASE-RATE-1 OCCURS 5 PIC 9(5)V99.
      10 B-MS-ADJ-BASE-RATE-2 OCCURS 5 PIC 9(5)V99.
      10 B-MS-ADJ-BASE-RATE-3 OCCURS 5 PIC 9(5)V99.
      10 B-MS-BASIC-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-SCFM-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-CRCD-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-FINAL-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-MULT-EXP OCCURS 5 PIC 9(9).
      10 B-BFS-INS-AMOUNT OCCURS 5 PIC 9(4).
      10 B-BFS-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-BFS-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-BFS-SCFM-RATE OCCURS 5 PIC 99V999.
      10 B-BFS-FINAL-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFS-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFS-ADJ-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFS-ADJ-RATE-1 OCCURS 5 PIC 9(5)V99.
      10 B-BFS-ADJ-RATE-2 OCCURS 5 PIC 9(5)V99.
      10 B-BFS-ADJ-RATE OCCURS 5 PIC 9(5)V99.
      10 B-SBR-INS-AMOUNT OCCURS 5 PIC 9(4).
      10 B-SBR-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-SBR-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-SBR-SCFM-RATE OCCURS 5 PIC 99V99.
      10 B-SBR-FINAL-PREMIUM OCCURS 5 PIC 9(7).
      10 B-SBR-PREMIUM OCCURS 5 PIC 9(7).
      10 B-SBR-ADJ-PREMIUM OCCURS 5 PIC 9(7).
      10 B-SBR-ADJ-RATE-1 OCCURS 5 PIC 9(5)V99.
      10 B-SBR-ADJ-RATE-2 OCCURS 5 PIC 9(5)V99.
      10 B-SBR-ADJ-RATE OCCURS 5 PIC 9(5)V99.
      10 B-OBR-INS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-OBR-MSD-COVERAGE OCCURS 5 PIC X.
      10 B-OBR-MSD-AMOUNT OCCURS 5 PIC 9(9).
      10 B-OBR-MSD-MEDIA OCCURS 5 PIC X.
      10 B-OBR-MSD-SEC-ONLY OCCURS 5 PIC X.
      10 B-OBR-PSD-COVERAGE OCCURS 5 PIC X.
      10 B-OBR-PSD-PEOPLE OCCURS 5 PIC 9.
      10 BPPL PIC 9.
      10 B-OBR-BASIC-PREMIUM OCCURS 5 PIC 9(7)V99.
      10 B-OBR-WS-F OCCURS 5 PIC 9(5)V99.
      10 B-OBR-MSD-SURCH OCCURS 5 PIC 9(5)V99.
      10 B-OBR-ADJ-MSD-SURCH OCCURS 5 PIC 9(5)V99.
      10 B-OBR-ADJ-PREMIUM OCCURS 5 PIC 9(7)V99.
      10 B-OBR-ADJ-PREMIUM-2 OCCURS 5 PIC 9(7)V99.
      10 B-OBR-ADJ-1 OCCURS 5 PIC 9(7)V99.
      10 B-OBR-ADJ-2 OCCURS 5 PIC 9(7)V99.
      10 B-OBR-ADJ-3 OCCURS 5 PIC 9(7)V99.
      10 B-OBR-MSD-ADJ-1 OCCURS 5 PIC 9(5)V99.
      10 B-OBR-MSD-ADJ-2 OCCURS 5 PIC 9(5)V99.
      10 B-OBR-MSD-ADJ-3 OCCURS 5 PIC 9(5)V99.
      10 B-OBR-LOCATIONS OCCURS 5.
        15 B-OBR-PEOPLE OCCURS 5.
          20 B-OBR-PSD-AMOUNT PIC 9(9).
          20 B-OBR-PSD-SURCH PIC 9(5)V99.
          20 B-OBR-PSD-ADJ-1 PIC 9(4)V99.
          20 B-OBR-PSD-ADJ-2 PIC 9(5)V99.
          20 B-OBR-PSD-ADJ-3 PIC 9(5)V99.
      10 B-BF-IP-COVERAGE OCCURS 5 PIC X.
      10 B-BF-OP-COVERAGE OCCURS 5 PIC X.
      10 B-BF-AV-COVERAGE OCCURS 5 PIC X.
      10 B-BF-SEC-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-INS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-BFI-SAFE-CLASS OCCURS 5 PIC XX.
      10 B-BFI-TGS-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-WMN-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-WMN-CLASS-A OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-B OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-C OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-D OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-E OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-F OCCURS 5 PIC 99.
      10 B-BFI-GUARDS-IND OCCURS 5 PIC X.
      10 B-BFI-FT-GUARDS OCCURS 5 PIC 99.
      10 B-BFI-PBA-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-HAPS-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-BAS-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-BAS-DATA OCCURS 5.
        15 B-BFI-BAS-KIND PIC X.
        15 B-BFI-BAS-INSTL PIC 9.
        15 B-BFI-BAS-CLASS PIC X.
      10 B-BFI-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-BFI-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-BFI-WMN-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-SEC-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-24-HR-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-TEAR-GAS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-PBA-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-GUARD-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-HAPS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-BAS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-PMOD-RATE OCCURS 5 PIC 9(5)V99.
      10 B-BFI-ADJ-BASE-RTE-1 OCCURS 5 PIC 9(5)V99.
      10 B-BFI-ADJ-BASE-RTE-2 OCCURS 5 PIC 9(5)V99.
      10 B-BFI-ADJ-RATE OCCURS 5 PIC 9(5)V99.
      10 B-BFI-BASIC-PREM OCCURS 5 PIC 9(7).
      10 B-BFI-FINAL-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFI-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFI-MULT-EXP OCCURS 5 PIC 9(9).
      10 B-BFO-NO-MSGRS OCCURS 5 PIC 99.
      10 B-BFO-LOCATIONS OCCURS 5.
        15 B-BFO-MESSENGERS OCCURS 5.
          20 B-BFO-MSGR-GUARDS PIC 99.
          20 B-BFO-INS-AMOUNT PIC 9(9).
          20 B-BFO-PC-INDICATOR PIC X.
          20 B-BFO-MSGR-BAG-IND PIC X.
          20 B-BFO-MSGR-BAG-CLASS PIC X.
          20 B-BFO-RR-INDICATOR PIC X.
          20 B-BFO-TERR-MULT PIC 99V999.
          20 B-BFO-TBL-RATE PIC 9(5)V99.
          20 B-BFO-SEC-DSCT PIC 9(5)V99.
          20 B-BFO-24-HR-DSCT PIC 9(5)V99.
          20 B-BFO-MSG-BAG-DSCT PIC 9(5)V99.
          20 B-BFO-PC-DSCT PIC 9(5)V99.
          20 B-BFO-RR-DSCT PIC 9(5)V99.
          20 B-BFO-PMOD-RATE PIC 9(5)V99.
          20 B-BFO-ADJ-RATE-1 PIC 9(5)V99.
          20 B-BFO-ADJ-RATE-2 PIC 9(5)V99.
          20 B-BFO-ADJ-RATE PIC 9(5)V99.
          20 B-BFO-BASIC-PREM PIC 9(7).
          20 B-BFO-FINAL-PREMIUM PIC 9(7).
          20 B-BFO-PREMIUM PIC 9(7).
          20 B-BFO-MULT-EXP PIC 9(7).
      10 B-BFA-VEHICLES OCCURS 5 PIC 99.
      10 BAMV PIC 9.
      10 B-BFA-LOCATIONS OCCURS 5.
        15 B-BFA-VEH OCCURS 5.
          20 B-BFA-VEH-INSURANCE PIC 9(9).
          20 B-BFA-TERR-MULT PIC 99V999.
          20 B-BFA-TBL-RATE PIC 9(5)V99.
          20 B-BFA-SEC-DSCT PIC 9(5)V99.
          20 B-BFA-PC-DSCT PIC 9(5)V99.
          20 B-BFA-PMOD-RATE PIC 9(5)V99.
          20 B-BFA-ADJ-RATE-1 PIC 9(5)V99.
          20 B-BFA-ADJ-RATE-2 PIC 9(5)V99.
          20 B-BFA-ADJ-RATE PIC 9(5)V99.
          20 B-BFA-BASIC-PREM PIC 9(7).
          20 B-BFA-FINAL-PREMIUM PIC 9(7).
          20 B-BFA-PREMIUM PIC 9(7).
          20 B-BFA-MULT-EXP PIC 9(7).
      10 B-MR-IP-COVERAGE OCCURS 5 PIC X.
      10 B-MR-OP-COVERAGE OCCURS 5 PIC X.
      10 B-MR-SEC-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-INS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-MRI-DUTY-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-BRE-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-BREAS-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-TGS-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-GUARDS-INDICATOR OCCURS 5 PIC 99.
      10 B-MRI-PBA-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-HAPS-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-MRI-IP-SW OCCURS 5 PIC X.
      10 B-MRI-MP-EXCEP.
        15 B-MRI-MP-CLASS-1 OCCURS 5.
          20 B-MRI-MP-CL1-1 PIC 999.
          20 B-MRI-MP-CL1-2 PIC 999.
        15 B-MRI-MP-CLASS-2 OCCURS 5.
          20 B-MRI-MP-CL2-1 PIC 999.
          20 B-MRI-MP-CL2-2 PIC 999.
        15 B-MRI-MP-CLASS-3 OCCURS 5.
          20 B-MRI-MP-CL3-1 PIC 999.
          20 B-MRI-MP-CL3-2 PIC 999.
        15 B-MRI-MP-CLASS-4 OCCURS 5.
          20 B-MRI-MP-CL4-1 PIC 999.
          20 B-MRI-MP-CL4-2 PIC 999.
      10 B-MRI-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MRI-SEC-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-BRE-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-BREAS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-TGS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-GUARD-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-PBA-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-HAPS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-PMOD-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MRI-ADJ-RATE-1 OCCURS 5 PIC 9(5)V99.
      10 B-MRI-ADJ-RATE-2 OCCURS 5 PIC 9(5)V99.
      10 B-MRI-ADJ-BASE-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MRI-BASIC-PREM OCCURS 5 PIC 9(7).
      10 B-MRI-FINAL-PREM OCCURS 5 PIC 9(7).
      10 B-MRI-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MRI-MULT-EXP OCCURS 5 PIC 9(9).
      10 B-MRO-MESSENGERS OCCURS 5 PIC 99.
      10 BMSGR PIC 99.
      10 B-MRO-LOCATIONS OCCURS 5.
        15 B-MRO-MSGRS OCCURS 5.
          20 B-MRO-NO-GUARDS PIC 99.
          20 B-MRO-INS-AMOUNT PIC 9(9).
          20 B-MRO-BSSW-INDICATOR PIC X.
          20 B-MRO-BSSW-CLASS PIC X.
          20 B-MRO-PC-INDICATOR PIC X.
          20 B-MRO-RR-INDICATOR PIC X.
          20 B-MRO-TERR-MULT PIC 99V999.
          20 B-MRO-MULT-EXP PIC 9(7).
          20 B-MRO-TBL-RATE PIC 9(5)V99.
          20 B-MRO-SEC-DSCT PIC 9(5)V99.
          20 B-MRO-MSG-BAG-DSCT PIC 9(5)V99.
          20 B-MRO-PC-DSCT PIC 9(5)V99.
          20 B-MRO-RR-DSCT PIC 9(5)V99.
          20 B-MRO-PMOD-RATE PIC 9(5)V99.
          20 B-MRO-ADJ-RATE-1 PIC 9(5)V99.
          20 B-MRO-ADJ-RATE-2 PIC 9(5)V99.
          20 B-MRO-ADJ-RATE PIC 9(5)V99.
          20 B-MRO-BASIC-PREM PIC 9(7).
          20 B-MRO-FINAL-PREM PIC 9(7).
          20 B-MRO-PREMIUM PIC 9(7).
      15 B-MRO-3YR-PREMIUM PIC 9(7).
      15 B-MRO-ANNUAL-DPP PIC 9(7).
    10 B-IK-NO-BEDROOMS OCCURS 5 PIC 9(4).
    10 B-IK-POLICY-INCR OCCURS 5 PIC 9(9).
    10 B-IK-EXCLUSIONS OCCURS 5 PIC 9(6).
    10 B-IK-EXCLUDES.
      15 B-IK-EXCLS OCCURS 5.
        20 B-IK-EXCL OCCURS 6 PIC X.
    10 B-IK-EXCLUDE REDEFINES B-IK-EXCLUDES.
      15 B-IK-EXCLUD OCCURS 5.
        20 B-IK-EXCL-1 PIC X.
        20 B-IK-EXCL-2 PIC X.
        20 B-IK-EXCL-3 PIC X.
        20 B-IK-EXCL-4 PIC X.
        20 B-IK-EXCL-5 PIC X.
        20 B-IK-EXCL-6 PIC X.
    10 B-IK-BASE-PREMIUM OCCURS 5 PIC 9(7).
    10 B-IK-ADJ-PREMIUM OCCURS 5 PIC 9(7).
    10 B-IK-MP-SW OCCURS 5 PIC X.
    10 B-IK-PI-RATE OCCURS 5 PIC 9(5)V99.
    10 B-IK-PI-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E1-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E2-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E3-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E4-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E5-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-DSCTD-PREMIUM OCCURS 5 PIC 9(7).
    10 B-IK-3YR-PREMIUM OCCURS 5 PIC 9(7).
    10 B-IK-ANNUAL-DPP OCCURS 5 PIC 9(7).
    10 B-ET-TYPE-COVERAGE OCCURS 5 PIC 9.
    10 B-ET-NO-EMPLOYEES OCCURS 5 PIC 99.
    10 B-ET-GROUP-AMOUNT OCCURS 5 PIC 9(9).
    10 B-ET-RATE OCCURS 5 PIC 9(7).
    10 B-ET-ADJ-RATE OCCURS 5 PIC 9(7).
    10 B-ET-INDIVIDUAL-LIMITS.
      15 B-ET-INDIV-LIMIT OCCURS 5.
        20 B-ET-LIMIT OCCURS 20 PIC 9(9).
    10 B-ET-INDIV-LIM REDEFINES B-ET-INDIVIDUAL-LIMITS.
      15 B-ET-IND-LIM OCCURS 5.
        20 B-ET-LIMIT-1 PIC 9(9).
        20 B-ET-LIMIT-2 PIC 9(9).
        20 B-ET-LIMIT-3 PIC 9(9).
        20 B-ET-LIMIT-4 PIC 9(9).
        20 B-ET-LIMIT-5 PIC 9(9).
        20 B-ET-LIMIT-6 PIC 9(9).
        20 B-ET-LIMIT-7 PIC 9(9).
        20 B-ET-LIMIT-8 PIC 9(9).
        20 B-ET-LIMIT-9 PIC 9(9).
        20 B-ET-LIMIT-10 PIC 9(9).
        20 B-ET-LIMIT-11 PIC 9(9).
        20 B-ET-LIMIT12 PIC 9(9).
        20 B-ET-LIMIT-13 PIC 9(9).
        20 B-ET-LIMIT-14 PIC 9(9).
        20 B-ET-LIMIT-15 PIC 9(9).
        20 B-ET-LIMIT-16 PIC 9(9).
        20 B-ET-LIMIT-17 PIC 9(9).
        20 B-ET-LIMIT-18 PIC 9(9).
        20 B-ET-LIMIT-19 PIC 9(9).
        20 B-ET-LIMIT-20 PIC 9(9).
    10 B-ET-MOD-RATE OCCURS 5 PIC 9(7).
    10 B-ET-BASIC-PREMIUM OCCURS 5 PIC 9(7).
    10 B-ET-MP-SW OCCURS 5 PIC X.
    10 B-ET-3YR-PREMIUM OCCURS 5 PIC 9(7).
    10 B-ET-ANNUAL-DPP OCCURS 5 PIC 9(7).
    10 B-CH-OPTION OCCURS 5 PIC 9.
    10 B-CH-INS-AMOUNT OCCURS 5 PIC 9(9).
    10 B-CH-MS-AMOUNT OCCURS 5 PIC 9(9).
    10 B-CH-PP-AMOUNT OCCURS 5 PIC 9(9).
    10 B-CH-MS-OPTION OCCURS 5 PIC X.
    10 B-CH-PP-OPTION OCCURS 5 PIC X.
    10 B-CH-BASIC-PREMIUM OCCURS 5 PIC 9(7).
    10 B-CH-ADJ-PREMIUM OCCURS 5 PIC 9(7).
    10 B-CH-MP-SW OCCURS 5 PIC X.
    10 B-CH-PREMIUM OCCURS 5 PIC 9(7).
    10 B-CH-MS-SURCHG OCCURS 5 PIC 9(7).
    10 B-CH-ADJ-MS-SURCHG OCCURS 5 PIC 9(7).
    10 B-CH-PP-SURCHG OCCURS 5 PIC 9(7).
    10 B-CH-ADJ-PP-SURCHG OCCURS 5 PIC 9(7).
    10 B-CH-3YR-PREMIUM OCCURS 5 PIC 9(7).
    10 B-CH-ANNUAL-DPP OCCURS 5 PIC 9(7).
    10 SEC-BRG-END-ITEM PIC X.
 03 SECTION-TWO-BILL PIC X(40000).
 03 SECTWOBILL REDEFINES SECTION-TWO-BILL.
  05 SEC-TWO-COM-MAP.
    10 CLS-CDE-CTL-BLK OCCURS 30.
      15 COVERAGE-SWITCHES.
        20 S2-BASE PIC X.
        20 S2-DPDCOVSW PIC X.
        20 S2-XCUCOVSW PIC X.
        20 S2-WATEREXC PIC X.
        20 S2-LESSORSW PIC X.
        20 S2-VENDORSW PIC X.
        20 S2-ARCHSW PIC X.
        20 S2-EMPSW PIC X.
        20 S2-GOVALLSW PIC X.
        20 S2-GOVOCPSW PIC X.
        20 S2-COMPSW PIC X.
        20 S2-KULAS-PRV PIC X.
      15 DATA-SWITCHS.
        20 BASE.
          25 S2-TERSW PIC X.
          25 S2-CLASSW PIC X.
          25 S2-BIRATESW PIC X.
          25 S2-BIMINSW PIC X.
          25 S2-PDRATESW PIC X.
          25 S2-PDMINSW PIC X.
          25 S2-EXPOSESW PIC X.
        20 DPD.
          25 S2-DPDYNSW PIC X.
          25 S2-DEDAMTSW PIC X.
          25 S2-DEDTYPSW PIC X.
        20 XCU.
          25 S2-XCUSW PIC X.
        20 WATER.
          25 S2-WATERSW PIC X.
        20 LESSOR.
          25 S2-QUALIFY PIC X.
        20 VENDOR.
          25 S2-VENDTYPE PIC X.
          25 S2-VBASESW PIC X.
        20 ARCH.
          25 S2-ARCHCOVG PIC X.
        20 EMP.
          25 S2-EMPCOVG PIC X.
        20 GOVA.
          25 S2-GOVUSESW PIC X.
          25 S2-GOVNOSW PIC X.
          25 S2-GOVALLCV PIC X.
        20 GOVO.
          25 S2-GOVOCPCV PIC X.
          25 S2-OCPBASW PIC X.
        20 CPL.
          25 S2-ACRESW PIC X.
      15 DATA-ELEMENTS.
        20 BASE.
          25 S2-STATE PIC 99.
          25 S2-AREA PIC 99.
          25 S2-CLASS PIC X(12).
          25 S2-CLASSX PIC X(12).
          25 S2-BIRATE PIC 9(4)V9(4).
          25 S2-BIMIN PIC 9(4)V9(4).
          25 S2-PDRATE PIC 9(4)V9(4).
          25 S2-PDMIN PIC 9(4)V9(4).
          25 S2-PREMBASE PIC 9(12).
        20 DPD.
          25 S2-DPD PIC X.
          25 S2-DEDUCT PIC 9(4).
          25 S2-DEDTYPE PIC X.
        20 XCU.
          25 S2-XCU PIC X.
        20 WATER.
          25 S2-WATER PIC X.
        20 LESSOR.
          25 S2-LESSOR PIC X.
          25 S2-LESS50 PIC V99.
        20 VENDOR.
          25 S2-VENDOR PIC X.
          25 S2-VENDBASE PIC 9(8).
        20 ARCH.
          25 S2-INTARCH PIC X.
        20 EMP.
          25 S2-INTEMP PIC X.
        20 GOVA.
          25 S2-GOVUSE PIC X.
          25 S2-GOVNUMB PIC 99.
          25 S2-GOVTALL PIC X.
        20 GOVO.
          25 S2-GOVTOCP PIC X.
          25 S2-OCPBASE PIC 99.
        20 CPL.
          25 S2-CPACRES PIC X.
      15 INDICATIVE-INFORMATION.
        20 BASE.
          25 S2-FILECODE PIC 99.
          25 S2-PRMBASE PIC 99.
          25 S2-DESCRIBE PIC X(60).
          25 S2-RATEKEY PIC 99.
          25 S2-FACTOR PIC 9(9).
          25 S2-UNIT PIC 9(7)V99.
          25 S2-MINKEY PIC 99.
          25 S2-MINSAVEBI-LOC PIC 9(3)V99.
          25 S2-MINSAVEBI-POL PIC 9(3)V99.
          25 S2-MINSAVEPD-LOC PIC 9(3)V99.
          25 S2-MINSAVEPD-POL PIC 9(3)V99.
          25 S2-XCU-BI-RATE PIC 9V9(3).
          25 S2-XCU-BI-PREM PIC 9(3)V99.
          25 S2-XCU-PD-RATE PIC 9V9(3).
          25 S2-XCU-PD-PREM PIC 9(3)V99.
        20 DPD.
          25 S2-DEDRATE PIC V99.
        20 XCU.
          25 S2-BIXCURAT PIC 9V999.
          25 S2-BIXCUMIN PIC 999V99.
          25 S2-PDXCURAT PIC 9V999.
          25 S2-PDXCUMIN PIC 999V99.
        20 WATER.
          25 S2-WATER80 PIC V99.
          25 S2-WATRPREM PIC V999.
        20 VENDOR.
          25 S2-VPERCENT PIC V99.
          25 S2-VEND100 PIC 9(3).
          25 S2-VENDUNIT PIC 9(7).
        20 ARCH.
          25 S2-ARCH10 PIC V99.
        20 EMP.
          25 S2-EMP10 PIC V99.
        20 GOVA.
          25 S2-GOVALLBI PIC 9V99.
          25 S2-GOVALLPD PIC 9V99.
             20 GOVO.
          25 S2-GOVOCPBI PIC V99.
          25 S2-GOVOCPPD PIC V99.
        20 CPL.
          25 S2-ACRECHG PIC 9V99.
          25 S2-PERATE PIC 99V99.
        20 INCRLIM.
          25 S2-INCRLIMA-BI PIC 9V99.
          25 S2-INCRLIMB-BI PIC 9V99.
          25 S2-INCRLIMA-PD PIC 9V99.
          25 S2-INCRLIMB-PD PIC 9V99.
    10 OTH-CTL-WRD.
      15 SUBSCRIPTS.
        20 SUB1 PIC 99.
        20 Q REDEFINES SUB1 PIC 99.
      15 FOUNDATION.
        20 S2-FOUND PIC X.
        20 S2-PDSWITCH PIC X.
        20 S2-BISWITCH PIC X.
        20 S2-PDOCCUR PIC 9(8).
        20 S2-BIOCCUR PIC 9(8).
        20 S2-BIAGGR PIC 9(8).
        20 S2-PDAGGR PIC 9(8).
      15 OTHER.
        20 S2-OTHERSW PIC X.
        20 OTHER.
          25 S2-OTHERCVG PIC X.
          25 S2-INTOTHER PIC X.
          25 S2-OTHER10 PIC V99.
      15 INJURY.
        20 S2-INJURYSW PIC X.
        20 INJURY.
          25 S2-PINJURY PIC X.
          25 S2-PERSINJ PIC X.
          25 S2-INJURY15 PIC V99.
      15 MED.
        20 S2-MEDPAYSW PIC X.
        20 MED.
          25 S2-MEDICAL PIC X.
          25 S2-MEDLIMSW PIC X.
          25 S2-MEDPAY PIC X.
          25 S2-MEDLIMP PIC 9(4).
          25 S2-MEDLIMA PIC 9(5).
          25 S2-MEDMA1 PIC 9V999.
          25 S2-MEDMB1 PIC 9V999.
          25 S2-MEDMA2 PIC 9V999.
          25 S2-MEDMB2 PIC 9V999.
          25 S2-MEDMA3 PIC 9V999.
          25 S2-MEDMB3 PIC 9V999.
          25 S2-MEDMA4 PIC 9V999.
          25 S2-MEDMB4 PIC 9V999.
          25 S2-MINMA1 PIC 99V99.
          25 S2-MINMB1 PIC 99V99.
          25 S2-MINMA2 PIC 99V99.
          25 S2-MINMB2 PIC 99V99.
          25 S2-MINMA3 PIC 99V99.
          25 S2-MINMB3 PIC 99V99.
          25 S2-MINMA4 PIC 99V99.
          25 S2-MINMB4 PIC 99V99.
      15 CLP.
          25 S2-CPLSW PIC X.
          25 S2-PERLIMSW PIC X.
          25 S2-CPLLIM PIC 9(6).
          25 S2-PERLIM PIC 9(4).
  05 SAM-DATA.
    10 DUMMY.
      15 S2-OTHER-BODY-PREM PIC 9(6)V9(2).
      15 S2-OTHER-PROP-PREM PIC 9(6)V9(2).
      15 S2-PI-ONLY-PREM PIC 9(6)V9(2).
      15 S2-MED-ONLY-PREM PIC 9(6)V9(2).
    10 RATE-TABLE OCCURS 30.
      15 S2-EMP-BODY-PREM PIC 9(6)V9(2).
      15 S2-EMP-PROP-PREM PIC 9(6)V9(2).
      15 S2-ARC-BODY-PREM PIC 9(6)V9(2).
      15 S2-ARC-PROP-PREM PIC 9(6)V9(2).
      15 S2-VEND-BODY-PREM PIC 9(6)V9(2).
      15 S2-VEND-PROP-PREM PIC 9(6)V9(2).
      15 S2-OCP-BODY-PREM PIC 9(6)V9(2).
      15 S2-OCP-PROP-PREM PIC 9(6)V9(2).
      15 S2-GOVALL-BODY-PREM PIC 9(6)V9(2).
      15 S2-GOVALL-PROP-PREM PIC 9(6)V9(2).
      15 S2-CPL-ONLY-PREM PIC 9(6)V9(2).
      15 S2-BODILY-PREM PIC 9(6)V9(2).
      15 S2-PROP-PREM PIC 9(6)V9(2).
      15 S2-EMPBIPRM PIC 9(6)V9(2).
      15 S2-EMPPDPRM PIC 9(6)V9(2).
    10 ABC.
      15 SECTION2-TOTAL PIC 9(6)V99.
      15 S2-GROUPA PIC 9(4)V9(4).
      15 S2-GROUPB PIC 9(4)V9(4).
      15 S2-GROUPC PIC 9(4)V9(4).
      15 S2-GROUPD PIC 9(4)V9(4).
      15 S2-GROUPE PIC 9(4)V9(4).
      15 S2-GROUPF PIC 9(4)V9(4).
      15 S2-GROUPG PIC 9(4)V9(4).
      15 S2-GROUPH PIC 9(4)V9(4).
      15 S2-OTHBIPRM PIC 9(6)V9(2).
      15 S2-OTHPDPRM PIC 9(6)V9(2).
      15 DUMM OCCURS 30.
        20 S2-BIRATE9 PIC 9(6)V9(2).
        20 S2-PDRATE9 PIC 9(6)V9(2).
        20 S2-MOD1 PIC 9V9(3).
        20 S2-MOD2 PIC 9V9(3).
        20 S2-MOD3 PIC 9V9(3).
        20 S2-ARCBIPRM PIC 9(6)V9(2).
        20 S2-ARCPDPRM PIC 9(6)V9(2).
        20 S2-OCPPRMPD PIC 9V9(2).
        20 S2-OCPPRMBI PIC 9(6)V9(2).
        20 S2-GOVPRMBI PIC 9(6)V9(2).
        20 S2-GOVPRMPD PIC 9(6)V9(2).
        20 S2-VNDPRMBI PIC 9(6)V9(2).
        20 S2-VNDPRMPD PIC 9(6)V9(2).
        20 S2-WORKBI PIC 9(4)V9(4).
        20 S2-WORKPD PIC 9(4)V9(4).
        20 S2-CPLPREM PIC 9(6)V9(2).
      15 DUMDUM.
        20 S2-PIPREM PIC 9(6)V9(2).
        20 S2-MEDPREM PIC 9(6)V9(2).
        20 S2-BIRESULT PIC 9(3)V9(1).
        20 S2-PDRESULT PIC 9(3)V9(1).
        20 S2-CHARGE5 PIC 9(1).
        20 S2-CNTR PIC 99.
        20 S2-BIFLAT PIC 9(6)V9(2).
        20 S2-PDFLAT PIC 9(6)V9(2).
        20 S2-PROMPTS PIC X(20).
        20 S2-BIGSW PIC X.
    10 BLANKET-CONTR-LIAB.
      15 SWITCHES.
        20 S2-BLANKCVG PIC X.
        20 S2-BLANKSW PIC X.
      15 DATA-ITEMS.
        20 S2-BLANKET PIC X.
        20 S2-BLANKET10 PIC V99.
        20 S2-BLNK-BODY-PREM PIC 9(6)V99.
        20 S2-BLNK-PROP-PREM PIC 9(6)V99.
    10 S2-INTER-RESULTS OCCURS 30.
      15 S2-BIRATE8 PIC 9(4)V9(4).
      15 S2-PDRATE8 PIC 9(4)V9(4).
      15 S2-BIRATE4 PIC 9(4)V9(4).
      15 S2-PDRATE4 PIC 9999V9999.
      15 S2-BIRATE5 PIC 9999V9999.
      15 S2-PDRATE5 PIC 9999V9999.
      15 S2-CPLRATE2 PIC 9999V9999.
      15 S2-CPLRATE3 PIC 9999V9999.
      15 S2-CPLRATE4 PIC 999V9999.
      15 S2-CPLRATE6 PIC 9999V9999.
    10 CONCESSIONAIRES OCCURS 30.
      15 S2-CONCESCVG PIC X.
      15 S2-CONCESW PIC X.
      15 S2-CONCES PIC X.
      15 S2-CONCES25 PIC V99.
    10 PROFESSIONAL-LIABILITY-LIMITS.
      15 S2-DRUGLIMCVG PIC X.
      15 S2-DRUGLIMSW PIC X.
      15 S2-DRUGOCCUR PIC 9(8).
      15 S2-DRUGAGGR PIC 9(8).
      15 S2-DENTLIMCVG PIC X.
      15 S2-DENTLIMSW PIC X.
      15 S2-DENTOCCUR PIC 9(8).
      15 S2-NTAGGR PIC 9(8).
      15 S2-VETLIMCVG PIC X.
      15 S2-VETLIMSW PIC X.
      15 S2-VETOCCUR PIC 9(8).
      15 S2-VETAGGR PIC 9(8).
      15 S2-OPTLIMCVG PIC X.
      15 S2-OPTLIMSW PIC X.
      15 S2-OPTOCCUR PIC 9(8).
      15 S2-OPTAGGR PIC 9(8).
      15 S2-MORTLIMCVG PIC X.
      15 S2-MORTLIMSW PIC X.
      15 S2-MORTOCCUR PIC 9(8).
      15 S2-MORTAGGR PIC 9(8).
      15 S2BEAUTLIMCVG PIC X.
      15 S2-BEAUTLIMSW PIC X.
      15 S2-BEAUTOCCUR PIC 9(8).
      15 S2-BEAUTAGGR PIC 9(8).
      15 S2-WIGLIMCVG PIC X.
      15 S2-WIGLIMSW PIC X.
      15 S2-WIGOCCUR PIC 9(8).
      15 S2-WIGAGGR PIC 9(8).
    10 CONCESSIONAIRES-CALC OCCURS 30.
      15 S2-CONBIPRM PIC 9(6)V99.
      15 S2-CON-BODY-PREM PIC 9(6)V99.
    10 SEC-2-END-ITEM PIC X.
PROCEDURE DIVISION USING COMMON-AREA, WKS-SECT, Q-A-REC.
010-START.
    DISPLAY 'GOT-QUOTR2     KEY-GO-TO IS ' KEY-GO-TO.
    SUBTRACT 140 FROM KEY-GO-TO GIVING KEYGOTO.
    GO TO P141, P142, P143, P144, P145, P146, P147, P148, P149, P150,
    P151, P152, P153, P154, P155, P156, P157, P158, P159, P160,
    P161, P162, P163, P164, P165, P166, P167, P168, P169, P170,
    P171, P172, P173, P174, P175, P176, P177, P178, P179, P180,
    P181, P182, P183, P184, P185, P186, P187, P188, P189, P190,
    P191, P192, P193, P194, P195, P196, P197, P198, P199, P200,
    P201, P202, P203, P204, P205, P206, P207, P208, P209, P210,
    P211, P212, P213, P214, P215, P216, P217, P218, P219, P220,
    P221, P222, P223, P224, P225, P226, P227, P228, P229, P230,
    P231, P232, P233, P234, P235, P236, P237, P238, P239, P240,
    P241, P242, P243, P244, P245, P246, P247, P248, P249, P250,
    P251, P252, P253, P254, P255, P256, P257, P258, P259, P260,
    P261, P262, P263, P264, P265, P266, P267, P268, P269, P270,
    P271, P272, P273, P274, P275, P276, P277, P278, P279, P280,
    P281 DEPENDING ON KEYGOTO.
P141.
    IF CHG-SW > 8 GO TO P141A.
    MOVE NUM-GRP-TYPE TO  B-MRI-GUARDS-INDICATOR (COM-S).
    MOVE 9 TO B-MR-106-SW  (COM-S).
P141A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P141B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P141B.
    MOVE 9 TO S1-MR-COV-SW  (COM-S).
    GO TO P-EXIT.
P142.
    IF CHG-SW > 8 GO TO P142A.
    MOVE F-TYPE TO B-MRI-PBA-INDICATOR (COM-S).
    MOVE 9 TO B-MR-107-SW  (COM-S).
P142A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P142B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P142B.
    MOVE 9 TO S1-MR-COV-SW  (COM-S).
    GO TO P-EXIT.
P143.
    IF CHG-SW > 8 GO TO P143A.
    MOVE F-TYPE TO B-MRI-HAPS-INDICATOR (COM-S).
    MOVE 9 TO B-MR-108-SW  (COM-S).
P143A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P143B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P143B.
    MOVE 9 TO S1-MR-COV-SW (COM-S).
    GO TO P-EXIT.
P144. GO TO P-EXIT.
P145.
    IF CHG-SW > 8 GO TO P145A.
    MOVE NUM-GRP-TYPE TO  B-MRO-MESSENGERS (COM-S).
    MOVE 9 TO B-MR-201-SW  (COM-S).
P145A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P145B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P145B.
    MOVE 9 TO S1-MR-COV-SW (COM-S).
    GO TO P-EXIT.
P146.
    IF CHG-SW > 8 GO TO P146A.
    MOVE NUM-GRP-TYPE TO  B-MRO-NO-GUARDS  (COM-S BMSGR).
    MOVE 9 TO B-MR-202-SW  (COM-S BMSGR).
P146A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P146B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P146B.
    MOVE 9 TO S1-MR-COV-SW (COM-S).
    GO TO P-EXIT.
P147.
    IF CHG-SW > 8 GO TO P147A.
    MOVE NUM-GRP-TYPE TO  B-MRO-INS-AMOUNT (COM-S BMSGR).
    MOVE 9 TO B-MR-203-SW  (COM-S BMSGR).
P147A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P147B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P147B.
    MOVE 9 TO S1-MR-COV-SW (COM-S).
    GO TO P-EXIT.
P148.
    IF CHG-SW > 8 GO TO P148A.
    MOVE F-TYPE TO B-MRO-BSSW-INDICATOR (COM-S BMSGR).
    MOVE 9 TO B-MR-204-SW  (COM-S BMSGR).
P148A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P148B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P148B.
    MOVE 9 TO S1-MR-COV-SW (COM-S).
    GO TO P-EXIT.
P149.
    IF CHG-SW > 8 GO TO P149A.
    MOVE A-TYPE-40    TO B-MRO-BSSW-CLASS (COM-S BMSGR).
    MOVE 9 TO B-MR-205-SW  (COM-S BMSGR).
P149A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P149B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P149B.
    MOVE 9 TO S1-MR-COV-SW (COM-S).
    GO TO P-EXIT.
P150.
    IF CHG-SW > 8 GO TO P150A.
    MOVE F-TYPE TO B-MRO-PC-INDICATOR   (COM-S BMSGR).
    MOVE 9 TO B-MR-206-SW  (COM-S BMSGR).
P150A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P150B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P150B.
    MOVE 9 TO S1-MR-COV-SW (COM-S).
    GO TO P-EXIT.
P151.
    IF CHG-SW > 8 GO TO P151A.
    MOVE F-TYPE TO B-MRO-RR-INDICATOR   (COM-S BMSGR).
    MOVE 9 TO B-MR-207-SW  (COM-S BMSGR).
P151A.
    IF S1-MR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW  (COM-S)    NOT = 7 GO TO P151B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P151B.
    MOVE 9 TO S1-MR-COV-SW (COM-S).
    GO TO P-EXIT.
P152. GO TO P-EXIT.
P153.
    IF CHG-SW > 8 GO TO P153A.
    MOVE F-TYPE TO B-BF-IP-COVERAGE (COM-S).
    MOVE 9 TO B-BF-001-SW  (COM-S).
P153A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P153B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P153B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P154.
    IF CHG-SW > 8 GO TO P154A.
    MOVE F-TYPE TO B-BF-OP-COVERAGE (COM-S).
    MOVE 9 TO B-BF-002-SW  (COM-S).
P154A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P154B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P154B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P155.
    IF CHG-SW > 8 GO TO P155A.
    MOVE F-TYPE TO B-BF-AV-COVERAGE (COM-S).
    MOVE 9 TO B-BF-003-SW  (COM-S).
P155A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P155B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P155B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P156.
    IF CHG-SW > 8 GO TO P156A.
    MOVE F-TYPE TO B-BF-SEC-INDICATOR (COM-S).
    MOVE 9 TO B-BF-004-SW  (COM-S).
P156A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P156B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P156B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P157. GO TO P-EXIT.
P158.
    IF CHG-SW > 8 GO TO P158A.
    MOVE NUM-GRP-TYPE TO  B-BFI-INS-AMOUNT (COM-S).
    MOVE 9 TO B-BF-101-SW  (COM-S).
P158A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P158B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P158B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P159.
    IF CHG-SW > 8 GO TO P159A.
    MOVE A-TYPE-40    TO B-BFI-SAFE-CLASS (COM-S).
    MOVE 9 TO B-BF-103-SW  (COM-S).
P159A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P159B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P159B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P160.
    IF CHG-SW > 8 GO TO P160A.
    MOVE A-TYPE-40    TO B-BFI-TGS-INDICATOR (COM-S).
    MOVE 9 TO B-BF-104-SW  (COM-S).
P160A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P160B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P160B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P161.
    IF CHG-SW > 8 GO TO P161A.
    MOVE F-TYPE TO B-BFI-WMN-INDICATOR (COM-S).
    MOVE 9 TO B-BF-105-SW  (COM-S).
P161A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P161B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P161B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P162.
    IF CHG-SW > 8 GO TO P162A.
    MOVE NUM-GRP-TYPE TO B-BFI-WMN-CLASS-A (COM-S).
    MOVE 9 TO B-BF-106-SW  (COM-S).
P162A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P162B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P162B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P163.
    IF CHG-SW > 8 GO TO P163A.
    MOVE NUM-GRP-TYPE TO B-BFI-WMN-CLASS-B (COM-S).
    MOVE 9 TO B-BF-107-SW  (COM-S).
P163A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P163B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P163B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P164.
    IF CHG-SW > 8 GO TO P164A.
    MOVE NUM-GRP-TYPE TO B-BFI-WMN-CLASS-C (COM-S).
    MOVE 9 TO B-BF-108-SW  (COM-S).
P164A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P164B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P164B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P165.
    IF CHG-SW > 8 GO TO P165A.
    MOVE NUM-GRP-TYPE TO B-BFI-WMN-CLASS-D (COM-S).
*   MOVE 9 TO B-BF-109-SW  (COM-S).
P165A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P165B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P165B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P166.
    IF CHG-SW > 8 GO TO P166A.
    MOVE NUM-GRP-TYPE TO B-BFI-WMN-CLASS-E (COM-S).
    MOVE 9 TO B-BF-110-SW  (COM-S).
P166A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P166B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P166B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P167.
    IF CHG-SW > 8 GO TO P167A.
    MOVE NUM-GRP-TYPE TO B-BFI-WMN-CLASS-F (COM-S).
    MOVE 9 TO B-BF-111-SW  (COM-S).
P167A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P167B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P167B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P168.
    IF CHG-SW > 8 GO TO P168A.
    MOVE F-TYPE TO B-BFI-GUARDS-IND (COM-S).
    MOVE 9 TO B-BF-112-SW  (COM-S).
P168A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P168B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P168B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P169.
    IF CHG-SW > 8 GO TO P169A.
    MOVE NUM-GRP-TYPE TO B-BFI-FT-GUARDS (COM-S).
    MOVE 9 TO B-BF-113-SW  (COM-S).
P169A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P169B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P169B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P170.
    IF CHG-SW > 8 GO TO P170A.
    MOVE F-TYPE TO B-BFI-PBA-INDICATOR (COM-S).
    MOVE 9 TO B-BF-114-SW (COM-S).
P170A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P170B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P170B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P171.
    IF CHG-SW > 8 GO TO P171A.
    MOVE F-TYPE TO B-BFI-HAPS-INDICATOR (COM-S).
    MOVE 9 TO B-BF-115-SW (COM-S).
P171A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P171B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P171B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P172.
    IF CHG-SW > 8 GO TO P172A.
    MOVE F-TYPE TO B-BFI-BAS-INDICATOR (COM-S).
    MOVE 9 TO B-BF-116-SW (COM-S).
P172A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P172B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P172B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P173.
    IF CHG-SW > 8 GO TO P173A.
    MOVE A-TYPE-40    TO B-BFI-BAS-DATA (COM-S).
    MOVE 9 TO B-BF-117-SW (COM-S).
P173A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P173B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P173B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P174. GO TO P-EXIT.
P175.
    IF CHG-SW > 8 GO TO P175A.
    MOVE NUM-GRP-TYPE TO B-BFO-NO-MSGRS (COM-S).
    MOVE 9 TO B-BF-201-SW (COM-S).
P175A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P175B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P175B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P176.
    IF CHG-SW > 8 GO TO P176A.
    MOVE NUM-GRP-TYPE TO B-BFO-MSGR-GUARDS (COM-S BMSGR).
    MOVE 9 TO B-BF-202-SW (COM-S BMSGR).
P176A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P176B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P176B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P177.
    IF CHG-SW > 8 GO TO P177A.
    MOVE NUM-GRP-TYPE TO B-BFO-INS-AMOUNT  (COM-S BMSGR).
    MOVE 9 TO B-BF-203-SW (COM-S BMSGR).
P177A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P177B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P177B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P178.
    IF CHG-SW > 8 GO TO P178A.
    MOVE F-TYPE TO B-BFO-PC-INDICATOR (COM-S BMSGR).
    MOVE 9 TO B-BF-204-SW (COM-S BMSGR).
P178A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P178B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P178B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P179.
    IF CHG-SW > 8 GO TO P179A.
    MOVE F-TYPE TO B-BFO-MSGR-BAG-IND (COM-S BMSGR).
    MOVE 9 TO B-BF-205-SW (COM-S BMSGR).
P179A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P179B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P179B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P180.
    IF CHG-SW > 8 GO TO P180A.
    MOVE A-TYPE-40    TO B-BFO-MSGR-BAG-CLASS (COM-S BMSGR).
    MOVE 9 TO B-BF-206-SW (COM-S BMSGR).
P180A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P180B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P180B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P181.
    IF CHG-SW > 8 GO TO P181A.
    MOVE F-TYPE TO B-BFO-RR-INDICATOR (COM-S BMSGR).
    MOVE 9 TO B-BF-207-SW (COM-S BMSGR).
P181A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P181B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P181B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P182. GO TO P-EXIT.
P183.
    IF CHG-SW > 8 GO TO P183A.
    MOVE NUM-GRP-TYPE TO B-BFA-VEHICLES (COM-S).
    MOVE 9 TO B-BF-301-SW  (COM-S).
P183A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P183B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P183B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P184.
    IF CHG-SW > 8 GO TO P184A.
    MOVE NUM-GRP-TYPE TO B-BFA-VEH-INSURANCE (COM-S BAMV).
    MOVE 9 TO B-BF-302-SW  (COM-S BAMV).
P184A.
    IF S1-BFMS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S)    NOT = 7 GO TO P184B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P184B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P185.
    IF CHG-SW > 8 GO TO P185A.
    MOVE NUM-GRP-TYPE TO B-BFS-INS-AMOUNT (COM-S).
    MOVE 9 TO B-BFS-01-SW  (COM-S).
P185A.
    IF S1-BFS-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-BFS-COV-SW (COM-S)    NOT = 7 GO TO P185B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P185B.
    MOVE 9 TO S1-BFS-COV-SW (COM-S).
    GO TO P-EXIT.
P186.
    IF CHG-SW > 8 GO TO P186A.
    MOVE NUM-GRP-TYPE TO B-SBR-INS-AMOUNT (COM-S).
    MOVE 9 TO B-SBR-01-SW  (COM-S).
P186A.
    IF S1-SBR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-SBR-COV-SW (COM-S)    NOT = 7 GO TO P186B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P186B.
    MOVE 9 TO S1-SBR-COV-SW (COM-S).
    GO TO P-EXIT.
P187.
    IF CHG-SW > 8 GO TO P187A.
    MOVE NUM-GRP-TYPE TO B-OBR-INS-AMOUNT (COM-S).
    MOVE 9 TO B-OBR-01-SW  (COM-S).
P187A.
    IF S1-OBR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-OBR-COV-SW (COM-S)    NOT = 7 GO TO P187B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P187B.
    MOVE 9 TO S1-OBR-COV-SW (COM-S).
    GO TO P-EXIT.
P188.
    IF CHG-SW > 8 GO TO P188A.
    MOVE F-TYPE TO B-OBR-MSD-COVERAGE (COM-S).
    MOVE 9 TO B-OBR-02-SW  (COM-S).
P188A.
    IF S1-OBR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-OBR-COV-SW (COM-S)    NOT = 7 GO TO P188B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P188B.
    MOVE 9 TO S1-OBR-COV-SW (COM-S).
    GO TO P-EXIT.
P189.
    IF CHG-SW > 8 GO TO P189A.
    MOVE NUM-GRP-TYPE TO B-OBR-MSD-AMOUNT (COM-S).
    MOVE 9 TO B-OBR-03-SW  (COM-S).
P189A.
    IF S1-OBR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-OBR-COV-SW (COM-S)    NOT = 7 GO TO P189B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P189B.
    MOVE 9 TO S1-OBR-COV-SW (COM-S).
    GO TO P-EXIT.
P190.
    IF CHG-SW > 8 GO TO P190A.
    MOVE F-TYPE TO B-OBR-MSD-MEDIA  (COM-S).
    MOVE 9 TO B-OBR-04-SW  (COM-S).
P190A.
    IF S1-OBR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-OBR-COV-SW (COM-S)    NOT = 7 GO TO P190B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P190B.
    MOVE 9 TO S1-OBR-COV-SW (COM-S).
    GO TO P-EXIT.
P191.
    IF CHG-SW > 8 GO TO P191A.
    MOVE F-TYPE TO B-OBR-MSD-SEC-ONLY (COM-S).
    MOVE 9 TO B-OBR-05-SW  (COM-S).
P191A.
    IF S1-OBR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-OBR-COV-SW (COM-S)    NOT = 7 GO TO P191B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P191B.
    MOVE 9 TO S1-OBR-COV-SW (COM-S).
    GO TO P-EXIT.
P192.
    IF CHG-SW > 8 GO TO P192A.
    MOVE F-TYPE TO B-OBR-PSD-COVERAGE (COM-S).
    MOVE 9 TO B-OBR-06-SW  (COM-S).
P192A.
    IF S1-OBR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-OBR-COV-SW (COM-S)    NOT = 7 GO TO P192B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P192B.
    MOVE 9 TO S1-OBR-COV-SW (COM-S).
    GO TO P-EXIT.
P193.
    IF CHG-SW > 8 GO TO P193A.
    MOVE NUM-GRP-TYPE TO B-OBR-PSD-PEOPLE (COM-S).
    MOVE 9 TO B-OBR-07-SW  (COM-S).
P193A.
    IF S1-OBR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-OBR-COV-SW (COM-S)    NOT = 7 GO TO P193B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P193B.
    MOVE 9 TO S1-OBR-COV-SW (COM-S).
    GO TO P-EXIT.
P194.
    IF CHG-SW > 8 GO TO P194A.
    MOVE NUM-GRP-TYPE TO B-OBR-PSD-AMOUNT (COM-S BPPL).
    MOVE 9 TO B-OBR-08-SW  (COM-S BPPL).
P194A.
    IF S1-OBR-COV-SW (COM-S)    < 5 GO TO P-EXIT.
    IF S1-OBR-COV-SW (COM-S)    NOT = 7 GO TO P194B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P194B.
    MOVE 9 TO S1-OBR-COV-SW (COM-S).
    GO TO P-EXIT.
P195.
    IF CHG-SW > 8 GO TO P195A.
    MOVE NUM-GRP-TYPE    TO BRG-PKG-MOD-1    (COM-S).
    MOVE 9 TO B-BMON04-SW  (COM-S).
P195A.
    IF S1-BURGLARY-SW (COM-S)   < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P195B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P195B.
    MOVE 9 TO S1-BURGLARY-SW    (COM-S).
    GO TO P-EXIT.
P196.
    IF CHG-SW > 8 GO TO P196A.
    MOVE NUM-GRP-TYPE    TO BRG-PKG-MOD-2    (COM-S).
    MOVE 9 TO B-BMON05-SW  (COM-S).
P196A.
    IF S1-BURGLARY-SW (COM-S)   < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P196B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P196B.
    MOVE 9 TO S1-BURGLARY-SW    (COM-S).
    GO TO P-EXIT.
P197.
    IF CHG-SW > 8 GO TO P197A.
    MOVE NUM-GRP-TYPE    TO BRG-PKG-MOD-3    (COM-S).
    MOVE 9 TO B-BMON06-SW  (COM-S).
P197A.
    IF S1-BURGLARY-SW (COM-S)   < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P197B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P197B.
    MOVE 9 TO S1-BURGLARY-SW    (COM-S).
    GO TO P-EXIT.
P198.
    IF CHG-SW > 8 GO TO P198A.
    MOVE NUM-GRP-TYPE    TO BRG-TERR-CODE    (COM-S).
    MOVE 9 TO B-BMON07-SW  (COM-S).
P198A.
    IF S1-BURGLARY-SW (COM-S)   < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P198B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P198B.
    MOVE 9 TO S1-BURGLARY-SW    (COM-S).
    GO TO P-EXIT.
P199.
    IF CHG-SW > 8 GO TO P199A.
    MOVE F-TYPE    TO B-MOS-COV-SW    (COM-S).
    MOVE 9 TO B-MOS000-SW  (COM-S).
P199A.
    IF S1-MOS-COV-SW  (COM-S)   < 5 GO TO P-EXIT.
    IF S1-MOS-COV-SW  (COM-S) NOT = 7 GO TO P199B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P199B.
    MOVE 9 TO S1-MOS-COV-SW    (COM-S).
    GO TO P-EXIT.
P200.
    IF CHG-SW > 8 GO TO P200A.
    MOVE F-TYPE    TO B-MS-COV-SW    (COM-S).
    MOVE 9 TO B-MS0000-SW  (COM-S).
P200A.
    IF S1-MS-COV-SW   (COM-S)   < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW   (COM-S) NOT = 7 GO TO P200B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P200B.
    MOVE 9 TO S1-MS-COV-SW    (COM-S).
    GO TO P-EXIT.
P201.
    IF CHG-SW > 8 GO TO P201A.
    MOVE F-TYPE    TO B-MR-COV-SW    (COM-S).
    MOVE 9 TO B-MR0000-SW  (COM-S).
P201A.
    IF S1-MR-COV-SW   (COM-S)   < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW   (COM-S) NOT = 7 GO TO P201B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P201B.
    MOVE 9 TO S1-MR-COV-SW    (COM-S).
    GO TO P-EXIT.
P202.
    IF CHG-SW > 8 GO TO P202A.
    MOVE F-TYPE    TO B-BFMS-COV-SW    (COM-S).
    MOVE 9 TO B-BFMS00-SW  (COM-S).
P202A.
    IF S1-BFMS-COV-SW (COM-S)   < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S) NOT = 7 GO TO P202B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P202B.
    MOVE 9 TO S1-BFMS-COV-SW    (COM-S).
    GO TO P-EXIT.
P203.
    IF CHG-SW > 8 GO TO P203A.
    MOVE F-TYPE    TO B-BFS-COV-SW  (COM-S).
    MOVE 9 TO B-BFS000-SW  (COM-S).
P203A.
    IF S1-BFS-COV-SW  (COM-S)   < 5 GO TO P-EXIT.
    IF S1-BFS-COV-SW  (COM-S) NOT = 7 GO TO P203B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P203B.
    MOVE 9 TO S1-BFS-COV-SW    (COM-S).
    GO TO P-EXIT.
P204.
    IF CHG-SW > 8 GO TO P204A.
    MOVE F-TYPE    TO B-SBR-COV-SW  (COM-S).
    MOVE 9 TO B-SBR000-SW  (COM-S).
P204A.
    IF S1-SBR-COV-SW  (COM-S)   < 5 GO TO P-EXIT.
    IF S1-SBR-COV-SW  (COM-S) NOT = 7 GO TO P204B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P204B.
    MOVE 9 TO S1-SBR-COV-SW    (COM-S).
    GO TO P-EXIT.
P205.
    IF CHG-SW > 8 GO TO P205A.
    MOVE F-TYPE    TO B-OBR-COV-SW  (COM-S).
    MOVE 9 TO B-OBR000-SW  (COM-S).
P205A.
    IF S1-OBR-COV-SW  (COM-S)   < 5 GO TO P-EXIT.
    IF S1-OBR-COV-SW  (COM-S) NOT = 7 GO TO P205B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P205B.
    MOVE 9 TO S1-OBR-COV-SW    (COM-S).
    GO TO P-EXIT.
P206.
    IF CHG-SW > 8 GO TO P206A.
    MOVE F-TYPE    TO BURG-YN    (COM-S).
    MOVE 9 TO B-BMON08-SW  (COM-S).
P206A.
    IF S1-BURGLARY-SW (COM-S)   < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P206B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P206B.
    MOVE 9 TO S1-BURGLARY-SW    (COM-S).
    GO TO P-EXIT.
P207.    GO TO P-EXIT.
P208.    GO TO P-EXIT.
P209.
    IF CHG-SW > 8 GO TO P209A.
    MOVE A-TYPE-40    TO BURG-COV-INPUT (COM-S).
    MOVE 9 TO BURG-COV-INPUT-SW  (COM-S).
P209A.
    IF S1-BURGLARY-SW (COM-S)   < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P209B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P209B.
    MOVE 9 TO S1-BURGLARY-SW    (COM-S).
    GO TO P-EXIT.
P210.    GO TO P-EXIT.
P211.    GO TO P-EXIT.
P212.
    IF CHG-SW > 8 GO TO P212A.
    MOVE A-TYPE-40    TO BURG-COV-INPUT (COM-S).
    MOVE 9 TO BURG-COV-INPUT-SW (COM-S).
P212A.
    IF S1-BURGLARY-SW (COM-S)   < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P212B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P212B.
    MOVE 9 TO S1-BURGLARY-SW    (COM-S).
P213.
    IF CHG-SW > 8 GO TO P-EXIT.
    MOVE A-TYPE-40 TO S2-PROMPTS.
    MOVE 9 TO S2-BIGSW.
    GO TO P-EXIT.
P214.
    IF CHG-SW > 8 GO TO P214A.
    MOVE  NUM-GRP-TYPE    TO   S1-L-STA  (COM-S).
    MOVE 9 TO S1DS (50 COM-S).
P214A.
    IF S1-B-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-B-SW  (COM-S) NOT = 7 GO TO P214B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P214B.
    MOVE 9 TO S1-B-SW (COM-S).
    GO TO P-EXIT.
P215.
    IF CHG-SW > 8 GO TO P215A.
    MOVE  A-TYPE-40    TO   S1-LOCAD1 (COM-S).
    MOVE 9 TO S1DS (51 COM-S).
P215A.
    IF S1-B-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-B-SW  (COM-S) NOT = 7 GO TO P215B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P215B.
    MOVE 9 TO S1-B-SW (COM-S).
    GO TO P-EXIT.
P216.
    IF CHG-SW > 8 GO TO P216A.
    MOVE  A-TYPE-40    TO   S1-LOCAD2 (COM-S).
    MOVE 9 TO S1DS (52 COM-S).
P216A.
    IF S1-B-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-B-SW  (COM-S) NOT = 7 GO TO P216B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P216B.
    MOVE 9 TO S1-B-SW (COM-S).
    GO TO P-EXIT.
P217.
    IF CHG-SW > 8 GO TO P217A.
    MOVE T-TYPE-1 TO S1-O-STATE (COM-S).
    MOVE T-TYPE-2 TO S1-O-FIRE (COM-S).
    MOVE T-TYPE-3 TO S1-O-EC (COM-S).
    MOVE 9 TO S1DS (53 COM-S).
P217A.
    IF S1-O-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-O-SW  (COM-S) NOT = 7 GO TO P217B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P217B.
    MOVE 9 TO S1-O-SW (COM-S).
    GO TO P-EXIT.
P218.
    IF CHG-SW > 8 GO TO P218A.
    MOVE  F-TYPE     TO   S1-C-RFCVF  (COM-S).
    MOVE 9 TO S1DS (54 COM-S).
P218A.
    IF S1-C-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-C-SW  (COM-S) NOT = 7 GO TO P218B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P218B.
    MOVE 9 TO S1-C-SW (COM-S).
    GO TO P-EXIT.
P219.
    IF CHG-SW > 8 GO TO P219A.
    MOVE  F-TYPE     TO   S1-G-RFCVF  (COM-S).
    MOVE 9 TO S1DS (55 COM-S).
P219A.
    IF S1-G-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-G-SW  (COM-S) NOT = 7 GO TO P219B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P219B.
    MOVE 9 TO S1-G-SW (COM-S).
    GO TO P-EXIT.
P220.
    IF CHG-SW > 8 GO TO P220A.
    MOVE  F-TYPE     TO   S1-O-RFCVF  (COM-S).
    MOVE 9 TO S1DS (56 COM-S).
P220A.
    IF S1-O-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-O-SW  (COM-S) NOT = 7 GO TO P220B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P220B.
    MOVE 9 TO S1-O-SW (COM-S).
    GO TO P-EXIT.
P221.
    IF CHG-SW > 8 GO TO P221A.
    MOVE  F-TYPE     TO   S1-R-RFCVF  (COM-S).
    MOVE 9 TO S1DS (57 COM-S).
P221A.
    IF S1-R-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-R-SW  (COM-S) NOT = 7 GO TO P221B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P221B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P222.
    IF CHG-SW > 8 GO TO P222A.
    MOVE  F-TYPE     TO   S1-CRF-SA   (COM-S).
    MOVE 9 TO S1DS (58 COM-S).
P222A.
    IF S1-C-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-C-SW  (COM-S) NOT = 7 GO TO P222B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P222B.
    MOVE 9 TO S1-C-SW (COM-S).
    GO TO P-EXIT.
P223.
    IF CHG-SW > 8 GO TO P223A.
    MOVE  F-TYPE     TO   S1-GRF-SA   (COM-S).
    MOVE 9 TO S1DS (59 COM-S).
P223A.
    IF S1-G-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-G-SW  (COM-S) NOT = 7 GO TO P223B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P223B.
    MOVE 9 TO S1-G-SW (COM-S).
    GO TO P-EXIT.
P224.
    IF CHG-SW > 8 GO TO P224A.
    MOVE  F-TYPE     TO   S1-ORF-SA   (COM-S).
    MOVE 9 TO S1DS (60 COM-S).
P224A.
    IF S1-O-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-O-SW  (COM-S) NOT = 7 GO TO P224B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P224B.
    MOVE 9 TO S1-O-SW (COM-S).
    GO TO P-EXIT.
P225.
    IF CHG-SW > 8 GO TO P225A.
    MOVE  F-TYPE     TO   S1-RRF-SA   (COM-S).
    MOVE 9 TO S1DS (61 COM-S).
P225A.
    IF S1-R-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-R-SW  (COM-S) NOT = 7 GO TO P225B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P225B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P226.
    IF CHG-SW > 8 GO TO P226A.
    MOVE  NUM-GRP-TYPE    TO   S1-G-RFSLIM (COM-S).
    MOVE 9 TO S1DS (62 COM-S).
P226A.
    IF S1-G-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-G-SW  (COM-S) NOT = 7 GO TO P226B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P226B.
    MOVE 9 TO S1-G-SW (COM-S).
    GO TO P-EXIT.
P227.
    IF CHG-SW > 8 GO TO P227A.
    MOVE  NUM-GRP-TYPE    TO   S1-C-RFSLIM (COM-S).
    MOVE 9 TO S1DS (63 COM-S).
P227A.
    IF S1-C-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-C-SW  (COM-S) NOT = 7 GO TO P227B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P227B.
    MOVE 9 TO S1-C-SW (COM-S).
    GO TO P-EXIT.
P228.
    IF CHG-SW > 8 GO TO P228A.
    MOVE  NUM-GRP-TYPE    TO   S1-O-RFSLIM (COM-S).
    MOVE 9 TO S1DS (64 COM-S).
P228A.
    IF S1-O-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-O-SW (COM-S) NOT = 7 GO TO P228B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P228B.
    MOVE 9 TO S1-O-SW (COM-S).
    GO TO P-EXIT.
P229.
    IF CHG-SW > 8 GO TO P229A.
    MOVE  NUM-GRP-TYPE    TO   S1-R-RFSLIM (COM-S).
    MOVE 9 TO S1DS (65 COM-S).
P229A.
    IF S1-R-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-R-SW (COM-S) NOT = 7 GO TO P229B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P229B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P230.
    IF CHG-SW > 8 GO TO P230A.
    MOVE  NUM-GRP-TYPE    TO   S1-C-RFALIM.
    MOVE 9 TO S1DS (66 COM-S).
P230A.
    IF S1-C-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-C-SW (COM-S) NOT = 7 GO TO P230B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P230B.
    MOVE 9 TO S1-C-SW (COM-S).
    GO TO P-EXIT.
P231.
    IF CHG-SW > 8 GO TO P231A.
    MOVE  NUM-GRP-TYPE    TO   S1-G-RFALIM.
    MOVE 9 TO S1DS (67 COM-S).
P231A.
    IF S1-G-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-G-SW (COM-S) NOT = 7 GO TO P231B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P231B.
    MOVE 9 TO S1-G-SW (COM-S).
    GO TO P-EXIT.
P232.
    IF CHG-SW > 8 GO TO P232A.
    MOVE  NUM-GRP-TYPE    TO   S1-O-RFALIM.
    MOVE 9 TO S1DS (68 COM-S).
P232A.
    IF S1-O-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-O-SW (COM-S) NOT = 7 GO TO P232B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P232B.
    MOVE 9 TO S1-O-SW (COM-S).
    GO TO P-EXIT.
P233.
    IF CHG-SW > 8 GO TO P233A.
    MOVE  NUM-GRP-TYPE    TO   S1-R-RFALIM.
    MOVE 9 TO S1DS (69 COM-S).
P233A.
    IF S1-R-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-R-SW (COM-S) NOT = 7 GO TO P233B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P233B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P234.
    IF CHG-SW > 8 GO TO P234A.
    MOVE  F-TYPE     TO   S1-C-NRFCV  (COM-S).
    MOVE 9 TO S1DS (70 COM-S).
P234A.
    IF S1-C-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-C-SW (COM-S) NOT = 7 GO TO P234B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P234B.
    MOVE 9 TO S1-C-SW (COM-S).
    GO TO P-EXIT.
P235.
    IF CHG-SW > 8 GO TO P235A.
    MOVE  F-TYPE     TO   S1-G-NRFCV  (COM-S).
    MOVE 9 TO S1DS (71 COM-S).
P235A.
    IF S1-G-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-G-SW (COM-S) NOT = 7 GO TO P235B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P235B.
    MOVE 9 TO S1-G-SW (COM-S).
    GO TO P-EXIT.
P236.
    IF CHG-SW > 8 GO TO P236A.
    MOVE  F-TYPE     TO   S1-O-NRFCV  (COM-S).
    MOVE 9 TO S1DS (72 COM-S).
P236A.
    IF S1-O-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-O-SW (COM-S) NOT = 7 GO TO P236B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P236B.
    MOVE 9 TO S1-O-SW (COM-S).
    GO TO P-EXIT.
P237.
    IF CHG-SW > 8 GO TO P237A.
    MOVE  F-TYPE     TO   S1-R-NRFCV  (COM-S).
    MOVE 9 TO S1DS (73 COM-S).
P237A.
    IF S1-R-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-R-SW (COM-S) NOT = 7 GO TO P237B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P237B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P238.
    IF CHG-SW > 8 GO TO P238A.
    MOVE  NUM-GRP-TYPE    TO  S1-C-DISCAMT (COM-S).
    MOVE 9 TO S1DS (74 COM-S).
P238A.
    IF S1-C-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-C-SW (COM-S) NOT = 7 GO TO P238B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P238B.
    MOVE 9 TO S1-C-SW (COM-S).
    GO TO P-EXIT.
P239.
    IF CHG-SW > 8 GO TO P239A.
    MOVE NUM-GRP-TYPE TO S1-G-DISCAMT (COM-S).
    MOVE 9 TO S1DS (75 COM-S).
P239A.
    IF S1-G-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-G-SW (COM-S) NOT = 7 GO TO P239B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P239B.
    MOVE 9 TO S1-G-SW (COM-S).
    GO TO P-EXIT.
P240.
    IF CHG-SW > 8 GO TO P240A.
    MOVE NUM-GRP-TYPE TO S1-O-DISCAMT (COM-S).
    MOVE 9 TO S1DS (76 COM-S).
P240A.
    IF S1-O-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-O-SW (COM-S) NOT = 7 GO TO P240B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P240B.
    MOVE 9 TO S1-O-SW (COM-S).
    GO TO P-EXIT.
P241.
    IF CHG-SW > 8 GO TO P241A.
    MOVE NUM-GRP-TYPE TO S1-R-DISCAMT (COM-S).
    MOVE 9 TO S1DS (77 COM-S).
P241A.
    IF S1-R-SW  (COM-S) < 5 GO TO P-EXIT.
    IF S1-R-SW (COM-S) NOT = 7 GO TO P241B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P241B.
    MOVE 9 TO S1-R-SW (COM-S).
    GO TO P-EXIT.
P242.
    GO TO P-EXIT.
P243. IF CHG-SW > 8 GO TO P243A.
*   MOVE F-TYPE TO S1-PG-CHANGE-ALL (COM-S).
*   MOVE 9 TO S1PG01-SW (COM-S).
P243A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P243B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P243B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P244.
    IF CHG-SW > 8 GO TO P244A.
*   MOVE F-TYPE TO S1-PG-CUD-CHANGE (COM-S).
*   MOVE 9 TO S1PG02-SW (COM-S).
P244A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P244B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P244B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P245.
    IF CHG-SW > 8 GO TO P245A.
*   MOVE NUM-GRP-TYPE TO S1-PG-CUD-VALUE (COM-S).
*   MOVE 9 TO S1PG03-SW (COM-S).
P245A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P245B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P245B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P246.
    IF CHG-SW > 8 GO TO P246A.
*   MOVE NUM-GRP-TYPE TO S1-PG-TERR-CODE (COM-S).
*   MOVE 9 TO S1PG05-SW (COM-S).
P246A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P246B.
    IF CHG-SW = ZEROES GO TO P-EXIT.
P246B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P247.
    IF CHG-SW > 8 GO TO P247A.
*   MOVE F-TYPE TO S1-PG-2-PLATES-IND (COM-S).
*   MOVE 9 TO S1PG06-SW (COM-S).
P247A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P247B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P247B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P248.
    IF CHG-SW > 8 GO TO P248A.
*   MOVE F-TYPE TO S1-PG-HOTEL-IND (COM-S).
*   MOVE 9 TO S1PG07-SW (COM-S).
P248A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P248B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P248B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P249.
    IF CHG-SW > 8 GO TO P249A.
*   MOVE F-TYPE TO S1-PG-INTERIOR-IND (COM-S).
*   MOVE 9 TO S1PG08-SW (COM-S).
P249A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P249B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P249B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P250.
    IF CHG-SW > 8 GO TO P250A.
    MOVE F-TYPE TO B-MOS-CHANGE-IND (COM-S).
    MOVE 9 TO B-BMON11-SW (COM-S).
P250A.
    IF S1-BURGLARY-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P250B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P250B.
    MOVE 9 TO S1-BURGLARY-SW (COM-S).
    GO TO P-EXIT.
P251.
    IF CHG-SW > 8 GO TO P251A.
    MOVE NUM-GRP-TYPE TO B-MOS-DIV-CHANGE-IND (COM-S).
    MOVE 9 TO B-BMON12-SW (COM-S).
P251A.
    IF S1-BURGLARY-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P251B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P251B.
    MOVE 9 TO S1-BURGLARY-SW (COM-S).
    GO TO P-EXIT.
P252.
    IF CHG-SW > 8 GO TO P252A.
    MOVE F-TYPE TO B-MR-IP-CHANGE-IND (COM-S).
    MOVE 9 TO B-BMON13-SW (COM-S).
P252A.
    IF S1-BURGLARY-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P252B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P252B.
    MOVE 9 TO S1-BURGLARY-SW (COM-S).
    GO TO P-EXIT.
P253.
    IF CHG-SW > 8 GO TO P253A.
    MOVE F-TYPE TO B-MR-OP-CHANGE-IND (COM-S).
    MOVE 9 TO B-BMON14-SW (COM-S).
P253A.
    IF S1-BURGLARY-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P253B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P253B.
    MOVE 9 TO S1-BURGLARY-SW (COM-S).
    GO TO P-EXIT.
P254.
    IF CHG-SW > 8 GO TO P254A.
    MOVE NUM-GRP-TYPE TO B-MR-OP-MSGR-CHANGES (COM-S).
    MOVE 9 TO B-BMON15-SW (COM-S).
P254A.
    IF S1-BURGLARY-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P254B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P254B.
    MOVE 9 TO S1-BURGLARY-SW (COM-S).
    GO TO P-EXIT.
P255.
    IF CHG-SW > 8 GO TO P255A.
    MOVE F-TYPE TO B-BFMS-IP-CHANGE-IND (COM-S).
    MOVE 9 TO B-BMON16-SW (COM-S).
P255A.
    IF S1-BURGLARY-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P255B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P255B.
    MOVE 9 TO S1-BURGLARY-SW (COM-S).
    GO TO P-EXIT.
P256.
    IF CHG-SW > 8 GO TO P256A.
    MOVE F-TYPE TO B-BFMS-OP-CHANGE-IND (COM-S).
    MOVE 9 TO B-BMON17-SW (COM-S).
P256A.
    IF S1-BURGLARY-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P256B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P256B.
    MOVE 9 TO S1-BURGLARY-SW (COM-S).
    GO TO P-EXIT.
P257.
    IF CHG-SW > 8 GO TO P257A.
    MOVE NUM-GRP-TYPE TO B-BFMS-OP-MSGR-CHNGE (COM-S).
    MOVE 9 TO B-BMON18-SW (COM-S).
P257A.
    IF S1-BURGLARY-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7  GO TO P257B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P257B.
    MOVE 9 TO S1-BURGLARY-SW (COM-S).
    GO TO P-EXIT.
P258.
    IF CHG-SW > 8 GO TO P258A.
    MOVE F-TYPE TO B-BFMS-AMV-CHNGE-IND (COM-S).
    MOVE 9 TO B-BMON19-SW (COM-S).
P258A.
    IF S1-BURGLARY-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-BURGLARY-SW (COM-S) NOT = 7 GO TO P258B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P258B.
    MOVE 9 TO S1-BURGLARY-SW (COM-S).
    GO TO P-EXIT.
P259.
    IF CHG-SW > 8 GO TO P259A.
    MOVE NUM-GRP-TYPE TO B-MS-RISK-CLASS (COM-S).
    MOVE 9 TO B-MS-020-SW (COM-S).
P259A.
    IF S1-MS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MS-COV-SW (COM-S) NOT = 7 GO TO P259B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P259B.
    MOVE 9 TO S1-MS-COV-SW (COM-S).
    GO TO P-EXIT.
P260.
    IF CHG-SW > 8 GO TO P260A.
    MOVE NUM-GRP-TYPE TO B-MR-RISK-CLASS (COM-S).
    MOVE 9 TO B-MR-100-SW (COM-S).
P260A.
    IF S1-MR-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-MR-COV-SW (COM-S) NOT = 7 GO TO P260B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P260B.
    MOVE 9 TO S1-MR-COV-SW (COM-S).
    GO TO P-EXIT.
P261.
    IF CHG-SW > 8 GO TO P261A.
    MOVE NUM-GRP-TYPE TO B-BFMS-RISK-CLASS (COM-S).
    MOVE 9 TO B-BF-100-SW (COM-S).
P261A.
    IF S1-BFMS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-BFMS-COV-SW (COM-S) NOT = 7 GO TO P261B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P261B.
    MOVE 9 TO S1-BFMS-COV-SW (COM-S).
    GO TO P-EXIT.
P262.
    IF CHG-SW > 8 GO TO P262A.
    MOVE NUM-GRP-TYPE TO B-BFS-RISK-CLASS (COM-S).
    MOVE 9 TO B-BFS-02-SW (COM-S).
P262A.
    IF S1-BFS-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-BFS-COV-SW (COM-S) NOT = 7  GO TO P262B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P262B.
    MOVE 9 TO S1-BFS-COV-SW (COM-S).
    GO TO P-EXIT.
P263.
    IF CHG-SW > 8 GO TO P263A.
    MOVE NUM-GRP-TYPE TO B-SBR-RISK-CLASS (COM-S).
    MOVE 9 TO B-SBR-02-SW (COM-S).
P263A.
    IF S1-SBR-COV-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-SBR-COV-SW (COM-S) NOT = 7 GO TO P263B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P263B.
    MOVE 9 TO S1-SBR-COV-SW (COM-S).
    GO TO P-EXIT.
P264.
    IF CHG-SW > 8 GO TO P-EXIT.
    MOVE F-TYPE TO S1-ANOTHERLOC.
    MOVE 9 TO S1DS (47 COM-S).
    GO TO P-EXIT.
P265.
    IF CHG-SW > 8 GO TO P265A.
*   MOVE NUM-GRP-TYPE TO S1-PG-NO-BEDROOMS (COM-S).
*   MOVE 9 TO S1PG09-SW (COM-S).
P265A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P265B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P265B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P266.
    GO TO P-EXIT.
P267.
    GO TO P-EXIT.
P268.
    IF CHG-SW > 8 GO TO P268A.
*   MOVE F-TYPE TO S1-PG-CUD-IND (COM-S).
*   MOVE 9 TO S1PG12-SW (COM-S).
P268A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P268B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P268B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P269.
    IF CHG-SW > 8 GO TO P269A.
*   MOVE A-TYPE-40 TO S1-PG-CLASS (COM-S S1PG).
*   MOVE 9 TO S1PG13-SW (COM-S S1PG).
P269A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P269B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P269B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P270.
    IF CHG-SW > 8 GO TO P270A.
*   MOVE NUM-GRP-TYPE TO S1-PG-USE (COM-S S1PG).
*   MOVE 9 TO S1PG14-SW (COM-S S1PG).
P270A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P270B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P270B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P271.
    GO TO P-EXIT.
P272.
    IF CHG-SW > 8 GO TO P272A.
*   MOVE T-TYPE-1 TO S1-PG-NO-PLATES (COM-S S1PG).
*   MOVE T-TYPE-2 TO S1-PG-WIDTH (COM-S S1PG).
*   MOVE T-TYPE-3 TO S1-PG-LENGTH (COM-S S1PG).
*   MOVE 9 TO S1PG16-SW (COM-S S1PG).
P272A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P272B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P272B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P273.
    IF CHG-SW > 8 GO TO P273A.
*   MOVE F-TYPE TO S1-PG-DISCOUNT (COM-S S1PG).
*   MOVE 9 TO S1PG17-SW (COM-S S1PG).
P273A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P273B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P273B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P274.
    GO TO P-EXIT.
P275.
    GO TO P-EXIT.
P276.
    GO TO P-EXIT.
P277.
    GO TO P-EXIT.
P278.
    GO TO P-EXIT.
P279.
    IF CHG-SW > 8 GO TO P279A.
*   MOVE NUM-GRP-TYPE TO S1-PG-DESIRED-DISC (COM-S S1PG).
*   MOVE 9 TO S1PG23-SW (COM-S S1PG).
P279A.
    IF S1-P-SW (COM-S) < 5 GO TO P-EXIT.
    IF S1-P-SW (COM-S) NOT = 7 GO TO P279B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P279B.
    MOVE 9 TO S1-P-SW (COM-S).
    GO TO P-EXIT.
P280.
    IF CHG-SW > 8 GO TO P280A.
    MOVE F-TYPE TO S1-G-BURG (COM-S).
    MOVE 9 TO S1-G-SW (COM-S).
P280A.
    IF S1DS (85 COM-S) < 5 GO TO P-EXIT.
    IF S1DS (85 COM-S) NOT = 7 GO TO P280B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P280B.
    MOVE 9 TO S1DS (85 COM-S).
    GO TO P-EXIT.
P281.
    IF CHG-SW > 8 GO TO P281A.
    MOVE F-TYPE TO S1-O-BURG (COM-S).
    MOVE 9 TO S1-O-SW (COM-S).
P281A.
    IF S1DS (86 COM-S) < 5 GO TO P-EXIT.
    IF S1DS (86 COM-S) NOT = 7 GO TO P281B.
    IF CHG-SW = ZERO GO TO P-EXIT.
P281B.
    MOVE 9 TO S1DS (86 COM-S).
    GO TO P-EXIT.
P-EXIT.
     DISPLAY 'LEAVING QUOTR2.'.
    EXIT PROGRAM.
  f9À