IDENTIFICATION DIVISION.
PROGRAM-ID.  SUPER0.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT CONTROL-FILE  ASSIGN TO DSK
    ACCESS IS INDEXED
    SYMBOLIC KEY IS CTRKEY
    RECORD KEY IS CNT-USER-NO
    RECORDING MODE IS ASCII.
DATA DIVISION.
FILE SECTION.
FD CONTROL-FILE
    BLOCK CONTAINS 12 RECORD
    LABEL RECORDS STANDARD
    VALUE OF IDENTIFICATION 'ZCNTRFIDX'.
01  CNTRL-REC.
    05  CNTRL-KEY.
    10 CNT-USER-NO    PIC X(4).
    10 CNT-USER-LIMIT  PIC 9(7).
    10 CNT-BRANCH    PIC 9(2).
WORKING-STORAGE SECTION.
77  CTRKEY   PIC X(4).
77  NCR-MESG   PIC X.
77  SEC-MESG   PIC 9.
77  FIRST-TIME  PIC 9 VALUE 0.
77  CALL-SEC-NO  PIC 9 VALUE 0.
77  PRINT-TYPE  PIC X VALUE SPACE.
77  USER-ID-WK1  PIC X(8)  VALUE SPACES.
01  COMMON-AREA.
 02 X-COMMON-AREA.
  03 SUPMON-TERMMOD-AREA PIC X(2000).
  03 SUPAREA REDEFINES SUPMON-TERMMOD-AREA.
    05 MONITOR-SWITCHES.
      10 GO-SW PIC 9.
      10 ACCEPT-SW PIC 9.
      10 ACTION-SW PIC 9.
      10 ALL-SIXES PIC 9.
      10 RESTART-SW PIC 9.
      10 RESTART-SECT PIC 9.
      10 S1L PIC 9.
      10 COM-LOC PIC 9.
      10 COM-CLS PIC 99.
      10 COM-S PIC 99.
      10 IDENT-SW PIC 99 OCCURS 10.
      10 IDEN-SEC PIC 9.
    05 MONITOR-DATA.
      10 COM-DATE-TIME.
       13 COM-DATE.
        15 COM-DTE-MO PIC 99.
        15 FILLER PIC X.
        15 COM-DTE-DA PIC 99.
        15 FILLER PIC X.
        15 COM-DTE-YR PIC 99.
       13 COM-TIME.
        15 COM-HOUR PIC 99.
        15 FILLER PIC X.
        15 COM-MIN PIC 99.
        15 FILLER PIC X.
        15 COM-SEC PIC 99.
      10 CALL-NUM-KEY PIC 9(4).
      10 CALL-EDIT-TYPE PIC X.
      10 SEC-NO PIC 9.
      10 VERB-NO PIC 9.
      10 PROMPT-TYPE PIC 9.
      10 PROMPT-NOUN-C PIC X(100).
      10 CHG-SEC-NO PIC 9.
      10 DISAS-SW PIC 9.
      10 S0-PRINT-SW PIC X.
      10 INPUT-TYPE PIC 9.
      10 USER-ID-WK.
        15 FILLER PIC XX.
        15 USR-ID4.
          20 FILLER PIC X.
          20 USR-ID-NUM PIC XXX.
        15 FILLER PIC XX.
    05 SEC-SUP-END-ITEM PIC X.
  03 SECTION-ZERO-AREA PIC X(500).
  03 SECZERO REDEFINES SECTION-ZERO-AREA.
    05 SECTION-0-DATA.
      10 OLD-QUOTE PIC 99.
      10 SAVE-QUOTE PIC 99.
      10 COM-USER-NAME PIC X(25).
      10 COM-PRODUCER-NO PIC 9(8).
      10 COM-APPLICANT-NAME PIC X(40).
      10 COM-APPLICANT-ADDR1 PIC X(40).
      10 COM-APPLICANT-ADDR2 PIC X(40).
      10 COM-APPLICANT-STATE PIC X(4).
      10 COM-APPLICANT-ZIP PIC 9(5).
      10 COM-EFF-DATE PIC 9(6).
      10 COM-POLICY-TERM PIC 9.
      10 COM-DTG-POLICY-MODIFY PIC X(8).
      10 COM-QUOTE-PLAN PIC X(7).
      10 COM-USER-LIMIT PIC 9(7).
      10 COM-BRANCH-NO PIC 99.
      10 COM-SESSION-TYPE PIC X.
      10 COM-QUOTE-DATE PIC X(8).
      10 COM-EFFECTIVE-DATE PIC X(8).
    05 SEC-COM-END-ITEM PIC X.
  03 SECTION-ONE-AREA PIC X(5000).
  03 SECONE REDEFINES SECTION-ONE-AREA.
    05 SECTION-1-DATA.
***** TOTAL PREMIUM FOR SECTION-ONE
      10 S1-TOT-PREM PIC 9(6)V99.
*****KEYWORD NUMBER
*****0075
      10 S1-LOCNSW PIC 9.
*****0076
      10 S1-EXPNOV PIC X.
      10 S1DS-GRP OCCURS 100.
        15 S1DS OCCURS 5 PIC 9.
      10 M-D PIC X(20).
      10 S1-DEDC-MIN PIC 9(6).
      10 S1-B-RISKSV PIC X.
      10 S1-C-RISKSV PIC X.
      10 S1-G-RISKSV PIC X.
      10 S1TOTLOC PIC 9.
      10 S1-ANOTHERLOC PIC X.
      10 MDS.
          20 M-D1 PIC X(8).
          20 M-D2 PIC 9(5)V9(3).
      10 PROMPT-INFO.
          20 S1-CVG-NUM PIC 99.
          20 S1-VERB-NO PIC 9.
          20 S1-CALL-NUM-KEY PIC 9(4).
          20 S1-CK-QT-INDX PIC 99.
          20 S1-CALL-EDIT-TYPE PIC X.
      10 S1-CVGSW-INDXD.
          20 SCI.
            25 S1CVG OCCURS 13 PIC 9.
          20 SCIC.
            25 S1CVGCHG OCCURS 13 PIC X.
      10 COVERAGES.
        15 CVG OCCURS 5 INDEXED BY INX-CVG.
          20 S1-CVGSW.
            25 S1-B-SW PIC 9.
            25 S1-C-SW PIC 9.
            25 S1-G-SW PIC 9.
            25 S1-O-SW PIC 9.
            25 S1-T-SW PIC 9.
            25 S1-I-SW PIC 9.
            25 S1-R-SW PIC 9.
            25 S1-V-SW PIC 9.
            25 S1-P-SW PIC 9.
            25 S1-N-SW PIC 9.
            25 S1-M-SW PIC 9.
            25 S1-F-SW PIC 9.
            25 S1-X-SW PIC 9.
            25 S1-BR-SW PIC 9.
          20 S1-CVGSW-CHG.
            25 S1-B-CHG PIC X.
            25 S1-C-CHG PIC X.
            25 S1-G-CHG PIC X.
            25 S1-O-CHG PIC X.
            25 S1-T-CHG PIC X.
            25 S1-I-CHG PIC X.
            25 S1-R-CHG PIC X.
            25 S1-V-CHG PIC X.
            25 S1-P-CHG PIC X.
            25 S1-N-CHG PIC X.
            25 S1-M-CHG PIC X.
            25 S1-F-CHG PIC X.
            25 S1-X-CHG PIC X.
            25 S1-BR-CHG PIC X.
          20 S1-LOC-TOT-PREM PIC 9(6)V99.
*****0062
          20 S1-CLSCD PIC 9.
          20 S1-STCD PIC 99.
         20 S1-AREACD PIC 99.
*****0061
          20 S1-B-FIRE PIC 9V999.
          20 S1-B-EC PIC 9V999.
          20 S1-B-VMM PIC 9V999.
*****0063
          20 S1-B-COIN-FIRE PIC 9V999.
          20 S1-B-COIN-EC PIC 9V999.
          20 S1-B-COIN-VMM PIC 9V999.
****0064
          20 S1-SPRKLR PIC X.
*****0065
          20 S1-B-RISK PIC X.
*****0066
          20 S1-C-RISK PIC X.
*****0067
          20 S1-CHGRSK PIC X.
*****0068
          20 S1-X-BURG.
            25 S1-C-BURG PIC X.
            25 S1-G-BURG PIC X.
            25 S1-O-BURG PIC X.
*****0069
          20 S1-DISC PIC 9V999.
          20 S1-DEDC PIC 9(6).
          20 S1-RFTERR PIC 99.
          20 S1-G-FIRE PIC 9V999.
          20 S1-G-EC PIC 9V999.
          20 SS-G-VMM PIC 9V999.
          20 S1-FMM OCCURS 13 PIC V999.
          20 S1-DEDCPCT PIC V99.
          20 S1-RESTART-SW PIC 9.
*****0070
          20 S1-RF-CVG PIC X(5).
*****0071
          20 S1-RF-BAS PIC X.
          20 S1-RF-BAS-B PIC X.
          20 S1-RF-BAS-C PIC X.
          20 S1-RF-BAS-G PIC X.
*****0072
*****BUILDING WORK-AREA
          20 S1-B-LIM-LBL-PCT PIC 9(7).
          20 S1-B-LIM-COIN-PCT PIC V999.
*****CONTENTS WORKAREA
*****0073
          20 S1-C-LIM-LBL-PCT PIC 9(7).
          20 S1-C-LIM-COIN-PCT PIC V999.
*****CUSTOMER GOODS WORKAREA
*****0074
          20 S1-G-LIM-LBL-PCT PIC 9(7).
          20 S1-G-LIM-COIN-PCT PIC V999.
          20 S1-G-RISK PIC X.
*****OTHER PROPERT WORKAREA
*****0077
          20 S1-O-RATE PIC V999.
          20 S1-O-LIM-LBL PIC 9(7).
          20 S1-O-COIN-PCT PIC V999.
          20 S1-O-STATE PIC 99.
          20 S1-O-FIRE PIC 9V999.
          20 S1-O-EC PIC 9V999.
*****PROPERTY IN TRANSIT WORKAREA
          20 S1-T-RATE PIC V999.
          20 S1-T-LIM-LBL PIC 9(7).
          20 S1-T-RISKFORM PIC X.
          20 S1-T-NET-RATE PIC 9V999.
*****INCOME INTERRUPTION WORKAREA
          20 S1-I-LIM-LBL PIC 9(7).
          20 S1-I-COIN-PCT PIC V999.
          20 S1-I-CTF.
            25 S1-I-CLASS PIC XXX.
            25 S1-I-FORM PIC X.
            25 S1-I-TYPE PIC X.
*****ACCOUNTS RECEIVABLE
          20 S1-R-LIM-LBL PIC 9(7).
          20 S1-R-LIM-LBLAVG PIC 9(7).
          20 R-COIN-PCT PIC V999.
          20 S1-R-RECPTL PIC X.
          20 S1-R-RCPTYP PIC X(4).
          20 S1-R-CRED PIC V999.
*****0087
          20 S1-R-RCDDUP PIC 99.
*****0088
          20 S1-R-ARRKCL PIC X.
          20 S1-R-RATE PIC 9V999.
          20 S1-R-NRFPREM PIC 9(5)V99.
          20 S1-R-RFPREM PIC 9(5)V99.
*****VALUABLE PAPERS WORKAREA
          20 S1-V-LIM-LBL PIC 9(7).
          20 S1-V-COIN-PCT PIC V999.
*****0089
          20 S1-V-RECPTL PIC X.
*****0090
          20 S1-V-RCPTYP PIC X(4).
*****PLATE GLASS WORK AREA
          20 S1-P-LIM-LBL PIC 9(7).
          20 S1-P-COINCT PIC V999.
*****NEON SIGNS WORK AREA
          20 S1-N-LIM-LBL PIC 9(7).
          20 S1-N-NUMOFSIGNS PIC 99.
*****MARINE WORKAREA
          20 S1-M-RATE PIC V999.
          20 S1-M-LIM-LBL PIC 9(7).
          20 S1-M-COIN-PCT PIC V999.
*****FIRE WORKAREA
          20 S1-F-LIM-LBL PIC 9(7).
          20 S1-F-COIN-PCT PIC V999.
          20 S1-BPREMIUM PIC 9(5)V99.
          20 S1-CPREMIUM PIC 9(5)V99.
          20 S1-GPREMIUM PIC 9(5)V99.
          20 S1-TPREMIUM PIC 9(5)V99.
          20 S1-OPREMIUM PIC 9(5)V99.
          20 S1-RPREMIUM PIC 9(5)V99.
          20 S1-VPREMIUM PIC 9(5)V99.
          20 S1-RISKFORM-CODE PIC X.
***** INDEX FOR S1DS DATA SWITCHES
          20 S1DSINDX PIC 99.
          20 S1-C-FIRE PIC 9V999.
          20 S1-C-EC PIC 9V999.
          20 S1-C-VMM PIC 9V999.
***** RESULTS OF S1-B-FIRE S1-B-EC *.95 OR *.90
          20 S1-BF PIC 99V999.
          20 S1-BEC PIC 99V999.
***** ADJUSTED BY .70 FOR VIRGINIA APT
          20 S1-BFVA PIC 99V999.
          20 S1-BECVA PIC 99V999.
          20 S1-STATE PIC XX.
          20 S1-BF-NET-RATE PIC 99V999.
          20 S1-BEC-NET-RATE PIC 99V999.
          20 S1-BFORM-NET-RATE PIC 99V999.
***** RESULTS OF S1-BLDG-LIM * NET-RATES
          20 S1-BF-PREM PIC 9(5)V99.
          20 S1-BEC-PREM PIC 9(5)V99.
          20 S1-BFORM-PREM PIC 9(5)V99.
***** RESULTS OF S1-C-FIRE S1-C-EC *.95 OR *.90
          20 S1-CF PIC 99V999.
          20 S1-CEC PIC 99V999.
***** ADJUSTED BY .70 FOR VIRGINIA APT
          20 S1-CEVA PIC 99V999.
          20 S1-CECVA PIC 99V999.
          20 S1-CF-NET-RATE PIC 99V999.
          20 S1-CEC-NET-RATE PIC 99V999.
          20 S1-CFORM-NET-RATE PIC 99V999.
***** RESULTS OF S1-CNTS-LIM * NET-RATES
          20 S1-CF-PREM PIC 9(5)V99.
          20 S1-CEC-PREM PIC 9(5)V99.
          20 S1-CFORM-PREM PIC 9(5)V99.
***** RESULTS OF S1-G-FIRE S1-G-EC *.95 OR *.90
          20 S1-GF PIC 99V999.
          20 S1-GEC PIC 99V999.
***** ADJUSTED BY .70 FOR VIRGINIA APT
          20 S1-GEVA PIC 99V999.
          20 S1-GECVA PIC 99V999.
          20 S1-GF-NET-RATE PIC 99V999.
          20 S1-GEC-NET-RATE PIC 99V999.
          20 S1-GFORM-NET-RATE PIC 99V999.
***** RESULTS OF S1-BLDG-LIM * NET-RATES
          20 S1-GF-PREM PIC 9(5)V99.
          20 S1-GEC-PREM PIC 9(5)V99.
          20 S1-GFORM-PREM PIC 9(5)V99.
* KW00 DS#
          20 S1-I-CFT PIC X(40).
          20 S1-I-CLASS PIC XXX.
          20 S1-I-FORM PIC X.
          20 S1-I-TYPE PIC X.
          20 S1-B-BLNKT PIC X.
          20 S1-B-DISCAMT PIC 9(6).
          20 S1-C-DISCAMT PIC 9(6).
          20 S1-G-DISCAMT PIC 9(6).
          20 S1-O-DISCAMT PIC 9(6).
          20 S1-T-DISCAMT PIC 9(6).
          20 S1-I-DISCAMT PIC 9(6).
          20 S1-R-DISCAMT PIC 9(6).
          20 S1-V-DISCAMT PIC 9(6).
          20 S1-P-DISCAMT PIC 9(6).
          20 S1-N-DISCAMT PIC 9(6).
          20 S1-M-DISCAMT PIC 9(6).
          20 S1-F-DISCAMT PIC 9(6).
          20 S1-X-DISCAMT PIC 9(6).
          20 S1-CVGCHG PIC X.
          20 S1-L-STA PIC 99.
          20 S1-LOCAD1 PIC X(40).
          20 S1-LOCAD2 PIC X(40).
          20 S1-C-RFCVF PIC X.
          20 S1-G-RFCVF PIC X.
          20 S1-O-RFCVF PIC X.
          20 S1-R-RFCVF PIC X.
          20 S1-CRF-SA PIC X.
          20 S1-GRF-SA PIC X.
          20 S1-ORF-SA PIC X.
          20 S1-RRF-SA PIC X.
          20 S1-G-RFSLIM PIC 9(7).
          20 S1-C-RFSLIM PIC 9(7).
          20 S1-O-RFSLIM PIC 9(7).
          20 S1-R-RFSLIM PIC 9(7).
          20 S1-C-NRFCV PIC X.
          20 S1-G-NRFCV PIC X.
          20 S1-O-NRFCV PIC X.
          20 S1-R-NRFCV PIC X.
      10 S1-C-RFALIM PIC 9(7).
      10 S1-G-RFALIM PIC 9(7).
      10 S1-O-RFALIM PIC 9(7).
      10 S1-R-RFALIM PIC 9(7).
      10 S1-CVGALPHA PIC X(40).
      10 S1-ALL-SIXES PIC 9.
      10 S1-MORLOC PIC X.
      10 S1-TACKON OCCURS 5.
        15 S1-CF-BLNKT PIC X.
        15 S1-CEC-BLNKT PIC X.
        15 S1-BF-BLNKT PIC X.
        15 S1-BEC-BLNKT PIC X.
        15 S1-CB-BLNKT PIC X.
    05 SEC-1-END-ITEM PIC X.
  03 SECTION-ONE-BURG PIC X(20500).
  03 BURGLARY-SECTION REDEFINES SECTION-ONE-BURG.
      10 S1-BURGLARY-SW OCCURS 5 PIC 9.
      10 BURG-COV-SWS.
        15 B-COV-SWS OCCURS 5 PIC 9(7).
      10 B-COV-SWS-1 REDEFINES BURG-COV-SWS.
        15 B-COV-SW-1 OCCURS 5.
          20 B-COV-SW OCCURS 7 PIC 9.
      10 B-COV-REDEF REDEFINES BURG-COV-SWS.
        15 B-COV-RED OCCURS 5.
          20 S1-MOS-COV-SW PIC 9.
          20 S1-MS-COV-SW PIC 9.
          20 S1-MR-COV-SW PIC 9.
          20 S1-BFMS-COV-SW PIC 9.
          20 S1-BFS-COV-SW PIC 9.
          20 S1-SBR-COV-SW PIC 9.
          20 S1-OBR-COV-SW PIC 9.
      10 S1-B-DATA-SWITCHES OCCURS 5.
        15 B-BMON01-SW PIC 9.
        15 B-BMON02-SW PIC 9.
        15 B-BMON03-SW PIC 9.
        15 B-BMON04-SW PIC 9.
        15 B-BMON05-SW PIC 9.
        15 B-BMON06-SW PIC 9.
        15 B-BMON07-SW PIC 9.
        15 B-BMON08-SW PIC 9.
        15 B-BMON11-SW PIC 9.
        15 B-BMON12-SW PIC 9.
        15 B-BMON13-SW PIC 9.
        15 B-BMON14-SW PIC 9.
        15 B-BMON15-SW PIC 9.
        15 B-BMON16-SW PIC 9.
        15 B-BMON17-SW PIC 9.
        15 B-BMON18-SW PIC 9.
        15 B-BMON19-SW PIC 9.
        15 BURG-COV-INPUT-SW PIC 9.
      10 B-MOS-DATA-SWITCHES.
        15 MOS-SWITCHES OCCURS 5 PIC X(44).
      10 B-MOS-DATA-SWS REDEFINES B-MOS-DATA-SWITCHES.
        15 MOS-DATA-SWS OCCURS 5.
          20 MOS-COMMON-SWS PIC 99.
          20 MOS-DIV-SWS OCCURS 3.
            25 MOS-DIV-SW PIC 9(14).
      10 B-MOS-SWS REDEFINES B-MOS-DATA-SWITCHES.
        15 MOS-SWS OCCURS 5.
          20 B-MOS-01-SW PIC 9.
          20 B-MOS-02-SW PIC 9.
          20 B-MOS-DIV OCCURS 3.
            25 B-MOS-10-SW PIC 9.
            25 B-MOS-11-SW PIC 9.
            25 B-MOS-12-SW PIC 9.
            25 B-MOS-13-SW PIC 9.
            25 B-MOS-14-SW PIC 9.
            25 B-MOS-15-SW PIC 9.
            25 B-MOS-16-SW PIC 9.
            25 B-MOS-17-SW PIC 9.
            25 B-MOS-18-SW PIC 9.
            25 B-MOS-19-SW PIC 9.
            25 B-MOS-20-SW PIC 9.
            25 B-MOS-21-SW PIC 9.
            25 B-MOS-22-SW PIC 9.
            25 B-MOS-23-SW PIC 9.
      10 B-MS-DATA-SWITCHES.
        15 MS-SWITCHES OCCURS 5 PIC X(20).
      10 B-MS-DATA-SWS REDEFINES B-MS-DATA-SWITCHES.
        15 MS-DATA-SWS OCCURS 5.
          20 B-MS-001-SW PIC 9.
          20 B-MS-002-SW PIC 9.
          20 B-MS-003-SW PIC 9.
          20 B-MS-004-SW PIC 9.
          20 B-MS-005-SW PIC 9.
          20 B-MS-006-SW PIC 9.
          20 B-MS-007-SW PIC 9.
          20 B-MS-008-SW PIC 9.
          20 B-MS-009-SW PIC 9.
          20 B-MS-010-SW PIC 9.
          20 B-MS-011-SW PIC 9.
          20 B-MS-012-SW PIC 9.
          20 B-MS-013-SW PIC 9.
          20 B-MS-014-SW PIC 9.
          20 B-MS-015-SW PIC 9.
          20 B-MS-016-SW PIC 9.
          20 B-MS-017-SW PIC 9.
          20 B-MS-018-SW PIC 9.
          20 B-MS-019-SW PIC 9.
          20 B-MS-020-SW PIC 9.
      10 B-MR-DATA-SWITCHES.
        15 MR-SWITCHES OCCURS 5 PIC X(43).
      10 B-MR-DATA-SWS REDEFINES B-MR-DATA-SWITCHES.
        15 MR-DATA-SWS OCCURS 5.
          20 MR-COMMON-SWS PIC 999.
          20 MR-INSIDE-SWS PIC 9(9).
          20 MR-COM-MSGR-SW PIC 9.
          20 MR-MSGR-SWS OCCURS 5.
            25 MR-MSGR-SW PIC 9(6).
      10 B-MR-SWS REDEFINES B-MR-DATA-SWITCHES.
        15 MR-SWS OCCURS 5.
          20 B-MR-001-SW PIC 9.
          20 B-MR-002-SW PIC 9.
          20 B-MR-003-SW PIC 9.
          20 B-MR-100-SW PIC 9.
          20 B-MR-101-SW PIC 9.
          20 B-MR-102-SW PIC 9.
          20 B-MR-103-SW PIC 9.
          20 B-MR-104-SW PIC 9.
          20 B-MR-105-SW PIC 9.
          20 B-MR-106-SW PIC 9.
          20 B-MR-107-SW PIC 9.
          20 B-MR-108-SW PIC 9.
          20 B-MR-201-SW PIC 9.
          20 B-MR-MSGRS OCCURS 5.
            25 B-MR-202-SW PIC 9.
            25 B-MR-203-SW PIC 9.
            25 B-MR-204-SW PIC 9.
            25 B-MR-205-SW PIC 9.
            25 B-MR-206-SW PIC 9.
            25 B-MR-207-SW PIC 9.
      10 B-BFMS-DATA-SWITCHES.
        15 BFMS-SWITCHES OCCURS 5 PIC X(58).
      10 B-BFMS-DATA-SWS REDEFINES B-BFMS-DATA-SWITCHES.
        15 BFMS-DATA-SWS OCCURS 5.
          20 BFMS-COMMON-SWS PIC 9(4).
          20 BFMS-INSIDE-SWS PIC 9(17).
          20 BFMS-COM-MSGR-SW PIC 9.
          20 BFMS-MSGR-SW OCCURS 5.
            25 BFMS-MSGR-SWS PIC 9(6).
          20 BFMS-COM-AMV-SW PIC 9.
          20 BFMS-AMV-SW PIC 9(5).
      10 B-BFMS-SWS REDEFINES B-BFMS-DATA-SWITCHES.
        15 BFMS-SWS OCCURS 5.
          20 B-BF-001-SW PIC 9.
          20 B-BF-002-SW PIC 9.
          20 B-BF-003-SW PIC 9.
          20 B-BF-004-SW PIC 9.
          20 B-BF-100-SW PIC 9.
          20 B-BF-101-SW PIC 9.
          20 B-BF-103-SW PIC 9.
          20 B-BF-104-SW PIC 9.
          20 B-BF-105-SW PIC 9.
          20 B-BF-106-SW PIC 9.
          20 B-BF-107-SW PIC 9.
          20 B-BF-108-SW PIC 9.
          20 B-BF-109-SW PIC 9.
          20 B-BF-110-SW PIC 9.
          20 B-BF-111-SW PIC 9.
          20 B-BF-112-SW PIC 9.
          20 B-BF-113-SW PIC 9.
          20 B-BF-114-SW PIC 9.
          20 B-BF-115-SW PIC 9.
          20 B-BF-116-SW PIC 9.
          20 B-BF-117-SW PIC 9.
          20 B-BF-201-SW PIC 9.
          20 B-BF-MSGRS OCCURS 5.
            25 B-BF-202-SW PIC 9.
            25 B-BF-203-SW PIC 9.
            25 B-BF-204-SW PIC 9.
            25 B-BF-205-SW PIC 9.
            25 B-BF-206-SW PIC 9.
            25 B-BF-207-SW PIC 9.
          20 B-BF-301-SW PIC 9.
          20 B-BF-302-SW OCCURS 5 PIC 9.
      10 B-BFS-DATA-SWITCHES.
        15 BFS-SWITCHES OCCURS 5 PIC 99.
      10 B-BFS-DATA-SWS REDEFINES B-BFS-DATA-SWITCHES.
        15 BFS-DATA-SWS OCCURS 5.
          20 B-BFS-01-SW PIC 9.
          20 B-BFS-02-SW PIC 9.
      10 B-SBR-DATA-SWITCHES.
        15 SBR-SWITCHES OCCURS 5 PIC 99.
      10 B-SBR-DATA-SWS REDEFINES B-SBR-DATA-SWITCHES.
        15 SBR-DATA-SWS OCCURS 5.
          20 B-SBR-01-SW PIC 9.
          20 B-SBR-02-SW PIC 9.
      10 B-OBR-DATA-SWITCHES.
        15 OBR-SWITCHES OCCURS 5 PIC 9(12).
      10 B-OBR-DATA-SWS REDEFINES B-OBR-DATA-SWITCHES.
        15 OBR-DATA-SWS OCCURS 5.
          20 OBR-COMMON-SWS PIC 
          20 OBR-PSD-SW OCCURS 5 PIC 9.
      10 B-OBR-SWS REDEFINES B-OBR-DATA-SWITCHES.
        15 OBR-SWS OCCURS 5.
          20 B-OBR-01-SW PIC 9.
          20 B-OBR-02-SW PIC 9.
          20 B-OBR-03-SW PIC 9.
          20 B-OBR-04-SW PIC 9.
          20 B-OBR-05-SW PIC 9.
          20 B-OBR-06-SW PIC 9.
          20 B-OBR-07-SW PIC 9.
          20 B-OBR-08-SW OCCURS 5 PIC 9.
      10 B-DDS-TABLE.
        15 B-DDS-TBL OCCURS 5 PIC 9(7).
      10 B-DDS-TBL-1 REDEFINES B-DDS-TABLE.
        15 B-DDS-T OCCURS 5.
          20 B-DDS OCCURS 7 PIC 9.
      10 B-DDS-RED REDEFINES B-DDS-TABLE.
        15 B-DDS-R OCCURS 5.
          20 B-MOS000-SW PIC 9.
          20 B-MS0000-SW PIC 9.
          20 B-MR0000-SW PIC 9.
          20 B-BFMS00-SW PIC 9.
          20 B-BFS000-SW PIC 9.
          20 B-SBR000-SW PIC 9.
          20 B-OBR000-SW PIC 9.
      10 B-RISK-CLASS OCCURS 5 PIC 99.
      10 B-MS-RISK-CLASS OCCURS 5 PIC 99.
      10 B-MR-RISK-CLASS OCCURS 5 PIC 99.
      10 B-BFMS-RISK-CLASS OCCURS 5 PIC 99.
      10 B-BFS-RISK-CLASS OCCURS 5 PIC 99.
      10 B-SBR-RISK-CLASS OCCURS 5 PIC 99.
      10 BRG-EXCEPT OCCURS 5 PIC X.
      10 BRG-OPEN-24-HRS-IND OCCURS 5 PIC X.
      10 BRG-PKG-MOD-1 OCCURS 5 PIC S99V999.
      10 BRG-PKG-MOD-2 OCCURS 5 PIC S99V999.
      10 BRG-PKG-MOD-3 OCCURS 5 PIC S99V999.
      10 BRG-SCFM-INDICATOR OCCURS 5 PIC X.
      10 BRG-TERR-CODE OCCURS 5 PIC 9(4).
      10 B-MOS-CHANGE-IND OCCURS 5 PIC X.
      10 B-MOS-DIV-CHANGE-IND OCCURS 5 PIC 999.
      10 B-MR-IP-CHANGE-IND OCCURS 5 PIC X.
      10 B-MR-OP-CHANGE-IND OCCURS 5 PIC X.
      10 B-MR-OP-MSGR-CHANGES OCCURS 5 PIC 9(5).
      10 B-BFMS-IP-CHANGE-IND OCCURS 5 PIC X.
      10 B-BFMS-OP-CHANGE-IND OCCURS 5 PIC X.
      10 B-BFMS-OP-MSGR-CHNGE OCCURS 5 PIC 9(5).
      10 B-BFMS-AMV-CHNGE-IND OCCURS 5 PIC X.
      10 BURG-YN OCCURS 5 PIC X.
      10 B-COV-INPUT.
        15 BURG-COV-INPUT OCCURS 5 PIC X(40).
      10 BURG-COV-INPUT-1 REDEFINES B-COV-INPUT.
        15 BUR-COV-INPUT OCCURS 5.
          20 B-COV-INPUT-BYTE OCCURS 40 PIC X.
      10 B-COV-HOLD.
        15 BURG-COV-HOLD OCCURS 5 PIC X(7).
      10 BURG-COV-HOLD-1 REDEFINES B-COV-HOLD.
        15 BUR-COV-HOLD OCCURS 5.
          20 B-COV-HOLD-BYTE OCCURS 7 PIC X.
      10 BURG-COV-TABLE.
        15 B-COV-TABLE OCCURS 5.
          20 BURG-COV-YN-TABLE PIC X(7).
      10 B-COV-YN REDEFINES BURG-COV-TABLE.
        15 B-COV-YN-TAB OCCURS 5.
          20 BURG-COV-YN OCCURS 7 PIC X.
      10 BURG-COV-INPUT-REDEF REDEFINES BURG-COV-TABLE.
        15 B-COV-INPUT-R OCCURS 5.
          20 B-MOS-COV-SW PIC X.
          20 B-MS-COV-SW PIC X.
          20 B-MR-COV-SW PIC X.
          20 B-BFMS-COV-SW PIC X.
          20 B-BFS-COV-SW PIC X.
          20 B-SBR-COV-SW PIC X.
          20 B-OBR-COV-SW PIC X.
      10 BRG-CHANGE OCCURS 5 PIC 9.
      10 BRG-RESTART-SW PIC 9.
      10 DIVSUB PIC 9.
      10 MSGRSUB PIC 9.
      10 B-BASE-RATE PIC 99V999.
      10 B-TBL-RATE PIC 9(5)V99.
      10 B-BASE-AMOUNT PIC 9(6)V999.
      10 B-S-CASH-REG PIC 9(5)V99.
      10 B-S-KLS PIC 9(5)V99.
      10 B-D-WATCHMAN PIC 99V999.
      10 B-D-PRM-ALARM PIC 99V999.
      10 B-D-BR-GLASS PIC 99V999.
      10 B-D-SECURITIES PIC 99V999.
      10 B-D-24-HRS PIC 99V999.
      10 B-D-TEAR-GAS PIC 99V999.
      10 B-D-SAFE-VAULT PIC 99V999.
      10 B-D-BR-ENCL PIC 99V999.
      10 B-D-BRE-ALARM PIC 99V999.
      10 B-D-PB-ALARM PIC 99V999.
      10 B-D-GUARD PIC 99V999.
      10 B-D-HOLDUP PIC 99V999.
      10 B-D-MSG-BAG PIC 99V999.
      10 B-D-PRIV-CONV PIC 99V999.
      10 B-D-R-ROUTE PIC 99V999.
      10 B-D-BRG-ALARM PIC 99V999.
      10 B-S-SCFM PIC 99V999.
      10 B-ATR-A PIC 9(5)V99.
      10 B-ATR-B PIC 9(5)V99.
      10 B-ATR-C PIC 9(5)V99.
      10 B-ATR-D PIC 9(5)V99.
      10 B-ATR-E PIC 9(5)V99.
      10 B-ATR-F PIC 9(5)V99.
      10 B-ATR-G PIC 9(5)V99.
      10 B-ATR-H PIC 9(5)V99.
      10 B-ATR-I PIC 9(5)V99.
      10 B-ATR-J PIC 9(5)V99.
      10 B-ATR-K PIC 9(5)V99.
      10 B-ATR-L PIC 9(5)V99.
      10 B-ATR-M PIC 9(5)V99.
      10 B-ATR-N PIC 9(5)V99.
      10 B-ATR-O PIC 9(5)V99.
      10 B-ATR-P PIC 9(5)V99.
      10 B-ATR-Q PIC 9(5)V99.
      10 B-ATR-R PIC 9(5)V99.
      10 B-ATR-S PIC 9(5)V99.
      10 B-BASE-PREMIUM PIC 9(7).
      10 B-ADJ-PREMIUM PIC 9(7).
      10 B-ADJ-BASE-RATE-3 PIC 9(5)V99.
      10 B-SURCD-TBL-RATE PIC 9(5)V99.
      10 B-DSCT-TBL-RATE PIC 9(5)V99.
      10 B-ADJ-BASE-RATE-1 PIC 9(5)V99.
      10 B-ADJ-BASE-RATE-2 PIC 9(5)V99.
      10 B-MOS-DVD-COVERAGE OCCURS 5 PIC X.
      10 B-MOS-DIV-COUNT OCCURS 5 PIC 9.
      10 BDIV PIC 9.
      10 B-MOS-LOCATIONS OCCURS 5.
        15 B-MOS-DIVISIONS OCCURS 3.
          20 B-MOS-TRD-GRP PIC 9.
          20 B-MOS-INS-AMOUNT PIC 9(9).
          20 B-MOS-WMN-INDICATOR PIC X.
          20 B-MOS-WMN-CLASS-A PIC 99.
          20 B-MOS-WMN-CLASS-B PIC 99.
          20 B-MOS-WMN-CLASS-C PIC 99.
          20 B-MOS-WMN-CLASS-D PIC 99.
          20 B-MOS-WMN-CLASS-E PIC 99.
          20 B-MOS-WMN-CLASS-F PIC 99.
          20 B-MOS-PA-INDICATOR PIC X.
          20 B-MOS-PA-DATA.
            25 B-MOS-PA-CATG PIC 9.
            25 B-MOS-PA-INSTL PIC 9.
            25 B-MOS-PA-CLASS PIC X.
          20 B-MOS-BG-INDICATOR PIC X.
          20 B-MOS-TF-INDICATOR PIC X.
          20 B-MOS-TF-DATA.
            25 B-MOS-TF-CATG PIC 9.
            25 B-MOS-TF-AMOUNT PIC 9(9).
          20 B-MOS-TF-SURCD PIC 9(5)V99.
          20 B-MOS-TERR-MULT PIC 99V999.
          20 B-MOS-TF-RATE PIC 99V999.
          20 B-MOS-WMN-DSCT PIC 9(5)V99.
          20 B-MOS-PA-DSCT PIC 9(5)V99.
          20 B-MOS-BRG-DSCT PIC 9(5)V99.
          20 B-MOS-BASE-PREMIUM PIC 9(7).
          20 B-MOS-ADJ-PREMIUM PIC 9(7).
          20 B-MOS-ADJ-BASE-RATE-1 PIC 9(5)V99.
          20 B-MOS-ADJ-BASE-RATE-2 PIC 9(5)V99.
          20 B-MOS-ADJ-BASE-RATE-3 PIC 9(5)V99.
          20 B-MOS-PMOD-RATE-1 PIC 9(5)V99.
          20 B-MOS-SURCD-RATE PIC 9(5)V99.
          20 B-MOS-DSCTD-RATE PIC 9(5)V99.
          20 B-MOS-FINAL-PREMIUM PIC 9(7).
          20 B-MOS-PREMIUM PIC 9(7).
          20 B-MOS-TBL-RATE PIC 9(5)V99.
      10 B-MS-SAFE-CLASS OCCURS 5 PIC XX.
      10 B-MS-INS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-MS-CASH-INDICATOR OCCURS 5 PIC X.
      10 B-MS-CASH-DATA OCCURS 5.
        15 B-MS-CASH-TYPE PIC 9.
        15 B-MS-CASH-AMOUNT PIC 9(9).
      10 B-MS-KLS-INDICATOR OCCURS 5 PIC X.
      10 B-MS-KLS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-MS-SEC-INDICATOR OCCURS 5 PIC X.
      10 B-MS-TGS-INDICATOR OCCURS 5 PIC X.
      10 B-MS-WMN-INDICATOR OCCURS 5 PIC X.
      10 B-MS-WMN-CLASS-A OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-B OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-C OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-D OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-E OCCURS 5 PIC 99.
      10 B-MS-WMN-CLASS-F OCCURS 5 PIC 99.
      10 B-MS-SVA-INDICATOR OCCURS 5 PIC X.
      10 B-MS-SVA-DATA OCCURS 5.
        15 B-MS-SVA-SYSTEM PIC X.
        15 B-MS-SVA-INSTL PIC 9.
        15 B-MS-SVA-CLASS PIC X.
      10 B-MS-PAS-INDICATOR OCCURS 5 PIC X.
      10 B-MS-PAS-DATA OCCURS 5.
        15 B-MS-PAS-CATG PIC 9.
        15 B-MS-PAS-INSTL PIC 9.
        15 B-MS-PAS-CLASS PIC X.
      10 B-MS-CASH-SURCH OCCURS 5 PIC 9(5)V99.
      10 B-MS-KLS-SURCH OCCURS 5 PIC 9(5)V99.
      10 B-MS-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-MS-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MS-CASH OCCURS 5 PIC 9(5)V99.
      10 B-MS-KLS OCCURS 5 PIC 9(5)V99.
      10 B-MS-SURC-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MS-WMN-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-PA-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-SEC-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-24-HRS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-TEAR-GAS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-SAFE-VAULT-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MS-DSCT-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MS-PMOD-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MS-ADJ-BASE-RATE-1 OCCURS 5 PIC 9(5)V99.
      10 B-MS-ADJ-BASE-RATE-2 OCCURS 5 PIC 9(5)V99.
      10 B-MS-ADJ-BASE-RATE-3 OCCURS 5 PIC 9(5)V99.
      10 B-MS-BASIC-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-SCFM-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-CRCD-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-FINAL-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MS-MULT-EXP OCCURS 5 PIC 9(9).
      10 B-BFS-INS-AMOUNT OCCURS 5 PIC 9(4).
      10 B-BFS-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-BFS-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-BFS-SCFM-RATE OCCURS 5 PIC 99V999.
      10 B-BFS-FINAL-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFS-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFS-ADJ-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFS-ADJ-RATE-1 OCCURS 5 PIC 9(5)V99.
      10 B-BFS-ADJ-RATE-2 OCCURS 5 PIC 9(5)V99.
      10 B-BFS-ADJ-RATE OCCURS 5 PIC 9(5)V99.
      10 B-SBR-INS-AMOUNT OCCURS 5 PIC 9(4).
      10 B-SBR-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-SBR-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-SBR-SCFM-RATE OCCURS 5 PIC 99V99.
      10 B-SBR-FINAL-PREMIUM OCCURS 5 PIC 9(7).
      10 B-SBR-PREMIUM OCCURS 5 PIC 9(7).
      10 B-SBR-ADJ-PREMIUM OCCURS 5 PIC 9(7).
      10 B-SBR-ADJ-RATE-1 OCCURS 5 PIC 9(5)V99.
      10 B-SBR-ADJ-RATE-2 OCCURS 5 PIC 9(5)V99.
      10 B-SBR-ADJ-RATE OCCURS 5 PIC 9(5)V99.
      10 B-OBR-INS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-OBR-MSD-COVERAGE OCCURS 5 PIC X.
      10 B-OBR-MSD-AMOUNT OCCURS 5 PIC 9(9).
      10 B-OBR-MSD-MEDIA OCCURS 5 PIC X.
      10 B-OBR-MSD-SEC-ONLY OCCURS 5 PIC X.
      10 B-OBR-PSD-COVERAGE OCCURS 5 PIC X.
      10 B-OBR-PSD-PEOPLE OCCURS 5 PIC 9.
      10 BPPL PIC 9.
      10 B-OBR-BASIC-PREMIUM OCCURS 5 PIC 9(7)V99.
      10 B-OBR-WS-F OCCURS 5 PIC 9(5)V99.
      10 B-OBR-MSD-SURCH OCCURS 5 PIC 9(5)V99.
      10 B-OBR-ADJ-MSD-SURCH OCCURS 5 PIC 9(5)V99.
      10 B-OBR-ADJ-PREMIUM OCCURS 5 PIC 9(7)V99.
      10 B-OBR-ADJ-PREMIUM-2 OCCURS 5 PIC 9(7)V99.
      10 B-OBR-ADJ-1 OCCURS 5 PIC 9(7)V99.
      10 B-OBR-ADJ-2 OCCURS 5 PIC 9(7)V99.
      10 B-OBR-ADJ-3 OCCURS 5 PIC 9(7)V99.
      10 B-OBR-MSD-ADJ-1 OCCURS 5 PIC 9(5)V99.
      10 B-OBR-MSD-ADJ-2 OCCURS 5 PIC 9(5)V99.
      10 B-OBR-MSD-ADJ-3 OCCURS 5 PIC 9(5)V99.
      10 B-OBR-LOCATIONS OCCURS 5.
        15 B-OBR-PEOPLE OCCURS 5.
          20 B-OBR-PSD-AMOUNT PIC 9(9).
          20 B-OBR-PSD-SURCH PIC 9(5)V99.
          20 B-OBR-PSD-ADJ-1 PIC 9(4)V99.
          20 B-OBR-PSD-ADJ-2 PIC 9(5)V99.
          20 B-OBR-PSD-ADJ-3 PIC 9(5)V99.
      10 B-BF-IP-COVERAGE OCCURS 5 PIC X.
      10 B-BF-OP-COVERAGE OCCURS 5 PIC X.
      10 B-BF-AV-COVERAGE OCCURS 5 PIC X.
      10 B-BF-SEC-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-INS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-BFI-SAFE-CLASS OCCURS 5 PIC XX.
      10 B-BFI-TGS-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-WMN-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-WMN-CLASS-A OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-B OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-C OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-D OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-E OCCURS 5 PIC 99.
      10 B-BFI-WMN-CLASS-F OCCURS 5 PIC 99.
      10 B-BFI-GUARDS-IND OCCURS 5 PIC X.
      10 B-BFI-FT-GUARDS OCCURS 5 PIC 99.
      10 B-BFI-PBA-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-HAPS-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-BAS-INDICATOR OCCURS 5 PIC X.
      10 B-BFI-BAS-DATA OCCURS 5.
        15 B-BFI-BAS-KIND PIC X.
        15 B-BFI-BAS-INSTL PIC 9.
        15 B-BFI-BAS-CLASS PIC X.
      10 B-BFI-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-BFI-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-BFI-WMN-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-SEC-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-24-HR-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-TEAR-GAS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-PBA-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-GUARD-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-HAPS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-BAS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-BFI-PMOD-RATE OCCURS 5 PIC 9(5)V99.
      10 B-BFI-ADJ-BASE-RTE-1 OCCURS 5 PIC 9(5)V99.
      10 B-BFI-ADJ-BASE-RTE-2 OCCURS 5 PIC 9(5)V99.
      10 B-BFI-ADJ-RATE OCCURS 5 PIC 9(5)V99.
      10 B-BFI-BASIC-PREM OCCURS 5 PIC 9(7).
      10 B-BFI-FINAL-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFI-PREMIUM OCCURS 5 PIC 9(7).
      10 B-BFI-MULT-EXP OCCURS 5 PIC 9(9).
      10 B-BFO-NO-MSGRS OCCURS 5 PIC 99.
      10 B-BFO-LOCATIONS OCCURS 5.
        15 B-BFO-MESSENGERS OCCURS 5.
          20 B-BFO-MSGR-GUARDS PIC 99.
          20 B-BFO-INS-AMOUNT PIC 9(9).
          20 B-BFO-PC-INDICATOR PIC X.
          20 B-BFO-MSGR-BAG-IND PIC X.
          20 B-BFO-MSGR-BAG-CLASS PIC X.
          20 B-BFO-RR-INDICATOR PIC X.
          20 B-BFO-TERR-MULT PIC 99V999.
          20 B-BFO-TBL-RATE PIC 9(5)V99.
          20 B-BFO-SEC-DSCT PIC 9(5)V99.
          20 B-BFO-24-HR-DSCT PIC 9(5)V99.
          20 B-BFO-MSG-BAG-DSCT PIC 9(5)V99.
          20 B-BFO-PC-DSCT PIC 9(5)V99.
          20 B-BFO-RR-DSCT PIC 9(5)V99.
          20 B-BFO-PMOD-RATE PIC 9(5)V99.
          20 B-BFO-ADJ-RATE-1 PIC 9(5)V99.
          20 B-BFO-ADJ-RATE-2 PIC 9(5)V99.
          20 B-BFO-ADJ-RATE PIC 9(5)V99.
          20 B-BFO-BASIC-PREM PIC 9(7).
          20 B-BFO-FINAL-PREMIUM PIC 9(7).
          20 B-BFO-PREMIUM PIC 9(7).
          20 B-BFO-MULT-EXP PIC 9(7).
      10 B-BFA-VEHICLES OCCURS 5 PIC 99.
      10 BAMV PIC 9.
      10 B-BFA-LOCATIONS OCCURS 5.
        15 B-BFA-VEH OCCURS 5.
          20 B-BFA-VEH-INSURANCE PIC 9(9).
          20 B-BFA-TERR-MULT PIC 99V999.
          20 B-BFA-TBL-RATE PIC 9(5)V99.
          20 B-BFA-SEC-DSCT PIC 9(5)V99.
          20 B-BFA-PC-DSCT PIC 9(5)V99.
          20 B-BFA-PMOD-RATE PIC 9(5)V99.
          20 B-BFA-ADJ-RATE-1 PIC 9(5)V99.
          20 B-BFA-ADJ-RATE-2 PIC 9(5)V99.
          20 B-BFA-ADJ-RATE PIC 9(5)V99.
          20 B-BFA-BASIC-PREM PIC 9(7).
          20 B-BFA-FINAL-PREMIUM PIC 9(7).
          20 B-BFA-PREMIUM PIC 9(7).
          20 B-BFA-MULT-EXP PIC 9(7).
      10 B-MR-IP-COVERAGE OCCURS 5 PIC X.
      10 B-MR-OP-COVERAGE OCCURS 5 PIC X.
      10 B-MR-SEC-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-INS-AMOUNT OCCURS 5 PIC 9(9).
      10 B-MRI-DUTY-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-BRE-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-BREAS-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-TGS-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-GUARDS-INDICATOR OCCURS 5 PIC 99.
      10 B-MRI-PBA-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-HAPS-INDICATOR OCCURS 5 PIC X.
      10 B-MRI-TERR-MULT OCCURS 5 PIC 99V999.
      10 B-MRI-IP-SW OCCURS 5 PIC X.
      10 B-MRI-MP-EXCEP.
        15 B-MRI-MP-CLASS-1 OCCURS 5.
          20 B-MRI-MP-CL1-1 PIC 999.
          20 B-MRI-MP-CL1-2 PIC 999.
        15 B-MRI-MP-CLASS-2 OCCURS 5.
          20 B-MRI-MP-CL2-1 PIC 999.
          20 B-MRI-MP-CL2-2 PIC 999.
        15 B-MRI-MP-CLASS-3 OCCURS 5.
          20 B-MRI-MP-CL3-1 PIC 999.
          20 B-MRI-MP-CL3-2 PIC 999.
        15 B-MRI-MP-CLASS-4 OCCURS 5.
          20 B-MRI-MP-CL4-1 PIC 999.
          20 B-MRI-MP-CL4-2 PIC 999.
      10 B-MRI-TBL-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MRI-SEC-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-BRE-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-BREAS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-TGS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-GUARD-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-PBA-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-HAPS-DSCT OCCURS 5 PIC 9(5)V99.
      10 B-MRI-PMOD-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MRI-ADJ-RATE-1 OCCURS 5 PIC 9(5)V99.
      10 B-MRI-ADJ-RATE-2 OCCURS 5 PIC 9(5)V99.
      10 B-MRI-ADJ-BASE-RATE OCCURS 5 PIC 9(5)V99.
      10 B-MRI-BASIC-PREM OCCURS 5 PIC 9(7).
      10 B-MRI-FINAL-PREM OCCURS 5 PIC 9(7).
      10 B-MRI-PREMIUM OCCURS 5 PIC 9(7).
      10 B-MRI-MULT-EXP OCCURS 5 PIC 9(9).
      10 B-MRO-MESSENGERS OCCURS 5 PIC 99.
      10 BMSGR PIC 99.
      10 B-MRO-LOCATIONS OCCURS 5.
        15 B-MRO-MSGRS OCCURS 5.
          20 B-MRO-NO-GUARDS PIC 99.
          20 B-MRO-INS-AMOUNT PIC 9(9).
          20 B-MRO-BSSW-INDICATOR PIC X.
          20 B-MRO-BSSW-CLASS PIC X.
          20 B-MRO-PC-INDICATOR PIC X.
          20 B-MRO-RR-INDICATOR PIC X.
          20 B-MRO-TERR-MULT PIC 99V999.
          20 B-MRO-MULT-EXP PIC 9(7).
          20 B-MRO-TBL-RATE PIC 9(5)V99.
          20 B-MRO-SEC-DSCT PIC 9(5)V99.
          20 B-MRO-MSG-BAG-DSCT PIC 9(5)V99.
          20 B-MRO-PC-DSCT PIC 9(5)V99.
          20 B-MRO-RR-DSCT PIC 9(5)V99.
          20 B-MRO-PMOD-RATE PIC 9(5)V99.
          20 B-MRO-ADJ-RATE-1 PIC 9(5)V99.
          20 B-MRO-ADJ-RATE-2 PIC 9(5)V99.
          20 B-MRO-ADJ-RATE PIC 9(5)V99.
          20 B-MRO-BASIC-PREM PIC 9(7).
          20 B-MRO-FINAL-PREM PIC 9(7).
          20 B-MRO-PREMIUM PIC 9(7).
      15 B-MRO-3YR-PREMIUM PIC 9(7).
      15 B-MRO-ANNUAL-DPP PIC 9(7).
    10 B-IK-NO-BEDROOMS OCCURS 5 PIC 9(4).
    10 B-IK-POLICY-INCR OCCURS 5 PIC 9(9).
    10 B-IK-EXCLUSIONS OCCURS 5 PIC 9(6).
    10 B-IK-EXCLUDES.
      15 B-IK-EXCLS OCCURS 5.
        20 B-IK-EXCL OCCURS 6 PIC X.
    10 B-IK-EXCLUDE REDEFINES B-IK-EXCLUDES.
      15 B-IK-EXCLUD OCCURS 5.
        20 B-IK-EXCL-1 PIC X.
        20 B-IK-EXCL-2 PIC X.
        20 B-IK-EXCL-3 PIC X.
        20 B-IK-EXCL-4 PIC X.
        20 B-IK-EXCL-5 PIC X.
        20 B-IK-EXCL-6 PIC X.
    10 B-IK-BASE-PREMIUM OCCURS 5 PIC 9(7).
    10 B-IK-ADJ-PREMIUM OCCURS 5 PIC 9(7).
    10 B-IK-MP-SW OCCURS 5 PIC X.
    10 B-IK-PI-RATE OCCURS 5 PIC 9(5)V99.
    10 B-IK-PI-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E1-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E2-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E3-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E4-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-E5-SURCHG OCCURS 5 PIC 9(7).
    10 B-IK-DSCTD-PREMIUM OCCURS 5 PIC 9(7).
    10 B-IK-3YR-PREMIUM OCCURS 5 PIC 9(7).
    10 B-IK-ANNUAL-DPP OCCURS 5 PIC 9(7).
    10 B-ET-TYPE-COVERAGE OCCURS 5 PIC 9.
    10 B-ET-NO-EMPLOYEES OCCURS 5 PIC 99.
    10 B-ET-GROUP-AMOUNT OCCURS 5 PIC 9(9).
    10 B-ET-RATE OCCURS 5 PIC 9(7).
    10 B-ET-ADJ-RATE OCCURS 5 PIC 9(7).
    10 B-ET-INDIVIDUAL-LIMITS.
      15 B-ET-INDIV-LIMIT OCCURS 5.
        20 B-ET-LIMIT OCCURS 20 PIC 9(9).
    10 B-ET-INDIV-LIM REDEFINES B-ET-INDIVIDUAL-LIMITS.
      15 B-ET-IND-LIM OCCURS 5.
        20 B-ET-LIMIT-1 PIC 9(9).
        20 B-ET-LIMIT-2 PIC 9(9).
        20 B-ET-LIMIT-3 PIC 9(9).
        20 B-ET-LIMIT-4 PIC 9(9).
        20 B-ET-LIMIT-5 PIC 9(9).
        20 B-ET-LIMIT-6 PIC 9(9).
        20 B-ET-LIMIT-7 PIC 9(9).
        20 B-ET-LIMIT-8 PIC 9(9).
        20 B-ET-LIMIT-9 PIC 9(9).
        20 B-ET-LIMIT-10 PIC 9(9).
        20 B-ET-LIMIT-11 PIC 9(9).
        20 B-ET-LIMIT12 PIC 9(9).
        20 B-ET-LIMIT-13 PIC 9(9).
        20 B-ET-LIMIT-14 PIC 9(9).
        20 B-ET-LIMIT-15 PIC 9(9).
        20 B-ET-LIMIT-16 PIC 9(9).
        20 B-ET-LIMIT-17 PIC 9(9).
        20 B-ET-LIMIT-18 PIC 9(9).
        20 B-ET-LIMIT-19 PIC 9(9).
        20 B-ET-LIMIT-20 PIC 9(9).
    10 B-ET-MOD-RATE OCCURS 5 PIC 9(7).
    10 B-ET-BASIC-PREMIUM OCCURS 5 PIC 9(7).
    10 B-ET-MP-SW OCCURS 5 PIC X.
    10 B-ET-3YR-PREMIUM OCCURS 5 PIC 9(7).
    10 B-ET-ANNUAL-DPP OCCURS 5 PIC 9(7).
    10 B-CH-OPTION OCCURS 5 PIC 9.
    10 B-CH-INS-AMOUNT OCCURS 5 PIC 9(9).
    10 B-CH-MS-AMOUNT OCCURS 5 PIC 9(9).
    10 B-CH-PP-AMOUNT OCCURS 5 PIC 9(9).
    10 B-CH-MS-OPTION OCCURS 5 PIC X.
    10 B-CH-PP-OPTION OCCURS 5 PIC X.
    10 B-CH-BASIC-PREMIUM OCCURS 5 PIC 9(7).
    10 B-CH-ADJ-PREMIUM OCCURS 5 PIC 9(7).
    10 B-CH-MP-SW OCCURS 5 PIC X.
    10 B-CH-PREMIUM OCCURS 5 PIC 9(7).
    10 B-CH-MS-SURCHG OCCURS 5 PIC 9(7).
    10 B-CH-ADJ-MS-SURCHG OCCURS 5 PIC 9(7).
    10 B-CH-PP-SURCHG OCCURS 5 PIC 9(7).
    10 B-CH-ADJ-PP-SURCHG OCCURS 5 PIC 9(7).
    10 B-CH-3YR-PREMIUM OCCURS 5 PIC 9(7).
    10 B-CH-ANNUAL-DPP OCCURS 5 PIC 9(7).
    10 SEC-BRG-END-ITEM PIC X.
 03 SECTION-TWO-BILL PIC X(40000).
 03 SECTWOBILL REDEFINES SECTION-TWO-BILL.
  05 SEC-TWO-COM-MAP.
    10 CLS-CDE-CTL-BLK OCCURS 30.
      15 COVERAGE-SWITCHES.
        20 S2-BASE PIC X.
        20 S2-DPDCOVSW PIC X.
        20 S2-XCUCOVSW PIC X.
        20 S2-WATEREXC PIC X.
        20 S2-LESSORSW PIC X.
        20 S2-VENDORSW PIC X.
        20 S2-ARCHSW PIC X.
        20 S2-EMPSW PIC X.
        20 S2-GOVALLSW PIC X.
        20 S2-GOVOCPSW PIC X.
        20 S2-COMPSW PIC X.
        20 S2-KULAS-PRV PIC X.
      15 DATA-SWITCHS.
        20 BASE.
          25 S2-TERSW PIC X.
          25 S2-CLASSW PIC X.
          25 S2-BIRATESW PIC X.
          25 S2-BIMINSW PIC X.
          25 S2-PDRATESW PIC X.
          25 S2-PDMINSW PIC X.
          25 S2-EXPOSESW PIC X.
        20 DPD.
          25 S2-DPDYNSW PIC X.
          25 S2-DEDAMTSW PIC X.
          25 S2-DEDTYPSW PIC X.
        20 XCU.
          25 S2-XCUSW PIC X.
        20 WATER.
          25 S2-WATERSW PIC X.
        20 LESSOR.
          25 S2-QUALIFY PIC X.
        20 VENDOR.
          25 S2-VENDTYPE PIC X.
          25 S2-VBASESW PIC X.
        20 ARCH.
          25 S2-ARCHCOVG PIC X.
        20 EMP.
          25 S2-EMPCOVG PIC X.
        20 GOVA.
          25 S2-GOVUSESW PIC X.
          25 S2-GOVNOSW PIC X.
          25 S2-GOVALLCV PIC X.
        20 GOVO.
          25 S2-GOVOCPCV PIC X.
          25 S2-OCPBASW PIC X.
        20 CPL.
          25 S2-ACRESW PIC X.
      15 DATA-ELEMENTS.
        20 BASE.
          25 S2-STATE PIC 99.
          25 S2-AREA PIC 99.
          25 S2-CLASS PIC X(12).
          25 S2-CLASSX PIC X(12).
          25 S2-BIRATE PIC 9(4)V9(4).
          25 S2-BIMIN PIC 9(4)V9(4).
          25 S2-PDRATE PIC 9(4)V9(4).
          25 S2-PDMIN PIC 9(4)V9(4).
          25 S2-PREMBASE PIC 9(12).
        20 DPD.
          25 S2-DPD PIC X.
          25 S2-DEDUCT PIC 9(4).
          25 S2-DEDTYPE PIC X.
        20 XCU.
          25 S2-XCU PIC X.
        20 WATER.
          25 S2-WATER PIC X.
        20 LESSOR.
          25 S2-LESSOR PIC X.
          25 S2-LESS50 PIC V99.
        20 VENDOR.
          25 S2-VENDOR PIC X.
          25 S2-VENDBASE PIC 9(8).
        20 ARCH.
          25 S2-INTARCH PIC X.
        20 EMP.
          25 S2-INTEMP PIC X.
        20 GOVA.
          25 S2-GOVUSE PIC X.
          25 S2-GOVNUMB PIC 99.
          25 S2-GOVTALL PIC X.
        20 GOVO.
          25 S2-GOVTOCP PIC X.
          25 S2-OCPBASE PIC 99.
        20 CPL.
          25 S2-CPACRES PIC X.
      15 INDICATIVE-INFORMATION.
        20 BASE.
          25 S2-FILECODE PIC 99.
          25 S2-PRMBASE PIC 99.
          25 S2-DESCRIBE PIC X(60).
          25 S2-RATEKEY PIC 99.
          25 S2-FACTOR PIC 9(9).
          25 S2-UNIT PIC 9(7)V99.
          25 S2-MINKEY PIC 99.
          25 S2-MINSAVEBI-LOC PIC 9(3)V99.
          25 S2-MINSAVEBI-POL PIC 9(3)V99.
          25 S2-MINSAVEPD-LOC PIC 9(3)V99.
          25 S2-MINSAVEPD-POL PIC 9(3)V99.
          25 S2-XCU-BI-RATE PIC 9V9(3).
          25 S2-XCU-BI-PREM PIC 9(3)V99.
          25 S2-XCU-PD-RATE PIC 9V9(3).
          25 S2-XCU-PD-PREM PIC 9(3)V99.
        20 DPD.
          25 S2-DEDRATE PIC V99.
        20 XCU.
          25 S2-BIXCURAT PIC 9V999.
          25 S2-BIXCUMIN PIC 999V99.
          25 S2-PDXCURAT PIC 9V999.
          25 S2-PDXCUMIN PIC 999V99.
        20 WATER.
          25 S2-WATER80 PIC V99.
          25 S2-WATRPREM PIC V999.
        20 VENDOR.
          25 S2-VPERCENT PIC V99.
          25 S2-VEND100 PIC 9(3).
          25 S2-VENDUNIT PIC 9(7).
        20 ARCH.
          25 S2-ARCH10 PIC V99.
        20 EMP.
          25 S2-EMP10 PIC V99.
        20 GOVA.
          25 S2-GOVALLBI PIC 9V99.
          25 S2-GOVALLPD PIC 9V99.
             20 GOVO.
          25 S2-GOVOCPBI PIC V99.
          25 S2-GOVOCPPD PIC V99.
        20 CPL.
          25 S2-ACRECHG PIC 9V99.
          25 S2-PERATE PIC 99V99.
        20 INCRLIM.
          25 S2-INCRLIMA-BI PIC 9V99.
          25 S2-INCRLIMB-BI PIC 9V99.
          25 S2-INCRLIMA-PD PIC 9V99.
          25 S2-INCRLIMB-PD PIC 9V99.
    10 OTH-CTL-WRD.
      15 SUBSCRIPTS.
        20 SUB1 PIC 99.
        20 Q REDEFINES SUB1 PIC 99.
      15 FOUNDATION.
        20 S2-FOUND PIC X.
        20 S2-PDSWITCH PIC X.
        20 S2-BISWITCH PIC X.
        20 S2-PDOCCUR PIC 9(8).
        20 S2-BIOCCUR PIC 9(8).
        20 S2-BIAGGR PIC 9(8).
        20 S2-PDAGGR PIC 9(8).
      15 OTHER.
        20 S2-OTHERSW PIC X.
        20 OTHER.
          25 S2-OTHERCVG PIC X.
          25 S2-INTOTHER PIC X.
          25 S2-OTHER10 PIC V99.
      15 INJURY.
        20 S2-INJURYSW PIC X.
        20 INJURY.
          25 S2-PINJURY PIC X.
          25 S2-PERSINJ PIC X.
          25 S2-INJURY15 PIC V99.
      15 MED.
        20 S2-MEDPAYSW PIC X.
        20 MED.
          25 S2-MEDICAL PIC X.
          25 S2-MEDLIMSW PIC X.
          25 S2-MEDPAY PIC X.
          25 S2-MEDLIMP PIC 9(4).
          25 S2-MEDLIMA PIC 9(5).
          25 S2-MEDMA1 PIC 9V999.
          25 S2-MEDMB1 PIC 9V999.
          25 S2-MEDMA2 PIC 9V999.
          25 S2-MEDMB2 PIC 9V999.
          25 S2-MEDMA3 PIC 9V999.
          25 S2-MEDMB3 PIC 9V999.
          25 S2-MEDMA4 PIC 9V999.
          25 S2-MEDMB4 PIC 9V999.
          25 S2-MINMA1 PIC 99V99.
          25 S2-MINMB1 PIC 99V99.
          25 S2-MINMA2 PIC 99V99.
          25 S2-MINMB2 PIC 99V99.
          25 S2-MINMA3 PIC 99V99.
          25 S2-MINMB3 PIC 99V99.
          25 S2-MINMA4 PIC 99V99.
          25 S2-MINMB4 PIC 99V99.
      15 CLP.
          25 S2-CPLSW PIC X.
          25 S2-PERLIMSW PIC X.
          25 S2-CPLLIM PIC 9(6).
          25 S2-PERLIM PIC 9(4).
  05 SAM-DATA.
    10 DUMMY.
      15 S2-OTHER-BODY-PREM PIC 9(6)V9(2).
      15 S2-OTHER-PROP-PREM PIC 9(6)V9(2).
      15 S2-PI-ONLY-PREM PIC 9(6)V9(2).
      15 S2-MED-ONLY-PREM PIC 9(6)V9(2).
    10 RATE-TABLE OCCURS 30.
      15 S2-EMP-BODY-PREM PIC 9(6)V9(2).
      15 S2-EMP-PROP-PREM PIC 9(6)V9(2).
      15 S2-ARC-BODY-PREM PIC 9(6)V9(2).
      15 S2-ARC-PROP-PREM PIC 9(6)V9(2).
      15 S2-VEND-BODY-PREM PIC 9(6)V9(2).
      15 S2-VEND-PROP-PREM PIC 9(6)V9(2).
      15 S2-OCP-BODY-PREM PIC 9(6)V9(2).
      15 S2-OCP-PROP-PREM PIC 9(6)V9(2).
      15 S2-GOVALL-BODY-PREM PIC 9(6)V9(2).
      15 S2-GOVALL-PROP-PREM PIC 9(6)V9(2).
      15 S2-CPL-ONLY-PREM PIC 9(6)V9(2).
      15 S2-BODILY-PREM PIC 9(6)V9(2).
      15 S2-PROP-PREM PIC 9(6)V9(2).
      15 S2-EMPBIPRM PIC 9(6)V9(2).
      15 S2-EMPPDPRM PIC 9(6)V9(2).
    10 ABC.
      15 SECTION2-TOTAL PIC 9(6)V99.
      15 S2-GROUPA PIC 9(4)V9(4).
      15 S2-GROUPB PIC 9(4)V9(4).
      15 S2-GROUPC PIC 9(4)V9(4).
      15 S2-GROUPD PIC 9(4)V9(4).
      15 S2-GROUPE PIC 9(4)V9(4).
      15 S2-GROUPF PIC 9(4)V9(4).
      15 S2-GROUPG PIC 9(4)V9(4).
      15 S2-GROUPH PIC 9(4)V9(4).
      15 S2-OTHBIPRM PIC 9(6)V9(2).
      15 S2-OTHPDPRM PIC 9(6)V9(2).
      15 DUMM OCCURS 30.
        20 S2-BIRATE9 PIC 9(6)V9(2).
        20 S2-PDRATE9 PIC 9(6)V9(2).
        20 S2-MOD1 PIC 9V9(3).
        20 S2-MOD2 PIC 9V9(3).
        20 S2-MOD3 PIC 9V9(3).
        20 S2-ARCBIPRM PIC 9(6)V9(2).
        20 S2-ARCPDPRM PIC 9(6)V9(2).
        20 S2-OCPPRMPD PIC 9V9(2).
        20 S2-OCPPRMBI PIC 9(6)V9(2).
        20 S2-GOVPRMBI PIC 9(6)V9(2).
        20 S2-GOVPRMPD PIC 9(6)V9(2).
        20 S2-VNDPRMBI PIC 9(6)V9(2).
        20 S2-VNDPRMPD PIC 9(6)V9(2).
        20 S2-WORKBI PIC 9(4)V9(4).
        20 S2-WORKPD PIC 9(4)V9(4).
        20 S2-CPLPREM PIC 9(6)V9(2).
      15 DUMDUM.
        20 S2-PIPREM PIC 9(6)V9(2).
        20 S2-MEDPREM PIC 9(6)V9(2).
        20 S2-BIRESULT PIC 9(3)V9(1).
        20 S2-PDRESULT PIC 9(3)V9(1).
        20 S2-CHARGE5 PIC 9(1).
        20 S2-CNTR PIC 99.
        20 S2-BIFLAT PIC 9(6)V9(2).
        20 S2-PDFLAT PIC 9(6)V9(2).
        20 S2-PROMPTS PIC X(20).
        20 S2-BIGSW PIC X.
    10 BLANKET-CONTR-LIAB.
      15 SWITCHES.
        20 S2-BLANKCVG PIC X.
        20 S2-BLANKSW PIC X.
      15 DATA-ITEMS.
        20 S2-BLANKET PIC X.
        20 S2-BLANKET10 PIC V99.
        20 S2-BLNK-BODY-PREM PIC 9(6)V99.
        20 S2-BLNK-PROP-PREM PIC 9(6)V99.
    10 S2-INTER-RESULTS OCCURS 30.
      15 S2-BIRATE8 PIC 9(4)V9(4).
      15 S2-PDRATE8 PIC 9(4)V9(4).
      15 S2-BIRATE4 PIC 9(4)V9(4).
      15 S2-PDRATE4 PIC 9999V9999.
      15 S2-BIRATE5 PIC 9999V9999.
      15 S2-PDRATE5 PIC 9999V9999.
      15 S2-CPLRATE2 PIC 9999V9999.
      15 S2-CPLRATE3 PIC 9999V9999.
      15 S2-CPLRATE4 PIC 999V9999.
      15 S2-CPLRATE6 PIC 9999V9999.
    10 CONCESSIONAIRES OCCURS 30.
      15 S2-CONCESCVG PIC X.
      15 S2-CONCESW PIC X.
      15 S2-CONCES PIC X.
      15 S2-CONCES25 PIC V99.
    10 PROFESSIONAL-LIABILITY-LIMITS.
      15 S2-DRUGLIMCVG PIC X.
      15 S2-DRUGLIMSW PIC X.
      15 S2-DRUGOCCUR PIC 9(8).
      15 S2-DRUGAGGR PIC 9(8).
      15 S2-DENTLIMCVG PIC X.
      15 S2-DENTLIMSW PIC X.
      15 S2-DENTOCCUR PIC 9(8).
      15 S2-NTAGGR PIC 9(8).
      15 S2-VETLIMCVG PIC X.
      15 S2-VETLIMSW PIC X.
      15 S2-VETOCCUR PIC 9(8).
      15 S2-VETAGGR PIC 9(8).
      15 S2-OPTLIMCVG PIC X.
      15 S2-OPTLIMSW PIC X.
      15 S2-OPTOCCUR PIC 9(8).
      15 S2-OPTAGGR PIC 9(8).
      15 S2-MORTLIMCVG PIC X.
      15 S2-MORTLIMSW PIC X.
      15 S2-MORTOCCUR PIC 9(8).
      15 S2-MORTAGGR PIC 9(8).
      15 S2-BEAUTLIMCVG PIC X.
      15 S2-BEAUTLIMSW PIC X.
      15 S2-BEAUTOCCUR PIC 9(8).
      15 S2-BEAUTAGGR PIC 9(8).
      15 S2-WIGLIMCVG PIC X.
      15 S2-WIGLIMSW PIC X.
      15 S2-WIGOCCUR PIC 9(8).
      15 S2-WIGAGGR PIC 9(8).
    10 CONCESSIONAIRES-CALC OCCURS 30.
      15 S2-CONBIPRM PIC 9(6)V99.
      15 S2-CON-BODY-PREM PIC 9(6)V99.
    10 SEC-2-END-ITEM PIC X.
PROCEDURE DIVISION.
SUPER-MON.
    DISPLAY 'GOT-SUPER0'.
    MOVE 0 TO DISAS-SW.
    MOVE 2 TO ACTION-SW.
    CALL  DISAST  USING COMMON-AREA.
    DISPLAY 'BACK IN SUPER0'.
    MOVE 0 TO SEC-NO.
020-CALL-USER-ID.
*   CALL  UID   USING USER-ID-WK1.
    DISPLAY 'TYPE USER-ID'
    ACCEPT USER-ID-WK1.
    MOVE USER-ID-WK1 TO USER-ID-WK.
    MOVE USR-ID4  TO CTRKEY.
030-OPEN-CNTROL-FILE.
    OPEN INPUT  CONTROL-FILE.
    READ CONTROL-FILE INVALID KEY   DISPLAY 
    'INVALID USER I.D. ABORT JOB ', USER-ID-WK
    GO TO EOJ-RTN.
    MOVE CNT-USER-LIMIT TO COM-USER-LIMIT.
    MOVE CNT-BRANCH    TO COM-BRANCH-NO.
    CLOSE CONTROL-FILE.
040-DISPLAY.
    DISPLAY 'DO YOU WISH TO CREATE A NEW QUOTE (N),'.
    DISPLAY 'CHANGE AN OLD QUOTE (O), OR'.
    DISPLAY 'CONTINUE THE CURRENT QUOTE (C) ?'.
042-AGAIN.
    DISPLAY 'ENTER N OR C OR O '.
    ACCEPT NCR-MESG.
    IF  NCR-MESG = 'N' OR 'C' OR 'O'
    NEXT SENTENCE  ELSE GO TO 042-AGAIN.
    MOVE NCR-MESG TO COM-SESSION-TYPE.
    IF COM-SESSION-TYPE = 'N' GO TO 100-2A.
    MOVE 2 TO ACTION-SW.
    IF COM-SESSION-TYPE = 'O' GO TO 050-OLD-QUOTE.
    CALL  DISAST  USING COMMON-AREA.
    DISPLAY 'BACK IN SUPER0'.
    MOVE 2 TO RESTART-SW.
    GO TO 100-2A.
050-OLD-QUOTE.
*   CALL   URSTRT  USING COMMON-AREA.
    MOVE 1 TO RESTART-SW.
100-2A.
    IF RESTART-SW NOT = 1 GO TO 100-2B.
    IF FIRST-TIME = 1 GO TO 100-CONTINUE-RESTART.
    MOVE 1 TO FIRST-TIME.
100-2C.
    DISPLAY 'WHICH SECTION (0,1,2) DO YOU WANT TO CHANGE '.
    ACCEPT SEC-MESG.
    IF SEC-MESG = 0 OR 1 OR 2 NEXT SENTENCE ELSE
    DISPLAY 'INVALID SECTION NUMBER, ENTER AGAIN'
    GO TO 100-2C.
    MOVE SEC-MESG TO SEC-NO.
    PERFORM 300-CALL-SECTION THRU 300-EXIT.
    GO TO 100-2A.
100-CONTINUE-RESTART.
    DISPLAY 'DO YOU WANT TO CHANGE ANOTHER SECTION (Y) OR (N)'.
    ACCEPT NCR-MESG.
    IF NCR-MESG = 'Y' OR 'N' NEXT SENTENCE ELSE
    DISPLAY 'INVALID RESPONSE S/B (Y) OR (N), ENTER AGAIN'
    GO TO 100-CONTINUE-RESTART.
    IF NCR-MESG = 'Y' GO TO 100-2C.
100-2D.
    MOVE 3 TO RESTART-SW.
    MOVE 1 TO ALL-SIXES.
    MOVE 0 TO FIRST-TIME SEC-NO.
    GO TO 100-2A.
100-2B.
    PERFORM 300-CALL-SECTION THRU 300-EXIT.
    IF CALL-SEC-NO NOT > 2 GO TO 100-2A.
    IF RESTART-SW NOT > 2 GO TO 100-2D.
    IF RESTART-SW NOT = 3 GO TO 200-OPW-RTN.
    IF ALL-SIXES NOT = 1 GO TO 100-2D.
    MOVE 4 TO RESTART-SW.
    GO TO 400-4A.
200-OPW-RTN.
    DISPLAY 'DO YOU WANT TO SEE A FORMAL QUOTE (F),'.
    DISPLAY 'ROUGH QUOTE (R), WORKSHEET (W),'.
    DISPLAY 'OR DO YOU NOT WANT ANY OUTPUT (N).'.
    ACCEPT NCR-MESG.
    IF NCR-MESG = 'F' OR 'R' OR 'W' OR 'N' NEXT SENTENCE ELSE
    DISPLAY 'INVALID RESPONSE S/B (F), (R), (W), OR (N)'
    DISPLAY 'ENTER AGAIN' GO TO 200-OPW-RTN.
    IF NCR-MESG = 'N' GO TO 600-6A.
    MOVE NCR-MESG TO PRINT-TYPE.
    PERFORM 500-CALL-OPW THRU 500-EXIT.
    GO TO 600-6A.
300-CALL-SECTION.
    ADD 1 SEC-NO GIVING CALL-SEC-NO.
    GO TO FETCH-1 FETCH-2 FETCH-3 FETCH-4
    DEPENDING ON CALL-SEC-NO.
FETCH-1.
    CALL   ZUSEC0  USING COMMON-AREA.
    DISPLAY 'BACK IN SUPER0'.
    GO TO 300-OUT.
FETCH-2.
*   CALL  'ZUSEC1'.
    GO TO 300-OUT.
FETCH-3.
*   CALL  'KSUPR2'.
    GO TO 300-OUT.
FETCH-4.
    GO TO 300-OUT.
300-OUT.
    IF CALL-SEC-NO > 3 MOVE 0 TO SEC-NO ELSE
    ADD 1 TO SEC-NO.
300-EXIT.
    EXIT.
400-4A.
    GO TO 100-2A.
500-CALL-OPW.
    IF PRINT-TYPE = 'W'
    MOVE 3 TO S0-PRINT-SW
    GO TO 500-OPWS1.
    IF PRINT-TYPE = 'R'
    MOVE 1 TO S0-PRINT-SW
    GO TO 500-OPW1T.
    MOVE 2 TO S0-PRINT-SW.
    GO TO 500-OPWS1.
500-OPW1T.
*    CALL 'OPW1T'.
    GO TO 500-EXIT.
500-OPWS1.
*   CALL 'OPWS1'.
500-EXIT.
    EXIT.
600-6A.
    DISPLAY 'DO YOU WANT TO CHANGE THE QUOTE YOU HAVE '.
    DISPLAY 'JUST SEEN? (Y) OR (N).'.
    ACCEPT NCR-MESG.
    IF NCR-MESG = 'Y' OR 'N' NEXT SENTENCE ELSE
    DISPLAY 'INVALID RESPONSE S/B (Y) OR (N)'
    GO TO 600-6A.
    IF NCR-MESG = 'Y' MOVE 1 TO RESTART-SW GO TO 100-2A.
600-6B.
    DISPLAY 'DO YOU WANT TO SAVE THE QUOTE YOU HAVE JUST'.
    DISPLAY 'SEEN IN YOUR LIBRARY? (Y) OR (N).'.
    ACCEPT NCR-MESG.
    IF NCR-MESG = 'Y' OR 'N' NEXT SENTENCE ELSE
    DISPLAY 'INVALID RESPONSE S/B (Y) OR (N)'
    GO TO 600-6B.
    IF NCR-MESG = 'N' GO TO 600-6C.
    MOVE 1 TO ACTION-SW.
*   CALL   'URSTRT' USING COMMON-AREA.
600-6C.
    DISPLAY 'DO YOU WANT TO TERMINATE THIS SESSION? (Y) OR (N).'.
    ACCEPT NCR-MESG.
    IF NCR-MESG = 'Y' OR 'N' NEXT SENTENCE ELSE
    DISPLAY 'INVALID RESPONSE  S/B (Y) OR (N)'
    GO TO 600-6C.
    IF NCR-MESG = 'N' GO TO SUPER-MON.
EOJ-RTN.
    STOP RUN.
  |L