IDENTIFICATION DIVISION.
PROGRAM-ID. TESTFI.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
        SELECT FILE1 ASSIGN TO DSK.
        SELECT FILE2 ASSIGN TO DSK.
DATA DIVISION.
FILE SECTION.
FD FILE1 VALUE OF ID IS 'EEEEEEEEE'.
01 REC1 PIC 9(9).
FD FILE2 VALUE OF ID IS 'FFFFFFFFF'.
01 REC2 PIC 9(9).
PROCEDURE DIVISION.
PAR1.
        DISPLAY " THIS IS AS TEST".
        DISPLAY  "WHY NOT".
        STOP RUN.
