IDENTIFICATION DIVISION.
PROGRAM-ID. TRACERTST.
ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.
FIRST-AND-ONLY SECTION.
FIRST-OF-TWO-PARAGRAPHS.
        DISPLAY "ABCDEFG".
SECOND-OF-TWO-PARAGRAPHS.
        TRACE ON.
        GO TO FIRST-AND-ONLY.
        STOP RUN.
