IDENTIFICATION DIVISION.
PROGRAM-ID. 'TESTER'.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. PDP-10.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT TESTFILE ASSIGN TO DSK RECORDING MODE IS BINARY.
DATA DIVISION.
FILE SECTION.
FD TESTFILE LABEL RECORDS ARE STANDARD
        BLOCK CONTAINS 127 RECORDS,
     VALUE OF IDENTIFICATION IS 'TEST  DAT',
      DATA RECORDS ARE ONE.
01    ONE.
      02 FIELDONE PICTURE S9(5) USAGE COMP.
WORKING-STORAGE SECTION.
77     J PICTURE S9(5) USAGE COMPUTATIONAL.
77     FILE-KEY PIC S9(5) USAGE COMP.
77     INDEX-I PIC S9(5) USAGE COMPUTATIONAL.
PROCEDURE DIVISION.
STARTUP.
     OPEN OUTPUT TESTFILE.
     PERFORM LOOP THRU LOOP-EXIT VARYING INDEX-I FROM 1 
      BY 1 UNTIL INDEX-I IS GREATER THAN 1000.
    CLOSE TESTFILE.
    STOP RUN
LOOP.
         MOVE INDEX-I TO FIELDONE.
     ADD 1 TO J.
	MOVE INDEX-I TO FILE-KEY.
    WRITE ONE.
LOOP-EXIT.
    EXIT.
MISTAKE.
	DISPLAY 'NO WRITE'.
	DISPLAY INDEX-I.
MISTAKE-EXIT.
     EXIT.
