ID  DIVISION.
PROGRAM-ID.  P0316032.
AUTHOR.      B WING.
ENVIRONMENT  DIVISION.
CONFIGURATION  SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
INPUT-OUTPUT  SECTION.
FILE-CONTROL.
     SELECT  PLAN-I-FILE     ASSIGN TO DSK
      RECORDING MODE IS ASCII
                             ACCESS MODE IS INDEXED
                             SYMBOLIC KEY IS WH-KEY
                             RECORD KEY FPI-KEY.
     SELECT  TABLE-FILE      ASSIGN DSK,
      RECORDING MODE IS ASCII.
I-O-CONTROL.
DATA  DIVISION.
FILE  SECTION.
FD   PLAN-I-FILE
         VALUE OF IDENTIFICATION IS "PLANIIIDX"
     BLOCK CONTAINS 14 RECORDS
     DATA RECORDS ARE FPLANI-REC, FPLAN-REC.
01   FPLANI-REC.
       03  FPI-DEL-IND        PIC X   .
       03  FPI-KEY.
         05  FPI-VP           PIC X .
         05  FPI-MM    PIC X .
         05  FPI-DIST  PIC XXX .
         05 FPI-FUNC  PIC XX .
         05 FPI-GRP   PIC X .
         05  FPI-CT          PIC XX .
         05 FPI-DETAIL  PIC XX .
         05  FPI-SA          PIC XXXX .
     03  FPI-LI              PIC XXXX .
     03  FPI-TRANSP          PIC X .
     03  FPI-DSC             PIC XXX .
     03  FPI-AREA            PIC XX .
     03  FPI-COMPLEX         PIC XXX .
     03  FPI-AMTS.
         05  FPI-JAN         PIC S9(8)  DISPLAY-6.
         05  FPI-FEB         PIC S9(8)  DISPLAY-6.
         05  FPI-MAR         PIC S9(8)  DISPLAY-6.
         05  FPI-APR         PIC S9(8)  DISPLAY-6.
         05  FPI-MAY         PIC S9(8)  DISPLAY-6.
         05  FPI-JUN         PIC S9(8)  DISPLAY-6.
         05  FPI-JUL         PIC S9(8)  DISPLAY-6.
         05  FPI-AUG         PIC S9(8)  DISPLAY-6.
         05  FPI-SEP         PIC S9(8)  DISPLAY-6.
         05  FPI-OCT         PIC S9(8)  DISPLAY-6.
         05  FPI-NOV         PIC S9(8)  DISPLAY-6.
         05  FPI-DEC         PIC S9(8)  DISPLAY-6.
01 FPLAN-REC.
   02 FP1 PIC X.
   02 FP2.
      03 FP-KEY.
         05 FP-VP PIC X.
         05 FP-MM PIC X.
         05 FP-DIST PIC XXX.
   02 FP3.
      03 FP3-FU-GR-CT-DT.
         04 FP3-FU-GR-CT.
            05 FP3-FU-GR.
               07 FP-FUNC PIC XX.
               07 FP-GRP PIC X.
            05 FP-CT     PIC XX.
         04 FP-DTL       PIC XX.
       03 FP-SA          PIC XXXX.
   02 FILLER             PIC X(73).
FD   TABLE-FILE
         VALUE OF IDENTIFICATION IS "TABLEXXXX"
     BLOCK CONTAINS 0 RECORD.
01   FTBL-REC.
     03  FTBL-ID             PIC X(8).
     03  FTBL-CODE           PIC XX.
     03  FILLER              PIC XX.
     03  FTBL-ARGUMENT.
       05  FTBL-ARG-5.
         07  FTBL-ARG-4.
           09  FTBL-ARG-3.
             11  FTBL-ARG-2.
               13  FTBL-ARG-1 PIC X.
               13  FILLER     PIC X.
             11  FILLER       PIC X.
           09  FILLER         PIC X.
         07  FILLER           PIC X.
     03  FILLER              PIC X(25).
     03  FTBL-RESULT.
       05  FTBL-RESULT-1     PIC X.
       05  FILLER            PIC X(19).
     03  FILLER              PIC X(18).
WORKING-STORAGE  SECTION.
77   WH-RPT-DESC PIC X(20) VALUE SPACE.
77   WC-ZEROIT PIC X(6) VALUE 'ZEROIT'.
77   WA-TOTAL-YTD PIC S9(9) COMPUTATIONAL VALUE +0.
77   WH-KEY                  PIC X(16) VALUE SPACE.
77   WH-KEY-HOLD             PIC X(16)       VALUE SPACE.
77   WC-MINUS-1    PIC S9 COMPUTATIONAL VALUE -1.
01   W-TOTAL-LINE.
     03  FILLER PIC X(6) VALUE 'TOTAL '.
     03  WTOTAL-AMT PIC ZZZZZZZZ9- VALUE ZERO.
01   WAMT-DIGIT-CTR1 PIC S9 COMPUTATIONAL VALUE +0.
01   WAMT-DIGIT-CTR2 PIC S9 COMPUTATIONAL VALUE +8.
01   WAMT-NO-WORK1.
     02  WAMT1A PIC X.
     02  WAMT2A PIC X.
     02  WAMT3A PIC X.
     02  WAMT4A PIC X.
     02  WAMT5A PIC X.
     02  WAMT6A PIC X.
     02  WAMT7A PIC X.
     02  WAMT8A PIC X.
01   WAMT-NO-WORK2 REDEFINES WAMT-NO-WORK1.
     02  WAMT-A OCCURS 8 TIMES PIC X.
01   WAMT-NO-WORK3 PIC S9(8).
01   WAMT-NO-WORK4 REDEFINES WAMT-NO-WORK3.
     02  WAMT OCCURS 8 TIMES PIC X.
01   WH-FP-CNTL.
     03  WHFP-FU-GR-CT-DTL.
       04 WHFP-FU-GR-CT.
         05  WHFP-FU-GR.
           07  WHFP-FU       PIC XX      VALUE SPACE.
           07  WHFP-GR       PIC X       VALUE SPACE.
         05  WHFP-CT         PIC XX      VALUE SPACE.
       04 WHFP-DTL PIC XX VALUE SPACE.
     03  WHFP-SA             PIC XXXX    VALUE SPACE.
01   WH-SAVE-LOC PIC X(5) VALUE SPACE.
01   WH-LOC.
     03  WH-LOC-VP      PIC X.
     03  WH-LOC-MM      PIC X.
     03  WH-LOC-DIST    PIC XXX.
01   W-PLAN.
  02 W-DEL PIC X.
  02 WPLAN-KEY.
   03 WPLAN-VP PIC X.
      88 VP-EAST VALUE '1'.
      88 VP-WEST VALUE '2'.
   03 WPLAN-MKT-MGR PIC X.
      88 VP-EAST-MM VALUES '1' THRU '4'.
      88 VP-WEST-MM VALUES '5' THRU '8'.
   03 WPLAN-DIST PIC XXX.
   03 WPLAN-FUNCTION PIC XX.
       03  WPLAN-GROUP         PIC X.
       03  WPLAN-CLASSTYP      PIC XX.
       03  WPLAN-DETAIL PIC XX.
       03  WPLAN-SUB-ACCT      PIC XXXX.
     02  WPLAN-LINEITEM      PIC XXXX.
     02  WPLAN-TRANSP        PIC X.
     02  WPLAN-DSC           PIC XXX.
     02  WPLAN-AREA          PIC XX.
     02  WPLAN-COMPLEX       PIC XXX.
     02  WPLAN-AMOUNTS.
       05  WPLAN-JAN         PIC S9(8)  DISPLAY-6 VALUE +0.
       05  WPLAN-FEB         PIC S9(8)  DISPLAY-6 VALUE +0.
       05  WPLAN-MAR         PIC S9(8)  DISPLAY-6 VALUE +0.
       05  WPLAN-APR         PIC S9(8)  DISPLAY-6 VALUE +0.
       05  WPLAN-MAY         PIC S9(8)  DISPLAY-6 VALUE +0.
       05  WPLAN-JUN         PIC S9(8)  DISPLAY-6 VALUE +0.
       05  WPLAN-JUL         PIC S9(8)  DISPLAY-6 VALUE +0.
       05  WPLAN-AUG         PIC S9(8)  DISPLAY-6 VALUE +0.
       05  WPLAN-SEP         PIC S9(8)  DISPLAY-6 VALUE +0.
       05  WPLAN-OCT         PIC S9(8)  DISPLAY-6 VALUE +0.
       05  WPLAN-NOV         PIC S9(8)  DISPLAY-6 VALUE +0.
       05  WPLAN-DEC         PIC S9(8)  DISPLAY-6 VALUE +0.
01   W-COMMAND.
     03  W-CMND1-10.
       05  W-CMND1-6         PIC X(6).
       05  W-COMMAND-1 REDEFINES W-CMND1-6.
         07  W-CMND1-5.
           09  W-CMND1-4.
             11  W-CMND1-3.
               13  W-CMND1-2.
                 15  W-CMND1 PIC X.
                     88  YES-COMMAND         VALUE 'Y'.
                     88  NO-COMMAND          VALUE 'N'.
                     88  MORE-INFO           VALUE '+'.
                     88  MONTHLY-BUDGET      VALUE 'M'.
                     88  QUARTERLY-BUDGET    VALUE 'Q'.
                     88  EAST                VALUE 'E'.
                     88  WEST                VALUE 'W'.
                 15  FILLER  PIC X.
               13  FILLER    PIC X.
             11  FILLER      PIC X.
           09  FILLER        PIC X.
         07  FILLER          PIC X.
       05  W-COMMAND-2 REDEFINES W-COMMAND-1.
         07  FILLER          PIC XXX.
        88 ADD-COMMAND             VALUE 'ADD'.
        88 REPORT-COMMAND            VALUE 'REP'.
        88 CANCEL-COMMAND            VALUE 'CAN'.
        88 END-COMMAND               VALUE 'END'.
        88 STOP-COMMAND            VALUE 'STO'.
        88 CHANGE-COMMAND            VALUE 'CHA'.
        88  NEWLOC-COMMAND           VALUE 'NEW'.
        88  DISPLAY-COMMAND          VALUE 'DIS'.
        88  INIT-COMMAND VALUE 'INI'.
        88  MKT-COMMAND  VALUE 'MKT'.
        88  LOC-COMMAND  VALUE 'LOC'.
        88  VP-COMMAND   VALUE 'VP '.
        88  ALL-COMMAND  VALUE 'ALL'.
         07  W-CMND4-6       PIC XXX.
       05  W-CMND7-9         PIC XXX.
       05  FILLER            PIC X.
     03 W-COMMAND-3 REDEFINES W-CMND1-10.
       05  W-CMND1-9         PIC X(9).
       05  FILLER            PIC X.
     03 W-COMMAND-4 REDEFINES W-COMMAND-3.
       05  W-CLASSTYP        PIC XX.
         88 DETAIL-CT VALUES '23','24','51','54','56','67','68'.
       05 W-DETAIL REDEFINES W-CLASSTYP PIC XX.
       05  FILLER            PIC X.
       05  W-SUB-ACCT.
         07  FILLER          PIC XXX.
         07  W-SA-4          PIC X.
       05  FILLER            PIC X.
       05 W-DTL PIC XX.
     03  W-CMND-AMT REDEFINES W-COMMAND-4.
       05  W-AMT             PIC X(8) JUSTIFIED RIGHT.
       05  W-AMOUNT REDEFINES W-AMT PIC S9(8).
       05  FILLER            PIC XX.
     03  W-NEG-AMOUNT REDEFINES W-CMND-AMT.
         07  W-MINUS         PIC X.
         07  W-NEG-AMT       PIC X(8) JUSTIFIED RIGHT.
         07  W-NEGATIVE-AMT REDEFINES W-NEG-AMT PIC 9(8).
         07  FILLER          PIC X.
     03  FILLER              PIC X(70).
01   W-RESPONSE-1            PIC X(80).
01   W-RESP-2 REDEFINES W-RESPONSE-1.
     03  FILLER          PIC X.
     03  W-RESPONSE-2    PIC X(20).
     03  FILLER          PIC X(59).
01   W-RESP-3 REDEFINES W-RESPONSE-1.
     03  FILLER          PIC XX.
     03  W-RESPONSE-3    PIC X(20).
     03  FILLER          PIC X(58).
01   W-RESP-4 REDEFINES W-RESPONSE-1.
     03  FILLER          PIC XXX.
     03  W-RESPONSE-4    PIC X(20).
     03  FILLER          PIC X(57).
01   W-RESP-5 REDEFINES W-RESPONSE-1.
     03  W-RESP1-4          PIC XXXX.
     03  W-RESPONSE-5    PIC X(20).
     03  FILLER          PIC X(56).
01   W-RESP-6 REDEFINES W-RESPONSE-1.
     03  FILLER              PIC X(25).
     03  W-RESPONSE-6        PIC XXXX.
     03  FILLER              PIC X(51).
01   WC-BLANK-LINE       PIC X(80) VALUE SPACE.
01   WH-HEADINGS.
     03  WH1.
       05  FILLER        PIC X(25)   VALUE SPACE.
       05  FILLER        PIC X(29)   VALUE
             'MARKETING EXPENSE PLAN REPORT'.
       05  FILLER        PIC X(26)   VALUE SPACE.
     03  WH2.
       05  FILLER        PIC X(34)   VALUE SPACE.
       05  FILLER        PIC X(13)   VALUE
             'FOR YEAR 1973'.
       05  FILLER        PIC X(33)   VALUE SPACE.
     03  WH3.
       05  FILLER        PIC X(7)   VALUE SPACE.
       05  FILLER        PIC X(54)   VALUE
         'JAN.      FEB.      MAR.      APR.      MAY       JUN.'.
       05  FILLER        PIC X(19)    VALUE SPACE.
     03  WH4.
       05  FILLER        PIC X(7)   VALUE SPACE.
       05  FILLER        PIC X(54)   VALUE
         'JUL.      AUG.      SEP.      OCT.      NOV.      DEC.'.
       05  FILLER PIC X(10) VALUE '     TOTAL'.
        05  FILLER        PIC X(9)    VALUE SPACE.
     03 WH5.
       05 FILLER PIC X(72) VALUE "--------------------------------------
-"----------------------------------".
01   WA-TBL-ACCUMS.
     03  WA-FUNC             PIC S99999 COMP VALUE +30.
     03  WA-GRP              PIC S99999 COMP VALUE +12.
     03  WA-DIST             PIC S99999 COMP VALUE +60.
     03  WA-CT      PIC S99999 COMP VALUE +110.
     03  WA-SA      PIC S99999 COMP VALUE +130.
     03  WA-REG     PIC S99999 COMP VALUE +40.
     03  WA-MM      PIC S99999 COMP VALUE +12.
     03  WA-TMPMGR  PIC S99999 COMP VALUE +60.
     03  WA-CTSA    PIC S99999 COMP VALUE +25.
01   WM-MESSAGES.
     03  WM-1        PIC X(50) VALUE
             ' *MARKETING PLAN SYSTEM BUDGET PROGRAM IS READY *'.
     03  WM-2        PIC X(39) VALUE
             '     NOTE - TO END SESSION ENTER STOP  '.
     03  WM-3        PIC X(38) VALUE
             '            TO END A COMMAND ENTER END'.
     03  WM-4        PIC X(69) VALUE 'IF + APPEARS AFTER A MESSAGE, ENTE
-'R + FOR ADDITIONAL INFO.'.
     03  WM-5        PIC X(14) VALUE
             'ENTER COMMAND+'.
     03  WM-6        PIC X(19) VALUE
             'ENTER LOCATION CODE'.
     03  WM-7        PIC X(14) VALUE
             'ENTER SUB-ACCT'.
     03  WM-8        PIC X(16) VALUE
             'ENTER CLASS-TYPE'.
     03  WM-9        PIC X(17) VALUE
             'ENTER DETAIL CODE'.
     03  WM-10       PIC X(35)  VALUE
             '**INVALID LOCATION CODE - TRY AGAIN'.
     03  WM-11       PIC X(29)   VALUE
             '**INVALID COMMAND - TRY AGAIN'.
     03  WM-12       PIC X(12)   VALUE
             'ENTER CT,SA+'.
     03  WM-13A      PIC X(35)   VALUE
             '  ENTER CLASS-TYPE, COMMA, SUB-ACCT'.
     03  WM-13B      PIC X(15)   VALUE
             '   I.E. XX,XXXX'.
     03  WM-14       PIC X(43)   VALUE
             'BUDGET MONTHLY OR QUARTERLY? ENTER M OR Q? '.
     03  WM-15       PIC X(27)   VALUE
             'BUDGET SAME FOR EACH MONTH?'.
     03  WM-16       PIC X(60)   VALUE
             'ENTER UP TO 8-DIGITS FOR BUDGET , PRECEED WITH - IF
-            'NEGATIVE'.
     03  WM-17       PIC X(4)    VALUE 'JAN+'.
     03  WM-18       PIC X(4)    VALUE 'FEB+'.
     03  WM-19       PIC X(4)    VALUE 'MAR+'.
     03  WM-20       PIC X(4)    VALUE 'APR+'.
     03  WM-21       PIC X(4)    VALUE 'MAY+'.
     03  WM-22       PIC X(4)    VALUE 'JUN+'.
     03  WM-23       PIC X(4)    VALUE 'JUL+'.
     03  WM-24       PIC X(4)    VALUE 'AUG+'.
     03  WM-25       PIC X(4)    VALUE 'SEP+'.
     03  WM-26       PIC X(4)    VALUE 'OCT+'.
     03  WM-27       PIC X(4)    VALUE 'NOV+'.
     03  WM-28       PIC X(4)    VALUE 'DEC+'.
     03  WM-29       PIC X(3)    VALUE 'OK?'.
     03  WM-30       PIC X(32)   VALUE
             'WHAT IS WRONG? CODING OR AMOUNT?'.
     03  WM-31       PIC X(18)   VALUE
             'WHAT TYPE REPORT?+'.
     03  WM-32       PIC X(13)   VALUE
             'ENTER BUDGET+'.
     03  WM-33       PIC X(15)   VALUE
             '1ST QTR BUDGET?'.
     03  WM-34       PIC X(15)   VALUE
             '2ND QTR BUDGET?'.
     03  WM-35       PIC X(15)   VALUE
             '3RD QTR BUDGET?'.
     03  WM-36       PIC X(15)   VALUE
             '4TH QTR BUDGET?'.
     03  WM-37       PIC X(21)   VALUE
             '    COMMAND   MEANING'.
     03  WM-38       PIC X(29)   VALUE
             '    1.LOC     LOCATION REPORT'.
     03  WM-39       PIC X(40)   VALUE
             '    2.MKT     MKTG. MNGR. SUMMARY REPORT'.
     03  WM-40       PIC X(33)   VALUE
             '    3.VP      V.P. SUMMARY REPORT'.
     03  WM-41       PIC X(36)   VALUE
             '    4.ALL     COMPANY SUMMARY REPORT'.
     03  WM-42.
       05  FILLER PIC X(20) VALUE 'ENTER ADJUSTMENT TO '.
       05  WM-42-MO PIC XXX.
       05  FILLER PIC X(6) VALUE ' AMT.+'.
01   WH-PLAN.
  03 FILLER PIC X(30).
  03 FILLER PIC S9(8) COMP.
  03 FILLER PIC S9(8) COMP.
  03 FILLER PIC S9(8) COMP.
  03 FILLER PIC S9(8) COMP.
  03 FILLER PIC S9(8) COMP.
  03 FILLER PIC S9(8) COMP.
  03 FILLER PIC S9(8) COMP.
  03 FILLER PIC S9(8) COMP.
  03 FILLER PIC S9(8) COMP.
  03 FILLER PIC S9(8) COMP.
  03 FILLER PIC S9(8) COMP.
  03 FILLER PIC S9(8) COMP.
01   WD1.
     03  WD1-LABEL        PIC X(2)   VALUE SPACE.
     03  WD1-JAN             PIC ZZZZZZZ9-.
     03  WD1-JUL REDEFINES WD1-JAN PIC ZZZZZZZ9-.
     03  FILLER           PIC X       VALUE SPACE.
     03  WD1-FEB             PIC ZZZZZZZ9-.
     03  WD1-AUG REDEFINES WD1-FEB PIC ZZZZZZZ9-.
     03  FILLER           PIC X       VALUE SPACE.
     03  WD1-MAR             PIC ZZZZZZZ9-.
     03  WD1-SEP REDEFINES WD1-MAR PIC ZZZZZZZ9-.
     03  FILLER           PIC X       VALUE SPACE.
     03  WD1-APR             PIC ZZZZZZZ9-.
     03  WD1-OCT REDEFINES WD1-APR PIC ZZZZZZZ9-.
     03  FILLER           PIC X       VALUE SPACE.
     03  WD1-MAY             PIC ZZZZZZZ9-.
     03  WD1-NOV REDEFINES WD1-MAY PIC ZZZZZZZ9-.
     03  FILLER           PIC X       VALUE SPACE.
     03  WD1-JUN             PIC ZZZZZZZ9-.
     03  WD1-DEC REDEFINES WD1-JUN PIC ZZZZZZZ9-.
     03  FILLER PIC X VALUE SPACE.
     03  WD1-TOTAL PIC Z(8)9-.
     03  FILLER              PIC X(8) VALUE SPACE.
01   WC-ZERO-AMTS.
     03  WC-ZERO-PLAN-MONTHS.
       05  WC-ZERO-MO      PIC S9(8) COMPUTATIONAL VALUE +0.
       05  FILLER      PIC S9(8) COMPUTATIONAL VALUE +0.
       05  FILLER      PIC S9(8) COMPUTATIONAL VALUE +0.
       05  FILLER      PIC S9(8) COMPUTATIONAL VALUE +0.
       05  FILLER      PIC S9(8) COMPUTATIONAL VALUE +0.
       05  FILLER      PIC S9(8) COMPUTATIONAL VALUE +0.
       05  FILLER      PIC S9(8) COMPUTATIONAL VALUE +0.
       05  FILLER      PIC S9(8) COMPUTATIONAL VALUE +0.
       05  FILLER      PIC S9(8) COMPUTATIONAL VALUE +0.
       05  FILLER      PIC S9(8) COMPUTATIONAL VALUE +0.
       05  FILLER      PIC S9(8) COMPUTATIONAL VALUE +0.
       05  FILLER      PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WC-ZERO-YTD PIC S9(9) COMPUTATIONAL VALUE +0.
01   WA-ACCUMS.
     03  WA-FUNC-JAN PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-FUNC-FEB PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-FUNC-MAR PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-FUNC-APR PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-FUNC-MAY PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-FUNC-JUN PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-FUNC-JUL PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-FUNC-AUG PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-FUNC-SEP PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-FUNC-OCT PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-FUNC-NOV PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-FUNC-DEC PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-FUNC-TOTL PIC S9(9) COMPUTATIONAL VALUE +0.
01   WA-TOTL-ACCUMS.
     03  WA-TOTL-JAN         PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-TOTL-FEB         PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-TOTL-MAR         PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-TOTL-APR         PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-TOTL-MAY         PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-TOTL-JUN         PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-TOTL-JUL         PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-TOTL-AUG         PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-TOTL-SEP         PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-TOTL-OCT         PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-TOTL-NOV         PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-TOTL-DEC         PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-TOTL-YTD PIC S9(9) COMPUTATIONAL VALUE +0.
01   WA-CT-ACCUMS.
     03  WA-CT-JAN PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-CT-FEB PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-CT-MAR PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-CT-APR PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-CT-MAY PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-CT-JUN PIC S9(8) COMPUTATIONAL VALUE +    03  WA-CT-JUL PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-CT-AUG PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-CT-SEP PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-CT-OCT PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-CT-NOV PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-CT-DEC PIC S9(8) COMPUTATIONAL VALUE +0.
     03  WA-CT-TOTL PIC S9(9) COMPUTATIONAL VALUE +0.
01   WS-SWITCHES.
     03  WS-SW-ON    PIC X       VALUE 'X'.
     03  WS-LOC-ERR  PIC X       VALUE SPACE.
         88  GOOD-LOC            VALUE SPACE.
         88  BAD-LOC             VALUE 'X'.
     03  WS-ISAM     PIC X       VALUE SPACE.
         88  ISAM-RANDOM         VALUE 'R'.
         88  ISAM-SEQ            VALUE 'S'.
     03  WS-EOF-PLAN PIC X       VALUE SPACE.
         88  EOF-PLAN            VALUE 'X'.
     03  WS-CT-SA-ERR PIC X       VALUE SPACE.
         88  CT-SA-ERR            VALUE 'X'.
     03  WS-TOTAL-CORR PIC X      VALUE SPACE.
         88  TOTAL-CORR           VALUE 'X'.
01   WH-TOTAL-LINE-1.
     03  FILLER PIC X(7) VALUE '*TOTAL '.
     03  WH-TOTL-1-DESC PIC X(20).
01   WH-TOTAL-LINE-2.
     03  FILLER PIC X(8) VALUE '**TOTAL '.
     03  WH-TOTL-2-DESC PIC X(20).
01   WH-TOTAL-LINE-3.
     03  FILLER PIC X(9) VALUE '***TOTAL '.
     03  WH-TOTL-3-DESC PIC X(20).
01   WT-TBL-CT.
     03  WT-CLSTYP   OCCURS 1 TO 110 TIMES DEPENDING ON WA-CT
                     ASCENDING KEY IS WT-CT
                     INDEXED BY ICT.
       05  WT-CT     PIC XX.
       05  WT-CT-DES PIC X(20).
01   WT-TBL-SA.
     03  WT-SUBACCT  OCCURS 1 TO 130 TIMES DEPENDING ON WA-SA
                     ASCENDING KEY IS WT-SA
                     INDEXED BY ISA.
       05  WT-SA     PIC XXXX.
       05  WT-SA-DES PIC X(20).
01   WT-TBL-REG.
     03  WT-REGION   OCCURS 1 TO 40 TIMES
                     DEPENDING ON WA-REG
                     ASCENDING KEY IS WT-REG
                     INDEXED BY IRG.
       05  WT-REG     PIC XXX.
       05  WT-REG-DES PIC X(20).
01   WT-TBL-MKTMGR.
     03  WT-MKTMGR   OCCURS 1 TO 12 TIMES
                     DEPENDING ON WA-MM
                     ASCENDING KEY IS WT-MM
                     INDEXED BY IMM.
       05  WT-MM     PIC X.
       05  WT-MM-DES PIC X(20).
01   WT-TBL-TEMPMGR.
     03  WT-TMPMGR   OCCURS 1 TO 60 TIMES
                     DEPENDING ON WA-TMPMGR
                     ASCENDING KEY IS WT-TM
                     INDEXED BY ITM.
       05  WT-TM     PIC XXX.
     03    WT-TM-MM OCCURS 60 TIMES INDEXED BY ITM.
        05 FILLER PIC X.
01   WT-TBL-CTSA.
     03  WT-CT-SA    OCCURS 1 TO 25 TIMES
                     DEPENDING ON WA-CTSA
                     ASCENDING KEY IS WT-CTSA
                     INDEXED BY ICTSA.
       05  WT-CTSA   PIC X(5).
       05  WT-CTSA-DES PIC X(20).
01   WT-TBL-DIST.
     03  WT-DISTRICT    OCCURS 1 TO 60 TIMES
                        DEPENDING ON WA-DIST
                        ASCENDING KEY IS WT-DIST
                             INDEXED BY IDIST.
         05  WT-DIST         PIC XXX.
         05  WT-DIST-DES     PIC X(20).
01   WT-TBL-GRUP.
     03  WT-GROUP            OCCURS 1 TO 12 TIMES
                             DEPENDING ON WA-GRP
                             ASCENDING KEY IS WT-GRP
                             INDEXED BY IGRP.
         05  WT-GRP          PIC X.
         05  WT-GRP-DES      PIC X(20).
01   WT-TBL-FUNC.
     03  WT-FUNCTION         OCCURS 1 TO 30 TIMES
                             DEPENDING ON WA-FUNC
                             ASCENDING KEY IS WT-FUNC
                             INDEXED BY IFUNC.
         05  WT-FUNC         PIC XX.
         05  WT-FUNC-DES     PIC X(20).
PROCEDURE  DIVISION.
100-OPEN-FILES.
     PERFORM 962-OPEN-PLANI-IO.
     MOVE 'R' TO WS-ISAM.
105-INIT-PGM-MSGS.
     MOVE WM-1 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE WM-2 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE WM-3 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE WM-4 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE ' ' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE 'PROCESSING WILL BEGIN SOON' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 500-LOAD-TBLS THRU 500-X.
110-ACCEPT-LOCATION.
     MOVE WM-6 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 810-READ-COMMAND THRU 810-X.
     PERFORM 900-VALIDATE-LOC THRU 900-X.
112.
     IF GOOD-LOC
         MOVE WPLAN-VP TO WH-LOC-VP
         MOVE WPLAN-MKT-MGR TO WH-LOC-MM
         MOVE WPLAN-DIST TO WH-LOC-DIST
         MOVE WH-LOC TO WH-SAVE-LOC
         ELSE
             MOVE WM-10 TO W-RESPONSE-1
             PERFORM 800-WRITE-RESPONSE THRU 800-X
             GO TO 110-ACCEPT-LOCATION.
115-ACCEPT-COMMAND.
     MOVE WH-SAVE-LOC TO WH-LOC.
     MOVE WH-LOC-VP TO WPLAN-VP.
     MOVE WH-LOC-MM TO WPLAN-MKT-MGR.
     MOVE WH-LOC-DIST TO WPLAN-DIST.
     MOVE WM-5 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 810-READ-COMMAND   THRU 810-X.
     IF ADD-COMMAND GO TO 120-ADD-ROUTINE.
     IF REPORT-COMMAND GO TO 130-REPORT-ROUTINE.
     IF CANCEL-COMMAND GO TO 140-CANCEL-ROUTINE.
     IF CHANGE-COMMAND GO TO 150-CHANGE-ROUTINE.
     IF NEWLOC-COMMAND, GO TO 110-ACCEPT-LOCATION.
     IF INIT-COMMAND GO TO 950-INIT.
     IF DISPLAY-COMMAND GO TO 160-DISPLAY-ROUTINE.
     IF MORE-INFO
         MOVE '  ADD - FOR ENTRY OF DATA' TO W-RESPONSE-1
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         MOVE '  CANCEL - FOR CANCELLING DATA' TO W-RESPONSE-1
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         MOVE '  CHANGE - FOR CHANGING DATA' TO W-RESPONSE-1
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         MOVE '  DISPLAY- FOR DISPLAYING A BUDGET' TO W-RESPONSE-1
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         MOVE '  REPORT - FOR REPORTING DATA' TO W-RESPONSE-1
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         MOVE '  END - FOR ENDING A COMMAND' TO W-RESPONSE-1
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         MOVE '  STOP - TO END SESSION' TO W-RESPONSE-1
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         GO TO 115-ACCEPT-COMMAND.
115-1.
     IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
     IF STOP-COMMAND GO TO 999-END.
     MOVE WM-11 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     GO TO 115-ACCEPT-COMMAND.
120-ADD-ROUTINE.
     MOVE WM-12 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 810-READ-COMMAND   THRU 810-X.
     IF MORE-INFO
             MOVE WM-13A TO W-RESPONSE-1
             PERFORM 800-WRITE-RESPONSE THRU 800-X
             MOVE WM-13B TO W-RESPONSE-1
             PERFORM 800-WRITE-RESPONSE THRU 800-X
             GO TO 120-ADD-ROUTINE.
120-0.
     IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
120-1.
     MOVE W-CLASSTYP TO WPLAN-CLASSTYP.
     IF W-SA-4 = ' ' MOVE '0' TO W-SA-4.
     MOVE W-SUB-ACCT TO WPLAN-SUB-ACCT.
     IF DETAIL-CT PERFORM 120-4-GET-DETAIL THRU 120-4-X
          ELSE MOVE '00' TO WPLAN-DETAIL.
     PERFORM 905-VALIDATE-CT-SA THRU 905-X.
     PERFORM 820-CALC-FUNC THRU 820-X.
     PERFORM 825-CALC-GROUP THRU 825-X.
     MOVE WPLAN-KEY TO WH-KEY.
120-1-2.
*    MOVE WM-14 TO W-RESPONSE-1.
*    PERFORM 801-WRITE-RESPONSE THRU 800-X.
*    PERFORM 810-READ-COMMAND THRU 810-X.
*    IF MONTHLY-BUDGET       GO TO 120-2.
*    IF QUARTERLY-BUDGET     GO TO 120-3.
*    IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
*    GO TO 120-1-2.
     IF CT-SA-ERR MOVE ' ' TO WS-CT-SA-ERR
       GO TO 120-ADD-ROUTINE.
120-2.
     MOVE WM-15 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 810-READ-COMMAND   THRU 810-X.
     IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
     IF YES-COMMAND          GO TO 120-2-1.
     IF NO-COMMAND GO TO 120-2-2.
     GO TO 120-2.
120-2-1.
     MOVE WM-32 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-JAN WPLAN-FEB WPLAN-MAR WPLAN-APR
             WPLAN-MAY WPLAN-JUN WPLAN-JUL WPLAN-AUG WPLAN-SEP
             WPLAN-OCT WPLAN-NOV WPLAN-DEC.
     PERFORM 120-2-4 THRU 120-2-4-X.
     PERFORM 120-TOTAL THRU 120-TOTAL-X.
     GO TO 120-ADD-ROUTINE.
120-2-2.
     MOVE WM-17 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-JAN.
     MOVE WM-18 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-FEB.
     MOVE WM-19 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-MAR.
     MOVE WM-20 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-APR.
     MOVE WM-21 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-MAY.
     MOVE WM-22 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-JUN.
     MOVE WM-23 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-JUL.
     MOVE WM-24 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-AUG.
     MOVE WM-25 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-SEP.
     MOVE WM-26 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-OCT.
     MOVE WM-27 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-NOV.
     MOVE WM-28 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-GET-AMT-X.
     MOVE W-AMOUNT TO WPLAN-DEC.
     PERFORM 120-2-4 THRU 120-2-4-X.
120-2-3.
     PERFORM 120-TOTAL THRU 120-TOTAL-X.
     GO TO 120-ADD-ROUTINE.
120-2-4.
     PERFORM 815-WRITE-ISAM THRU 815-X.
     PERFORM 140-4 THRU 140-4-X.
120-2-4-X.     EXIT.
120-3.
     MOVE WM-33 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-QTRLY-AMT-X.
     MOVE W-AMOUNT TO WPLAN-JAN  WPLAN-FEB  WPLAN-MAR.
     MOVE WM-34 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-QTRLY-AMT-X.
     MOVE W-AMOUNT TO WPLAN-APR  WPLAN-MAY  WPLAN-JUN.
     MOVE WM-35 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-QTRLY-AMT-X.
     MOVE W-AMOUNT TO WPLAN-JUL  WPLAN-AUG  WPLAN-SEP.
     MOVE WM-36 TO W-RESPONSE-1.
     PERFORM 120-GET-AMT THRU 120-QTRLY-AMT-X.
     MOVE W-AMOUNT TO WPLAN-OCT  WPLAN-NOV  WPLAN-DEC.
     PERFORM 120-2-4 THRU 120-2-4-X.
     GO TO 120-ADD-ROUTINE.
120-4-GET-DETAIL.
    IF W-DTL=SPACES NEXT SENTENCE ELSE MOVE W-DTL TO WPLAN-DETAIL
      GO TO 120-4-X.
120-4-1.
    MOVE WM-9 TO W-RESPONSE-1.
    PERFORM 800-WRITE-RESPONSE THRU 800-X.
    PERFORM 810-READ-COMMAND THRU 810-X.
    IF W-DETAIL NOT NUMERIC GO TO 120-4-1.
    MOVE W-DETAIL TO WPLAN-DETAIL.
120-4-X.
    EXIT.
120-GET-AMT.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 810-READ-COMMAND THRU 810-X.
     IF MORE-INFO MOVE WM-16 TO W-RESPONSE-1
       GO TO 120-GET-AMT.
     IF W-MINUS = '-' MOVE W-NEG-AMT TO WAMT-NO-WORK1
       PERFORM 120-GET-1 THRU 120-GET-1-X ELSE
       MOVE W-AMT TO WAMT-NO-WORK1
       PERFORM 120-GET-1 THRU 120-GET-1-X.
     GO TO 120-GET-AMT-X.
120-GET-1.
     MOVE 0 TO WAMT-DIGIT-CTR1.  MOVE 8 TO WAMT-DIGIT-CTR2.
     MOVE 00000000 TO WAMT-NO-WORK3.
     IF WAMT1A NOT = ' ' ADD 1 TO WAMT-DIGIT-CTR1.
     IF WAMT2A NOT = ' ' ADD 1 TO WAMT-DIGIT-CTR1.
     IF WAMT3A NOT = ' ' ADD 1 TO WAMT-DIGIT-CTR1.
     IF WAMT4A NOT = ' ' ADD 1 TO WAMT-DIGIT-CTR1.
     IF WAMT5A NOT = ' ' ADD 1 TO WAMT-DIGIT-CTR1.
     IF WAMT6A NOT = ' ' ADD 1 TO WAMT-DIGIT-CTR1.
     IF WAMT7A NOT = ' ' ADD 1 TO WAMT-DIGIT-CTR1.
     IF WAMT8A NOT = ' ' ADD 1 TO WAMT-DIGIT-CTR1.
120-GET-1-1.
     IF WAMT-DIGIT-CTR1 = 0 GO TO 120-GET-1-2.
     MOVE WAMT-A (WAMT-DIGIT-CTR1) TO WAMT (WAMT-DIGIT-CTR2).
     SUBTRACT 1 FROM WAMT-DIGIT-CTR1 WAMT-DIGIT-CTR2.
     GO TO 120-GET-1-1.
120-GET-1-2.
     IF W-MINUS = '-'
       COMPUTE W-AMOUNT = WAMT-NO-WORK3 * WC-MINUS-1 ELSE
       MOVE WAMT-NO-WORK3 TO W-AMOUNT.
120-GET-1-X.     EXIT.
120-GET-AMT-X.       EXIT.
120-QTRLY-AMT.
     COMPUTE  W-AMOUNT ROUNDED =  W-AMOUNT / 3.
120-QTRLY-AMT-X.     EXIT.
120-TOTAL.
     PERFORM 130-75-1.
     MOVE WA-TOTAL-YTD TO WTOTAL-AMT.
     MOVE W-TOTAL-LINE TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
120-TOTAL-X.     EXIT.
130-REPORT-ROUTINE.
     MOVE LOW-VALUES TO WH-KEY.
     MOVE 'S' TO WS-ISAM.
130-1.
     MOVE WH-SAVE-LOC TO WH-LOC.
     MOVE WM-31 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 810-READ-COMMAND   THRU 810-X.
     IF MORE-INFO
             MOVE WM-37 TO W-RESPONSE-1
             PERFORM 800-WRITE-RESPONSE THRU 800-X
             MOVE WM-38 TO W-RESPONSE-1
             PERFORM 800-WRITE-RESPONSE THRU 800-X
             MOVE WM-39 TO W-RESPONSE-1
             PERFORM 800-WRITE-RESPONSE THRU 800-X
             MOVE WM-40 TO W-RESPONSE-1
             PERFORM 800-WRITE-RESPONSE THRU 800-X
             MOVE WM-41 TO W-RESPONSE-1
             PERFORM 800-WRITE-RESPONSE THRU 800-X
             GO TO 130-1.
     IF W-CMND1-3 = 'LOC' GO TO 130-2.
     IF W-CMND1-3 = 'MKT' MOVE 000 TO WH-LOC-DIST GO TO 130-2.
     IF W-CMND1-2 = 'VP' MOVE 000 TO WH-LOC-DIST
         MOVE 0 TO WH-LOC-MM GO TO 130-2.
     IF W-CMND1-3 = 'ALL' MOVE 000 TO WH-LOC-DIST
         MOVE 0 TO WH-LOC-MM MOVE 0 TO WH-LOC-VP
         GO TO 130-2.
     IF END-COMMAND GO TO 130-99-END.
     MOVE WM-11 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     GO TO 130-1.
130-2.
     MOVE SPACES TO WH-FP-CNTL,  W-PLAN.
     DISPLAY WH-LOC.
     GO TO 130-2-0.
*    START PLAN-FILE INVALID KEY
*        MOVE '*LOC NOT FOUND-TRY AGAIN' TO W-RESPONSE-1
*        PERFORM 800-WRITE-RESPONSE THRU 800-X
*        GO TO 130-2-1.
 130-2-0.
     PERFORM 130-80-RPT-HDG THRU 130-80-X.
     PERFORM 130-55-ASTERIK THRU 130-55-X.
     IF W-CMND1-3 = 'LOC' PERFORM 130-54-DIST THRU 130-54-X
         PERFORM 130-55-ASTERIK THRU 130-55-X
         PERFORM 130-60-MOHDG-1 THRU 130-60-X
         PERFORM 130-60-MOHDG-2 THRU 130-60-X
         GO TO 130-3.
     IF W-CMND1-3 = 'MKT' PERFORM 130-61-5 THRU 130-61-X
         PERFORM 130-55-ASTERIK THRU 130-55-X
         PERFORM 130-60-MOHDG-1 THRU 130-60-X
         PERFORM 130-60-MOHDG-2 THRU 130-60-X
         GO TO 130-3.
     IF W-CMND1-2 = 'VP' PERFORM 130-62-VP THRU 130-62-X
         PERFORM 130-55-ASTERIK THRU 130-55-X
         PERFORM 130-60-MOHDG-1 THRU 130-60-X
         PERFORM 130-60-MOHDG-2 THRU 130-60-X
         GO TO 130-3.
     IF W-CMND1-3 = 'ALL' MOVE 'COMPANY REPORT' TO W-RESPONSE-1
         WH-RPT-DESC
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         PERFORM 130-55-ASTERIK THRU 130-55-X
         PERFORM 130-60-MOHDG-1 THRU 130-60-X
         PERFORM 130-60-MOHDG-2 THRU 130-60-X
         GO TO 130-3.
130-2-1.
     PERFORM 110-ACCEPT-LOCATION.
     IF END-COMMAND GO TO 130-99-END.
     IF NOT GOOD-LOC
         MOVE WM-10 TO W-RESPONSE-1
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         GO TO 130-2-1.
130-3.
     READ PLAN-I-FILE INTO W-PLAN INVALID KEY GO TO 130-9-EOF.
             IF FP-KEY > WH-LOC GO TO 130-9-EOF.
             IF FP-KEY < WH-LOC GO TO 130-3.
     IF WPLAN-AMOUNTS = WC-ZERO-PLAN-MONTHS GO TO 130-3.
     IF WH-FP-CNTL = SPACES GO TO 130-3-FUNC-X.
     IF FP-FUNC > WHFP-FU PERFORM 130-7-CT-TOTL THRU 130-7-X
       GO TO 130-3-FUNC.
     IF FP3-FU-GR > WHFP-FU-GR PERFORM 130-7-CT-TOTL THRU 130-7-X
       GO TO 130-3-GRP.
     IF FP3-FU-GR-CT > WHFP-FU-GR-CT
       PERFORM 130-7-CT-TOTL THRU 130-7-X
       GO TO 130-3-CT.
     GO TO 130-3-SA.
130-3-FUNC.
     MOVE WT-FUNC-DES (IFUNC) TO WH-TOTL-2-DESC.
     MOVE WH-TOTAL-LINE-2 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE.
     ADD WA-FUNC-JAN TO WA-TOTL-JAN.
     ADD WA-FUNC-FEB TO WA-TOTL-FEB.
     ADD WA-FUNC-MAR TO WA-TOTL-MAR.
     ADD WA-FUNC-APR TO WA-TOTL-APR.
     ADD WA-FUNC-MAY TO WA-TOTL-MAY.
     ADD WA-FUNC-JUN TO WA-TOTL-JUN.
     ADD WA-FUNC-JUL TO WA-TOTL-JUL.
     ADD WA-FUNC-AUG TO WA-TOTL-AUG.
     ADD WA-FUNC-SEP TO WA-TOTL-SEP.
     ADD WA-FUNC-OCT TO WA-TOTL-OCT.
     ADD WA-FUNC-NOV TO WA-TOTL-NOV.
     ADD WA-FUNC-DEC TO WA-TOTL-DEC.
     ADD WA-FUNC-TOTL TO WA-TOTL-YTD.
     MOVE WA-FUNC-JAN TO WD1-JAN.
     MOVE WA-FUNC-FEB TO WD1-FEB.
     MOVE WA-FUNC-MAR TO WD1-MAR.
     MOVE WA-FUNC-APR TO WD1-APR.
     MOVE WA-FUNC-MAY TO WD1-MAY.
     MOVE WA-FUNC-JUN TO WD1-JUN.
     MOVE WC-ZERO-YTD TO WD1-TOTAL.
     MOVE WD1 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE  THRU 800-X.
     MOVE WA-FUNC-JUL TO WD1-JUL.
     MOVE WA-FUNC-AUG TO WD1-AUG.
     MOVE WA-FUNC-SEP TO WD1-SEP.
     MOVE WA-FUNC-OCT TO WD1-OCT.
     MOVE WA-FUNC-NOV TO WD1-NOV.
     MOVE WA-FUNC-DEC TO WD1-DEC.
     MOVE WA-FUNC-TOTL TO WD1-TOTAL.
     MOVE SPACE TO WD1-LABEL.
     MOVE WD1 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE WC-ZERO-AMTS TO WA-ACCUMS.
130-3-FUNC-X.
     PERFORM 130-56-FUNC THRU 130-56-X.
130-3-GRP.
     PERFORM 130-57-GROUP THRU 130-57-X.
130-3-CT.
     PERFORM 130-58-CT THRU 130-58-X.
130-3-SA.
     PERFORM 130-59-SA THRU 130-59-X.
130-4.
     PERFORM 130-75-TOTL THRU 130-75-X.
     PERFORM 130-70-AMT1 THRU 130-70-X.
     PERFORM 130-70-AMT2 THRU 130-70-X.
130-5.
     MOVE FP3 TO WH-FP-CNTL.
     GO TO 130-3.
130-6-TOTL.
     MOVE WH-RPT-DESC TO WH-TOTL-3-DESC.
     MOVE WH-TOTAL-LINE-3 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE WA-TOTL-JAN TO WD1-JAN.
     MOVE WA-TOTL-FEB TO WD1-FEB.
     MOVE WA-TOTL-MAR TO WD1-MAR.
     MOVE WA-TOTL-APR TO WD1-APR.
     MOVE WA-TOTL-MAY TO WD1-MAY.
     MOVE WA-TOTL-JUN TO WD1-JUN.
     MOVE WC-ZERO-YTD TO WD1-TOTAL.
     MOVE WD1 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE WA-TOTL-JUL TO WD1-JUL.
     MOVE WA-TOTL-AUG TO WD1-AUG.
     MOVE WA-TOTL-SEP TO WD1-SEP.
     MOVE WA-TOTL-OCT TO WD1-OCT.
     MOVE WA-TOTL-NOV TO WD1-NOV.
     MOVE WA-TOTL-DEC TO WD1-DEC.
     MOVE WA-TOTL-YTD TO WD1-TOTAL.
     MOVE SPACE TO WD1-LABEL.
     MOVE WD1 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
130-6-X.     EXIT.
130-7-CT-TOTL.
     MOVE WT-CT-DES (ICT) TO WH-TOTL-1-DESC.
     MOVE WH-TOTAL-LINE-1 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     ADD WA-CT-JAN TO WA-FUNC-JAN.
     ADD WA-CT-FEB TO WA-FUNC-FEB.
     ADD WA-CT-MAR TO WA-FUNC-MAR.
     ADD WA-CT-APR TO WA-FUNC-APR.
     ADD WA-CT-MAY TO WA-FUNC-MAY.
     ADD WA-CT-JUN TO WA-FUNC-JUN.
     ADD WA-CT-JUL TO WA-FUNC-JUL.
     ADD WA-CT-AUG TO WA-FUNC-AUG.
     ADD WA-CT-SEP TO WA-FUNC-SEP.
     ADD WA-CT-OCT TO WA-FUNC-OCT.
     ADD WA-CT-NOV TO WA-FUNC-NOV.
     ADD WA-CT-DEC TO WA-FUNC-DEC.
     ADD WA-CT-TOTL TO WA-FUNC-TOTL.
     MOVE WA-CT-JAN TO WD1-JAN.
     MOVE WA-CT-FEB TO WD1-FEB.
     MOVE WA-CT-MAR TO WD1-MAR.
     MOVE WA-CT-APR TO WD1-APR.
     MOVE WA-CT-MAY TO WD1-MAY.
     MOVE WA-CT-JUN TO WD1-JUN.
     MOVE WC-ZERO-YTD TO WD1-TOTAL.
     MOVE WD1 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE WA-CT-JUL TO WD1-JUL.
     MOVE WA-CT-AUG TO WD1-AUG.
     MOVE WA-CT-SEP TO WD1-SEP.
     MOVE WA-CT-OCT TO WD1-OCT.
     MOVE WA-CT-NOV TO WD1-NOV.
     MOVE WA-CT-DEC TO WD1-DEC.
     MOVE WA-CT-TOTL TO WD1-TOTAL.
     MOVE WD1 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE WC-ZERO-AMTS TO WA-CT-ACCUMS.
130-7-X.     EXIT.
130-9-EOF.
     PERFORM 130-7-CT-TOTL THRU 130-7-X.
     PERFORM 130-3-FUNC.
     PERFORM 130-6-TOTL THRU 130-6-X.
     MOVE SPACE TO WH-FP-CNTL.
     DISPLAY ' '.  DISPLAY ' '.
130-9.
     MOVE 'ANOTHER REPORT? Y OR N' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 810-READ-COMMAND THRU 810-X.
     IF END-COMMAND GO TO 130-99-END.
     IF W-CMND1 = 'N' GO TO 130-99-END.
     IF W-CMND1 = 'Y'
         MOVE LOW-VALUES TO WH-KEY
         MOVE WC-ZERO-AMTS TO WA-TOTL-ACCUMS
         GO TO 130-1.
     GO TO 130-9.
130-54-DIST.
     SET IDIST TO 1.
     SEARCH WT-DISTRICT AT END GO TO 130-54-ATEND
         WHEN WH-LOC-DIST EQUAL WT-DIST (IDIST)
         MOVE WT-DIST-DES (IDIST) TO W-RESPONSE-1 WH-RPT-DESC
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         GO TO 130-54-X.
130-54-ATEND.     MOVE '*INVALID DIST' TO W-RESPONSE-1.
     MOVE WPLAN-DIST TO W-RESPONSE-6.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
130-54-X.    EXIT.
130-55-ASTERIK.
     MOVE '********************' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
130-55-X.    EXIT.
130-56-FUNC.
     SET IFUNC TO 1.
     SEARCH WT-FUNCTION AT END GO TO 130-56-ATEND
         WHEN WPLAN-FUNCTION EQUAL WT-FUNC (IFUNC)
         MOVE WT-FUNC-DES (IFUNC) TO W-RESPONSE-1
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         GO TO 130-56-X.
130-56-ATEND.     MOVE '*INVALID FUNC' TO W-RESPONSE-1.
     MOVE WPLAN-FUNCTION TO W-RESPONSE-6.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
130-56-X.    EXIT.
130-57-GROUP.
     SET IGRP TO 1.
     SEARCH WT-GROUP AT END GO TO 130-57-ATEND
         WHEN WPLAN-GROUP EQUAL WT-GRP (IGRP),
         MOVE WT-GRP-DES (IGRP) TO W-RESPONSE-2,
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         GO TO 130-57-X.
130-57-ATEND.     MOVE '*INVALID GROUP' TO W-RESPONSE-2.
     MOVE WPLAN-GROUP TO W-RESPONSE-6.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
130-57-X.
     EXIT.
130-58-CT.
     SET ICT TO 1.
     SEARCH WT-CLSTYP AT END GO TO 130-58-ATEND
       WHEN WPLAN-CLASSTYP EQUAL WT-CT(ICT)
       MOVE WT-CT-DES(ICT) TO W-RESPONSE-3
       PERFORM 800-WRITE-RESPONSE THRU 800-X
       GO TO 130-58-X.
130-58-ATEND.      MOVE '*INVALID CT' TO W-RESPONSE-3.
      MOVE WPLAN-CLASSTYP TO W-RESPONSE-6.
      PERFORM 800-WRITE-RESPONSE THRU 800-X.
130-58-X.    EXIT.
130-59-SA.
      SET ISA TO 1.
     SEARCH WT-SUBACCT AT END GO TO 130-59-ATEND
         WHEN WPLAN-SUB-ACCT EQUAL WT-SA (ISA)
         MOVE WT-SA-DES (ISA) TO W-RESPONSE-4
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         GO TO 130-59-X.
130-59-ATEND.     MOVE '*INVALID SA' TO W-RESPONSE-4.
     MOVE WPLAN-SUB-ACCT TO W-RESPONSE-6.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
130-59-X.    EXIT.
130-60-MOHDG-1.
     MOVE WH5 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE WH3 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
    MOVE WH5 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     GO TO 130-60-X.
130-60-MOHDG-2.
     MOVE WH4 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
    MOVE WH5 TO W-RESPONSE-1.
    PERFORM 800-WRITE-RESPONSE THRU 800-X.
130-60-X.    EXIT.
130-61-MKTMGR.
     SET ITM TO 1.
     SEARCH WT-TMPMGR AT END GO TO 130-61-6
         WHEN WH-LOC-DIST EQUAL WT-TM (ITM)
         GO TO 130-61-5.
130-61-5.
     SET IMM TO 1.
     SEARCH WT-MKTMGR AT END GO TO 130-61-6
         WHEN WT-TM-MM (ITM) EQUAL WT-MM (IMM)
         MOVE WT-MM-DES (IMM) TO W-RESPONSE-1 WH-RPT-DESC
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         GO TO 130-61-X.
130-61-6.
     MOVE '*INVALID MKTMGR' TO W-RESPONSE-1.
     MOVE WT-TM-MM (ITM) TO W-RESPONSE-6.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
130-61-X.    EXIT.
130-62-VP.
     IF WT-TM-MM (ITM) = '1' OR '2' OR '3' OR '4'
         MOVE 'RETAIL VP - EAST' TO W-RESPONSE-1 WH-RPT-DESC
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         GO TO 130-62-X.
     MOVE 'RETAIL VP - WEST' TO W-RESPONSE-1 WH-RPT-DESC.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     GO TO 130-62-X.
130-62-X.     EXIT.
130-70-AMT1.
     MOVE WPLAN-JAN TO WD1-JAN.
     MOVE WPLAN-FEB TO WD1-FEB.
     MOVE WPLAN-MAR TO WD1-MAR.
     MOVE WPLAN-APR TO WD1-APR.
     MOVE WPLAN-MAY TO WD1-MAY.
     MOVE WPLAN-JUN TO WD1-JUN.
     MOVE WC-ZERO-YTD TO WD1-TOTAL.
     MOVE WD1 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     GO TO 130-70-X.
130-70-AMT2.
     MOVE WPLAN-JUL TO WD1-JUL.
     MOVE WPLAN-AUG TO WD1-AUG.
     MOVE WPLAN-SEP TO WD1-SEP.
     MOVE WPLAN-OCT TO WD1-OCT.
     MOVE WPLAN-NOV TO WD1-NOV.
     MOVE WPLAN-DEC TO WD1-DEC.
     MOVE WA-TOTAL-YTD TO WD1-TOTAL.
     MOVE WD1 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     GO TO 130-70-X.
130-70-X.     EXIT.
130-75-TOTL.
     ADD WPLAN-JAN TO WA-CT-JAN.
     ADD WPLAN-FEB TO WA-CT-FEB.
     ADD WPLAN-MAR TO WA-CT-MAR.
     ADD WPLAN-APR TO WA-CT-APR.
     ADD WPLAN-MAY TO WA-CT-MAY.
     ADD WPLAN-JUN TO WA-CT-JUN.
     ADD WPLAN-JUL TO WA-CT-JUL.
     ADD WPLAN-AUG TO WA-CT-AUG.
     ADD WPLAN-SEP TO WA-CT-SEP.
     ADD WPLAN-OCT TO WA-CT-OCT.
     ADD WPLAN-NOV TO WA-CT-NOV.
     ADD WPLAN-DEC TO WA-CT-DEC.
130-75-1.
     ADD WPLAN-JAN WPLAN-FEB WPLAN-MAR WPLAN-APR WPLAN-MAY
       WPLAN-JUN WPLAN-JUL WPLAN-AUG WPLAN-SEP WPLAN-OCT
       WPLAN-NOV WPLAN-DEC GIVING WA-TOTAL-YTD.
130-75-2.
     ADD WA-TOTAL-YTD TO WA-CT-TOTL.
130-75-X.     EXIT.
130-79-DUMMY.
     DISPLAY WC-BLANK-LINE.
130-79-X.    EXIT.
130-80-RPT-HDG.
     PERFORM 130-79-DUMMY THRU 130-79-X 3 TIMES.
     MOVE WH1 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE WH2 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
130-80-X.    EXIT.
130-99-END.
     DISPLAY ' '.
     MOVE WC-ZERO-AMTS TO WA-TOTL-ACCUMS.
     MOVE 'R' TO WS-ISAM.
     GO TO 115-ACCEPT-COMMAND.
140-CANCEL-ROUTINE.
     PERFORM 120-ADD-ROUTINE.
     IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
     PERFORM 120-1.
     IF CT-SA-ERR MOVE ' ' TO WS-CT-SA-ERR
       GO TO 140-CANCEL-ROUTINE.
     READ PLAN-I-FILE INVALID KEY GO TO 140-2.
140-1.
     MOVE FPLANI-REC TO W-PLAN.
     MOVE WC-ZERO-PLAN-MONTHS TO FPI-AMTS.
     DELETE FPLANI-REC INVALID KEY GO TO 815-ERROR.
     MOVE 'REC CANCELLED' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 140-5-NEG-AMT THRU 140-5-X.
     PERFORM 140-4 THRU 140-4-X.
     GO TO 140-6.
140-2.
     MOVE 'ACCT NOT FOUND' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     GO TO 140-6.
140-4.
     MOVE WPLAN-KEY TO WH-KEY-HOLD.
     MOVE 000 TO WPLAN-DIST.
     MOVE WPLAN-KEY TO WH-KEY.
     PERFORM 815-WRITE-ISAM THRU 815-X.
     MOVE 0 TO WPLAN-MKT-MGR.
     MOVE WPLAN-KEY TO WH-KEY.
     PERFORM 815-WRITE-ISAM THRU 815-X.
     MOVE 0 TO WPLAN-VP.
     MOVE WPLAN-KEY TO WH-KEY.
     PERFORM 815-WRITE-ISAM THRU 815-X.
     MOVE WH-KEY-HOLD TO WPLAN-KEY.
140-4-X.     EXIT.
140-5-NEG-AMT.
     COMPUTE WPLAN-JAN = WPLAN-JAN * WC-MINUS-1.
     COMPUTE WPLAN-FEB = WPLAN-FEB * WC-MINUS-1.
     COMPUTE WPLAN-MAR = WPLAN-MAR * WC-MINUS-1.
     COMPUTE WPLAN-APR = WPLAN-APR * WC-MINUS-1.
     COMPUTE WPLAN-MAY = WPLAN-MAY * WC-MINUS-1.
     COMPUTE WPLAN-JUN = WPLAN-JUN * WC-MINUS-1.
     COMPUTE WPLAN-JUL = WPLAN-JUL * WC-MINUS-1.
     COMPUTE WPLAN-AUG = WPLAN-AUG * WC-MINUS-1.
     COMPUTE WPLAN-SEP = WPLAN-SEP * WC-MINUS-1.
     COMPUTE WPLAN-OCT = WPLAN-OCT * WC-MINUS-1.
     COMPUTE WPLAN-NOV = WPLAN-NOV * WC-MINUS-1.
     COMPUTE WPLAN-DEC = WPLAN-DEC * WC-MINUS-1.
140-5-X.     EXIT.
140-6.
     MOVE 'ANOTHER CANCEL? Y OR N' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 810-READ-COMMAND THRU 810-X.
     IF YES-COMMAND GO TO 140-CANCEL-ROUTINE.
     IF NO-COMMAND OR END-COMMAND GO TO 115-ACCEPT-COMMAND.
     GO TO 140-6.
150-CHANGE-ROUTINE.
     MOVE WM-30 TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 810-READ-COMMAND THRU 810-X.
     IF W-CMND1-6 = 'CODING' GO TO 150-2.
     IF W-CMND1-6 = 'AMOUNT' GO TO 150-5-AMTS.
     IF W-CMND1-6 = 'TOTREC'
         MOVE WS-SW-ON TO WS-TOTAL-CORR
         GO TO 150-5-AMTS.
     IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
     GO TO 150-CHANGE-ROUTINE.
150-2.
     MOVE 'OLD CODING?' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 120-ADD-ROUTINE.
     IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
     PERFORM 120-1.
     IF CT-SA-ERR MOVE ' ' TO WS-CT-SA-ERR
       GO TO 150-2.
     READ PLAN-I-FILE INVALID KEY
         MOVE 'ACCT NOT FOUND' TO W-RESPONSE-1
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         GO TO 150-2.
     MOVE FPLANI-REC TO W-PLAN  WH-PLAN
     PERFORM 140-5-NEG-AMT THRU 140-5-X.
     PERFORM 815-WRITE-ISAM THRU 815-X.
     PERFORM 140-4 THRU 140-4-X.
     MOVE 'OLD CODING AMTS BACKED OUT' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
150-3.
     MOVE 'NEW CODING?' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 120-ADD-ROUTINE.
     IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
     PERFORM 120-1.
     IF CT-SA-ERR MOVE ' ' TO WS-CT-SA-ERR
       GO TO 150-3.
     READ PLAN-I-FILE INVALID KEY GO TO 150-4.
     MOVE WH-PLAN TO W-PLAN.
     MOVE WH-KEY TO WPLAN-KEY.
     MOVE SPACE TO W-DEL.
     PERFORM 815-WRITE-ISAM THRU 815-X.
     PERFORM 140-4 THRU 140-4-X.
     GO TO 150-4-1.
150-4.
     MOVE WPLAN-KEY TO WH-KEY.
     MOVE WH-PLAN TO W-PLAN.
     MOVE WH-KEY TO WPLAN-KEY.
     MOVE SPACE TO W-DEL.
     WRITE FPLANI-REC FROM W-PLAN INVALID KEY
       MOVE '*DISK ERROR - MUST TRY AGAIN' TO W-RESPONSE-1
       PERFORM 800-WRITE-RESPONSE THRU 800-X
       GO TO 150-3.
150-4-1.
     MOVE 'CHANGE HAS BEEN MADE' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     MOVE 'ANOTHER CHANGE?' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
      PERFORM 810-READ-COMMAND THRU 810-X.
     IF YES-COMMAND GO TO 150-CHANGE-ROUTINE.
     IF NO-COMMAND OR END-COMMAND GO TO 115-ACCEPT-COMMAND.
     GO TO 150-4-1.
150-5-AMTS.
     PERFORM 120-ADD-ROUTINE.
     IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
     PERFORM 120-1.
     IF CT-SA-ERR MOVE ' ' TO WS-CT-SA-ERR
       GO TO 150-5-AMTS.
     READ PLAN-I-FILE INVALID KEY
       MOVE 'ACCT NOT FOUND' TO W-RESPONSE-1
       PERFORM 800-WRITE-RESPONSE THRU 800-X
       GO TO 150-5-AMTS.
     MOVE WC-ZERO-PLAN-MONTHS TO WPLAN-AMOUNTS.
150-5-AMT-MSG.
     MOVE 'ENTER 1ST 3 POS OF MONTH TO BE CHANGED, ELSE ALL'
       TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
150-5.
     PERFORM 810-READ-COMMAND THRU 810-X.
     IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
     IF W-CMND1-3 = 'ALL' PERFORM 120-2-2 GO TO 150-4-1.
     IF W-CMND1-3 = 'JAN' PERFORM 150-8 THRU 150-8-X
       PERFORM 120-GET-AMT THRU 120-GET-AMT-X
       MOVE W-AMOUNT TO WPLAN-JAN
       GO TO 150-5-CK.
     IF W-CMND1-3 = 'FEB' PERFORM 150-8 THRU 150-8-X
       PERFORM 120-GET-AMT THRU 120-GET-AMT-X
       MOVE W-AMOUNT TO WPLAN-FEB
       GO TO 150-5-CK.
     IF W-CMND1-3 = 'MAR' PERFORM 150-8 THRU 150-8-X
       PERFORM 120-GET-AMT THRU 120-GET-AMT-X
       MOVE W-AMOUNT TO WPLAN-MAR
       GO TO 150-5-CK.
     IF W-CMND1-3 = 'APR' PERFORM 150-8 THRU 150-8-X
       PERFORM 120-GET-AMT THRU 120-GET-AMT-X
       MOVE W-AMOUNT TO WPLAN-APR
       GO TO 150-5-CK.
     IF W-CMND1-3 = 'MAY' PERFORM 150-8 THRU 150-8-X
       PERFORM 120-GET-AMT THRU 120-GET-AMT-X
       MOVE W-AMOUNT TO WPLAN-MAY
       GO TO 150-5-CK.
     IF W-CMND1-3 = 'JUN' PERFORM 150-8 THRU 150-8-X
       PERFORM 120-GET-AMT THRU 120-GET-AMT-X
       MOVE W-AMOUNT TO WPLAN-JUN
       GO TO 150-5-CK.
     IF W-CMND1-3 = 'JUL' PERFORM 150-8 THRU 150-8-X
       PERFORM 120-GET-AMT THRU 120-GET-AMT-X
       MOVE W-AMOUNT TO WPLAN-JUL
       GO TO 150-5-CK.
     IF W-CMND1-3 = 'AUG' PERFORM 150-8 THRU 150-8-X
       PERFORM 120-GET-AMT THRU 120-GET-AMT-X
       MOVE W-AMOUNT TO WPLAN-AUG
       GO TO 150-5-CK.
     IF W-CMND1-3 = 'SEP' PERFORM 150-8 THRU 150-8-X
       PERFORM 120-GET-AMT THRU 120-GET-AMT-X
       MOVE W-AMOUNT TO WPLAN-SEP
       GO TO 150-5-CK.
     IF W-CMND1-3 = 'OCT' PERFORM 150-8 THRU 150-8-X
       PERFORM 120-GET-AMT THRU 120-GET-AMT-X
       MOVE W-AMOUNT TO WPLAN-OCT
       GO TO 150-5-CK.
     IF W-CMND1-3 = 'NOV' PERFORM 150-8 THRU 150-8-X
       PERFORM 120-GET-AMT THRU 120-GET-AMT-X
       MOVE W-AMOUNT TO WPLAN-NOV
       GO TO 150-5-CK.
     IF W-CMND1-3 = 'DEC' PERFORM 150-8 THRU 150-8-X
       PERFORM 120-GET-AMT THRU 120-GET-AMT-X
       MOVE W-AMOUNT TO WPLAN-DEC
       GO TO 150-5-CK.
     MOVE '*INVALID MONTH' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     GO TO 150-5-AMT-MSG.
150-5-CK.
      MOVE 'ANOTHER MONTH TO CHANGE? Y OR N? ' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 810-READ-COMMAND THRU 810-X.
     IF YES-COMMAND GO TO 150-5-AMT-MSG.
     IF NO-COMMAND GO TO 150-6.
     IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
     GO TO 150-5-CK.
150-6.
     IF TOTAL-CORR MOVE SPACE TO WS-TOTAL-CORR
     ELSE PERFORM 815-WRITE-ISAM THRU 815-X.
     PERFORM 140-4 THRU 140-4-X.
     GO TO 150-4-1.
150-8.
     MOVE W-CMND1-3 TO WM-42-MO.
     MOVE WM-42 TO W-RESPONSE-1.
150-8-X.     EXIT.
160-DISPLAY-ROUTINE.
     PERFORM 120-ADD-ROUTINE.
     IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
     PERFORM 120-1.
     IF CT-SA-ERR MOVE ' ' TO WS-CT-SA-ERR
       GO TO 160-DISPLAY-ROUTINE.
160-LEVEL-CK.
     MOVE 'WHAT LEVEL?' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 810-READ-COMMAND THRU 810-X.
     IF END-COMMAND GO TO 115-ACCEPT-COMMAND.
     MOVE WPLAN-KEY TO WH-KEY-HOLD.
     IF LOC-COMMAND GO TO 160-READ.
     IF MKT-COMMAND MOVE 000 TO WPLAN-DIST
       MOVE WPLAN-KEY TO WH-KEY GO TO 160-READ.
     IF VP-COMMAND MOVE 000 TO WPLAN-DIST
       MOVE 0 TO WPLAN-MKT-MGR
       MOVE WPLAN-KEY TO WH-KEY GO TO 160-READ.
     IF ALL-COMMAND MOVE 000 TO WPLAN-DIST
       MOVE 0 TO WPLAN-MKT-MGR WPLAN-VP
       MOVE WPLAN-KEY TO WH-KEY GO TO 160-READ.
     GO TO 160-LEVEL-CK.
160-READ.
     READ PLAN-I-FILE INTO W-PLAN INVALID KEY
       MOVE 'ACCT NOT FOUND' TO W-RESPONSE-1
       PERFORM 800-WRITE-RESPONSE THRU 800-X
       GO TO 160-1.
     IF WPLAN-AMOUNTS = WC-ZERO-PLAN-MONTHS
         MOVE 'ACCT HAS NO BUDGET' TO W-RESPONSE-1
         PERFORM 800-WRITE-RESPONSE THRU 800-X
         GO TO 160-1.
     PERFORM 130-3-FUNC-X THRU 130-4.
     MOVE WC-ZERO-AMTS TO WA-CT-ACCUMS.
160-1.
     MOVE WH-KEY-HOLD TO WPLAN-KEY.
     MOVE 'ANOTHER DISPLAY? Y OR N? ' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 810-READ-COMMAND THRU 810-X.
     IF YES-COMMAND GO TO 160-DISPLAY-ROUTINE.
     IF NO-COMMAND OR END-COMMAND GO TO 115-ACCEPT-COMMAND.
     GO TO 160-1.
160-X.     EXIT.
500-LOAD-TBLS.
     OPEN INPUT TABLE-FILE.
     MOVE HIGH-VALUES TO WT-TBL-CT, WT-TBL-CTSA, WT-TBL-TEMPMGR
         WT-TBL-DIST, WT-TBL-GRUP, WT-TBL-FUNC,
                    WT-TBL-SA, WT-TBL-REG, WT-TBL-MKTMGR.
     SET ICT TO 1.   SET ISA TO 1.   SET IRG TO 1.   SET IMM TO 1.
     SET ITM TO 1.   SET ICTSA TO 1.
     SET IDIST TO 1.  SET IGRP TO 1.  SET IFUNC TO 1.
500-1-READ.
     READ TABLE-FILE AT END CLOSE TABLE-FILE GO TO 500-OUT.
     IF FTBL-ID = 'TJCLSTYP' AND FTBL-CODE = 'TE' GO TO 500-2.
     IF FTBL-ID = 'TJSUBACT' AND FTBL-CODE = 'TE' GO TO 500-3.
     IF FTBL-ID = 'TJREGION' AND FTBL-CODE = 'TE' GO TO 500-4.
     IF FTBL-ID = 'TJMKTMGR' AND FTBL-CODE = 'TE' GO TO 500-5.
     IF FTBL-ID = 'TJTMPMGR' AND FTBL-CODE = 'TE' GO TO 500-6.
     IF FTBL-ID = 'TJCTSUBA' AND FTBL-CODE = 'TE' GO TO 500-7.
     IF FTBL-ID = 'TJDIRICT' AND FTBL-CODE = 'TE' GO TO 500-8.
     IF FTBL-ID = 'TJFUNCTN' AND FTBL-CODE = 'TE' GO TO 500-9.
     IF FTBL-ID = 'TJCLTYGP' AND FTBL-CODE = 'TE' GO TO 500-10.
     GO TO 500-1-READ.
500-2.  IF ICT > 110 DISPLAY '*CT TBL FULL*' GO TO 500-1-READ.
     MOVE FTBL-ARG-2 TO WT-CT (ICT).
     MOVE FTBL-RESULT TO WT-CT-DES (ICT).
     SET ICT UP BY 1.
     GO TO 500-1-READ.
500-3.  IF ISA > 130 DISPLAY '*SA TBL FULL*' GO TO 500-1-READ.
     MOVE FTBL-ARG-4 TO WT-SA (ISA).
     MOVE FTBL-RESULT TO WT-SA-DES (ISA).
     SET ISA UP BY 1.
     GO TO 500-1-READ.
500-4.
     IF IRG > 40 DISPLAY '*RGN TBL FULL*' GO TO 500-1-READ.
     MOVE FTBL-ARG-3 TO WT-REG (IRG).
     MOVE FTBL-RESULT TO WT-REG-DES (IRG).
     SET IRG UP BY 1.
     GO TO 500-1-READ.
500-5.
     IF IMM > 12 DISPLAY '*MKTMGR TBL FULL*' GO TO 500-1-READ.
     MOVE FTBL-ARG-1 TO WT-MM (IMM).
     MOVE FTBL-RESULT TO WT-MM-DES (IMM).
     SET IMM UP BY 1.
     GO TO 500-1-READ.
500-6.
     IF ITM > 60 DISPLAY '*TEMPMGR TBL FULL*' GO TO 500-1-READ.
     MOVE FTBL-ARG-3 TO WT-TM (ITM).
     MOVE FTBL-RESULT-1 TO WT-TM-MM (ITM).
     SET ITM UP BY 1.
     GO TO 500-1-READ.
500-7.
     IF ICTSA > 25 DISPLAY '*CT/SA TBL FULL*' GO TO 500-1-READ.
     MOVE FTBL-ARG-5 TO WT-CTSA (ICTSA).
     MOVE FTBL-RESULT TO WT-CTSA-DES (ICTSA).
     SET ICTSA UP BY 1.
     GO TO 500-1-READ.
500-8.
     IF IDIST > 60 DISPLAY '*DISTRICT TBL FULL*'
             GO TO 500-1-READ.
     MOVE FTBL-ARG-3 TO WT-DIST (IDIST).
     MOVE FTBL-RESULT TO WT-DIST-DES (IDIST).
     SET IDIST UP BY 1.
     GO TO 500-1-READ.
500-9.
     IF IFUNC > 30 DISPLAY '*FUNC TBL FULL*'
             GO TO 500-1-READ.
     MOVE FTBL-ARG-2 TO WT-FUNC (IFUNC).
     MOVE FTBL-RESULT TO WT-FUNC-DES (IFUNC).
     SET IFUNC UP BY 1.
     GO TO 500-1-READ.
500-10.
     IF IGRP > 12 DISPLAY '*GRP TBL FULL*'
             GO TO 500-1-READ.
     MOVE FTBL-ARG-1 TO WT-GRP (IGRP).
     MOVE FTBL-RESULT TO WT-GRP-DES (IGRP).
     SET IGRP UP BY 1.
     GO TO 500-1-READ.
500-OUT.
     SET ICT DOWN BY 1. SET WA-CT TO ICT.
     SET ISA DOWN BY 1. SET WA-SA TO ISA.
     SET IRG DOWN BY 1. SET WA-REG TO IRG.
     SET IMM DOWN BY 1. SET WA-MM TO IMM.
     SET ITM DOWN BY 1. SET WA-TMPMGR TO ITM.
     SET IDIST DOWN BY 1.  SET WA-DIST TO IDIST.
     SET IGRP DOWN BY 1.  SET WA-GRP TO IGRP.
     SET IFUNC DOWN BY 1.  SET WA-FUNC TO IFUNC.
     SET ICTSA DOWN BY 1. SET WA-CTSA TO ICTSA.
500-X.       EXIT.
800-WRITE-RESPONSE.
     DISPLAY W-RESPONSE-1.
     MOVE WC-BLANK-LINE TO W-RESPONSE-1.
800-X.       EXIT.
801-WRITE-RESPONSE.
     DISPLAY W-RESPONSE-1 WITH NO ADVANCING.
     MOVE WC-BLANK-LINE TO W-RESPONSE-1.
801-X.     EXIT.
810-READ-COMMAND.
     ACCEPT W-COMMAND
     IF STOP-COMMAND GO TO 999-END.
810-X.       EXIT.
815-WRITE-ISAM.
     READ PLAN-I-FILE INVALID KEY
         GO TO 815-ADD.
     IF FPI-DEL-IND = HIGH-VALUE
         MOVE WC-ZERO-PLAN-MONTHS TO FPI-AMTS.
     MOVE SPACE TO FPI-DEL-IND.
     PERFORM 818-ADD-ACCUMS THRU 818-X.
     REWRITE FPLANI-REC INVALID KEY GO TO 815-ERROR.
     GO TO 815-X.
815-ADD.
     MOVE WPLAN-KEY TO WH-KEY FPI-KEY.
     MOVE SPACE TO FPI-DEL-IND.
     MOVE '3001' TO FPI-LI.
     MOVE SPACE TO FPI-TRANSP.
     MOVE 030 TO FPI-DSC.
     MOVE 99 TO FPI-AREA.
     MOVE 999 TO FPI-COMPLEX.
     MOVE WC-ZERO-PLAN-MONTHS TO FPI-AMTS.
     PERFORM 818-ADD-ACCUMS THRU 818-X.
     WRITE FPLANI-REC INVALID KEY GO TO 815-ERROR.
     GO TO 815-X.
815-ERROR.  DISPLAY 'INVALID KEY --- RECORD NOT WRITTEN'.
815-X.     EXIT.
818-ADD-ACCUMS.
     ADD WPLAN-JAN TO FPI-JAN.
     ADD WPLAN-FEB TO FPI-FEB.
     ADD WPLAN-MAR TO FPI-MAR.
     ADD WPLAN-APR TO FPI-APR.
     ADD WPLAN-MAY TO FPI-MAY.
     ADD WPLAN-JUN TO FPI-JUN.
     ADD WPLAN-JUL TO FPI-JUL.
     ADD WPLAN-AUG TO FPI-AUG.
     ADD WPLAN-SEP TO FPI-SEP.
     ADD WPLAN-OCT TO FPI-OCT.
     ADD WPLAN-NOV TO FPI-NOV.
     ADD WPLAN-DEC TO FPI-DEC.
818-X.     EXIT.
820-CALC-FUNC.
     IF W-CLASSTYP = '23' OR '24' MOVE '40' TO WPLAN-FUNCTION
       GO TO 820-X.
     IF W-SUB-ACCT < '7000'
             MOVE '30' TO WPLAN-FUNCTION
             GO TO 820-X.
     IF W-SUB-ACCT < '8000'
             MOVE '10' TO WPLAN-FUNCTION
             GO TO 820-X.
     IF W-SUB-ACCT < '9000'
             MOVE '01' TO WPLAN-FUNCTION     ELSE
             MOVE '02' TO WPLAN-FUNCTION.
820-X.       EXIT.
825-CALC-GROUP.
     IF W-CLASSTYP = '01' OR '06' OR '07' OR '08' OR '09'
             MOVE '1' TO WPLAN-GROUP ELSE MOVE '2' TO WPLAN-GROUP.
825-X.   EXIT.
900-VALIDATE-LOC.
     MOVE W-CMND1-3 TO WPLAN-DIST.
     MOVE SPACE TO WS-LOC-ERR.
     SET ITM TO 1.
     SEARCH WT-TMPMGR AT END GO TO 900-1-ATEND
             WHEN W-CMND1-3 EQUAL WT-TM (ITM)
         DISPLAY 'GOOD LOC CODE'
             MOVE WT-TM-MM (ITM) TO WPLAN-MKT-MGR
             GO TO 900-1.
900-1-ATEND.     MOVE WS-SW-ON TO WS-LOC-ERR.
     GO TO 900-X.
900-1.
     IF VP-EAST-MM MOVE 1 TO WPLAN-VP GO TO 900-X.
     IF VP-WEST-MM MOVE 2 TO WPLAN-VP GO TO 900-X.
     DISPLAY 'BAD MKT-MGR'.
     MOVE WS-SW-ON TO WS-LOC-ERR.
900-X.     EXIT.
905-VALIDATE-CT-SA.
     SET ICT TO 1.
     SEARCH WT-CLSTYP AT END GO TO 905-1-ATEND
       WHEN WPLAN-CLASSTYP EQUAL WT-CT (ICT)
       GO TO 905-1.
905-1-ATEND.     MOVE WS-SW-ON TO WS-CT-SA-ERR.
     MOVE '*INVALID CT' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
905-1.
     SET ISA TO 1.
     SEARCH WT-SUBACCT AT END GO TO 905-2-ATEND
       WHEN WPLAN-SUB-ACCT EQUAL WT-SA (ISA)
       GO TO 905-X.
905-2-ATEND.     MOVE WS-SW-ON TO WS-CT-SA-ERR.
     MOVE '*INVALID SA' TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
905-X.     EXIT.
950-INIT.
     MOVE LOW-VALUES TO WH-KEY.
     MOVE 'S' TO WS-ISAM.
950-1.
     READ PLAN-I-FILE INTO W-PLAN INVALID KEY GO TO 950-END.
     MOVE WC-ZERO-PLAN-MONTHS TO WPLAN-AMOUNTS.
     REWRITE FPLANI-REC FROM W-PLAN INVALID KEY
         DISPLAY '*INVALID KEY DURING INIT*'
         GO TO 950-END.
     GO TO 950-1.
950-END.
     DISPLAY 'END OF INIT PHASE'.  GO TO 130-99-END.
962-OPEN-PLANI-IO.
     OPEN I-O PLAN-I-FILE.
970-CLOSE-PLANI-FILE.
     CLOSE PLAN-I-FILE.
999-END.
     MOVE '**END OF BUDGET SESSION - GOODBYE FOR NOW**'
         TO W-RESPONSE-1.
     PERFORM 800-WRITE-RESPONSE THRU 800-X.
     PERFORM 970-CLOSE-PLANI-FILE.
     STOP RUN.
 A@HÊ