IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 ANSWER PICTURE 9.
77 FIRST-VALUE PICTURE 9; VALUE IS 2.
77 SECOND-VALUE PICTURE 9; VALUE IS 3.
PROCEDURE DIVISION.
CALCULATION. COMPUTE ANSWER=FIRST-VALUE+
   SECOND-VALUE. DISPLAY ANSWER. STOP RUN.
