IDENTIFICATION DIVISION.
PROGRAM-ID. ISTEST.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
77  SKEY      PICTURE 9(6).
77  EKEY      PICTURE 9(6).
77  INC       PICTURE 9(6).
PROCEDURE DIVISION.
A00-BEGIN.
    ACCEPT SKEY,EKEY,INC.
    DISPLAY "VALUES READ ",SKEY,",",EKEY,",",INC.
A20-END.
    STOP RUN.
