IDENTIFICATION DIVISION.
PROGRAM-ID. CODMOD.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES. CHANNEL (1) IS TOP-OF-PAGE.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
        SELECT TSTSVN ASSIGN TO DSK
        RECORDING MODE IS ASCII.
        SELECT TSTSIX ASSIGN TO DSK
        RECORDING MODE IS SIXBIT.
        SELECT TSTASC ASSIGN TO DSK
        RECORDING MODE IS ASCII.
        SELECT TSTBIN ASSIGN TO DSK
        RECORDING MODE IS BINARY.
DATA DIVISION.
FILE SECTION.
FD  TSTSVN
        VALUE OF ID IS 'TSTSVN   '.
01  SVNREC USAGE DISPLAY-7.
        5 U-7 PIC X(7).
        5 N-7 PIC S9(4).
01  SVNRC2 DISPLAY-7.
        5 SVN-2 PIC S9(4).
FD  TSTSIX
        VALUE OF ID IS "TSTSIX   ".
01  SIXREC.
        5 U-6 PIC X(7).
        5 U-B PIC S9(4) COMP.
01  SIXRC2.
        5 N-6 PIC S9(4).
FD  TSTASC
        BLOCK CONTAINS 2 RECORDS
        VALUE OF ID IS "TSTASC   ".
01  ASCREC.
        5 U-6 PIC X(7).
        5 U-B PIC S9(4) COMP.
01  ASCRC2.
        5 N-6 PIC S9(4).
FD  TSTBIN
        VALUE OF ID IS 'TSTBIN   '.
01  BINREC.
        5 U-6 PIC X(7).
        5 U-B PIC S9(4) COMP.
01  BINRC2.
        5 N-6 PIC S9(4).
PROCEDURE DIVISION.
OPEN-FILES.
        OPEN OUTPUT TSTSVN.
        OPEN OUTPUT TSTSIX.
        OPEN OUTPUT TSTASC.
        OPEN OUTPUT TSTBIN.
STUFF-AND-WRITE.
        MOVE 'ABC-123' TO U-6 IN ASCREC, U-6 IN SIXREC, U-6 IN BINREC
           U-7 IN SVNREC.
        MOVE 15 TO U-B IN ASCREC, U-B IN SIXREC, U-B IN BINREC
           N-7 IN SVNREC.
        WRITE SVNREC AFTER ADVANCING TOP-OF-PAGE.
        WRITE SIXREC.
        WRITE ASCREC.
        WRITE BINREC.
        MOVE -15 TO N-6 IN ASCRC2, N-6 IN SIXRC2, N-6 IN BINRC2,
           SVN-2.
        WRITE SVNRC2 AFTER ADVANCING 2 LINES.
        WRITE SIXRC2.
        WRITE ASCRC2.
        WRITE BINRC2.
DO-IT-AGAIN.
        PERFORM STUFF-AND-WRITE.
        CLOSE TSTSVN.
        CLOSE TSTSIX.
        CLOSE TSTASC.
        CLOSE TSTBIN.
        STOP RUN.
