IDENTIFICATION DIVISION.
PROGRAM-ID. CONIS.
AUTHOR. BILL CONIS.
INSTALLATION. TYMSHARE.
DATE-WRITTEN. APRIL 20,1973.
DATE-COMPILED. TODAY.
SECURITY. NONE.
REMARKS. DEMO PROGRAM.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
        SELECT DATAFILE ASSIGN TO DSK
        RECORDING MODE IS ASCII.
        SELECT OUTFILE ASSIGN TO DSK
        RECORDING MODE IS ASCII.
DATA DIVISION.
FILE SECTION.
FD DATAFILE
        LABEL RECORDS ARE STANDARD
        VALUE OF IDENTIFICATION IS "DATAF    ".
01 DATAREC.
                   05 COMP-IX PIC 9(6).
                   05 STOR-IX PIC 9(5).
                   05 COMP-X PIC 9(5).
                   05 STOR-X PIC 9(4).
                   05 PRODUCTS PIC 9(5).
                   05 IX-GROWTH PIC V99.
                   05 X-GROWTH PIC V99.
                   05 PR-GROWTH PIC VP9.
FD OUTFILE
         VALUE OF IDENTIFICATION IS "REPORTDAT".
01 OUTREC.
                   05 MARGIN PIC X(22).
                   05 Q1 PIC $(11).
                   05 Q1R REDEFINES Q1 PIC Z(11).
                   05 Q1RR REDEFINES Q1 PIC X(11).
                   05 APRIL PIC $(11).
                   05 APRILR REDEFINES APRIL PIC Z(11).
                   05 APRILRR REDEFINES APRIL PIC X(11).
                   05 MAY PIC $(11).
                   05 MAYR REDEFINES MAY PIC Z(11).
                   05 MAYRR REDEFINES MAY PIC X(11).
                   05 JUNE PIC $(11).
                   05 JUNER REDEFINES JUNE PIC Z(11).
                   05 JUNERR REDEFINES JUNE PIC X(11).
WORKING-STORAGE SECTION.
77 QTRREV PIC 9(11) VALUE ZEROES.
77 APRILREV PIC 9(11) VALUE ZEROES.
77 MAYREV PIC 9(11) VALUE ZEROES.
77 JUNEREV PIC 9(11) VALUE ZEROES.
77 TOTAL-QTR PIC 9(11) VALUE ZEROES.
77 TOTAL-APRIL PIC 9(11) VALUE ZEROES.
77 TOTAL-MAY PIC 9(11) VALUE ZEROES.
77 TOTAL-JUNE PIC 9(11) VALUE ZEROES.
77 GRAND-TOTAL-QTR PIC 9(11) VALUE ZEROES.
77 GRAND-TOTAL-APRIL PIC 9(11) VALUE ZEROES.
77 GRAND-TOTAL-MAY PIC 9(11) VALUE ZEROES.
77 GRAND-TOTAL-JUNE PIC 9(11) VALUE ZEROES.
77 COUNT PIC 9 VALUE ZEROES.
77 PERCENT PIC V99.
01  HEADING-1.
         05 FILLER PIC X(29) VALUE SPACES.
         05 FILLER PIC X(12) VALUE 'TYMSHARE INC'.
         05 FILLER PIC X(25) VALUE SPACES.
01  HEADING-2.
         05 FILLER PIC X(26) VALUE SPACES.
         05 FILLER PIC X(17) VALUE 'NEW YORK DISTRICT'.
         05 FILLER PIC X(23) VALUE SPACES.
01  HEADING-3.
         05 FILLER PIC X(28) VALUE SPACES.
         05 FILLER PIC X(14) VALUE IS 'EASTERN REGION'.
         05 FILLER PIC X(24) VALUE SPACES.
01  HEADING-4.
         05 FILLER PIC X(22) VALUE SPACES.
         05 FILLER PIC X(22) VALUE '1ST QUARTER      APRIL'.
         05 FILLER PIC X(22) VALUE '        MAY       JUNE'.
PROCEDURE DIVISION.
HSE-KEEP.
         OPEN INPUT DATAFILE.
         OPEN OUTPUT OUTFILE.
WRITE-HEADINGS.
         WRITE OUTREC FROM HEADING-1.
         WRITE OUTREC FROM HEADING-2.
         WRITE OUTREC FROM HEADING-3 BEFORE ADVANCING 3 LINES.
         WRITE OUTREC FROM HEADING-4 BEFORE ADVANCING 2 LINES.
READ-DATA.
        READ DATAFILE RECORD AT END GO TO EOJ.
SET-UP.
        ADD 1 TO COUNT.
        IF COUNT IS EQUAL TO 1 MOVE COMP-IX TO QTRREV, MOVE
        IX-GROWTH TO PERCENT, MOVE 'TYMCOM IX COMPUTE     ' TO 
        MARGIN, GO TO PROCESSING.
        IF COUNT IS EQUAL TO 2 MOVE STOR-IX TO QTRREV, MOVE
        'TYMCOM IX STORAGE     ' TO MARGIN, GO TO PROCESSING.
        IF COUNT IS EQUAL TO 3 MOVE COMP-X TO QTRREV, MOVE
        X-GROWTH TO PERCENT, MOVE 'TYMCOM X COMPUTE      ' TO
        MARGIN, GO TO PROCESSING.
        IF COUNT IS EQUAL TO 4 MOVE STOR-X TO QTRREV, MOVE
        'TYMCOM X STORAGE      ' TO MARGIN, GO TO PROCESSING.
        IF COUNT IS EQUAL TO 5 MOVE PRODUCTS TO QTRREV, MOVE
        PR-GROWTH TO PERCENT, MOVE 'PRODUCTS              ' TO
        MARGIN, GO TO PROCESSING.
        GO TO PROCESSING.
PROCESSING.
        COMPUTE APRILREV ROUNDED = (QTRREV / 3) * PERCENT+(QTRREV / 3).
        COMPUTE MAYREV ROUNDED = APRILREV * PERCENT + APRILREV.
        COMPUTE JUNEREV ROUNDED = MAYREV * PERCENT + MAYREV.
        ADD QTRREV TO TOTAL-QTR.
        ADD QTRREV TO GRAND-TOTAL-QTR.
        ADD APRILREV TO TOTAL-APRIL.
        ADD APRILREV TO GRAND-TOTAL-APRIL.
        ADD MAYREV TO TOTAL-MAY.
        ADD MAYREV TO GRAND-TOTAL-MAY.
        ADD JUNEREV TO TOTAL-JUNE.
        ADD JUNEREV TO GRAND-TOTAL-JUNE.
        IF COUNT IS EQUAL TO 1 MOVE QTRREV TO Q1, MOVE APRILREV TO 
        APRIL, MOVE MAYREV TO MAY, MOVE JUNEREV TO JUNE; ELSE MOVE 
        QTRREV TO Q1R, MOVE APRILREV TO APRILR, MOVE MAYREV TO 
        MAYR, MOVE JUNEREV TO JUNER.
        IF COUNT IS EQUAL TO 5 WRITE OUTREC AFTER ADVANCING 1 LINES; 
        ELSE WRITE OUTREC.
        IF COUNT IS EQUAL TO 2 OR COUNT IS EQUAL TO 4 MOVE
        SPACES TO MARGIN, MOVE '   --------' TO Q1RR, MOVE 
        '     ------' TO APRILRR, MOVE '     ------' TO MAYRR, 
        MOVE '     ------' TO JUNERR, WRITE OUTREC, MOVE 
        'TYMCOM IX TOTAL       ' TO MARGIN, MOVE TOTAL-QTR TO
        Q1R, MOVE TOTAL-APRIL TO APRILR, MOVE TOTAL-MAY TO MAYR, 
        MOVE TOTAL-JUNE TO JUNER, MOVE ZEROES TO TOTAL-QTR, 
        TOTAL-APRIL, TOTAL-MAY, TOTAL-JUNE.
        IF COUNT IS EQUAL TO 4 MOVE 'TYMCOM X TOTAL        ' TO 
        MARGIN, WRITE OUTREC BEFORE ADVANCING 2 LINES.
        IF COUNT IS EQUAL TO 2 WRITE OUTREC BEFORE ADVANCING
        2 LINES.
        IF COUNT IS EQUAL TO 4 MOVE 'TOTAL SERVICE         ' TO 
        MARGIN, MOVE GRAND-TOTAL-QTR TO Q1R, MOVE GRAND-TOTAL-APRIL
        TO APRILR, MOVE GRAND-TOTAL-MAY TO MAYR, MOVE 
        GRAND-TOTAL-JUNE TO JUNER, WRITE OUTREC.
        IF COUNT IS EQUAL TO 5 GO TO EOJ; ELSE GO TO SET-UP.
EOJ.
        MOVE 'TOTAL REVENUES        ' TO MARGIN.
        MOVE GRAND-TOTAL-QTR TO Q1R.
        MOVE GRAND-TOTAL-APRIL TO APRILR.
        MOVE GRAND-TOTAL-MAY TO MAYR.
        MOVE GRAND-TOTAL-JUNE TO JUNER.
        WRITE OUTREC AFTER ADVANCING 2 LINES.
         CLOSE DATAFILE,OUTFILE
         STOP RUN.
