IDENTIFICATION DIVISION.
PROGRAM-ID. FORCST.
AUTHOR. FRED BUTTERFIELD.
INSTALLATION. PDP10.
DATE-WRITTEN. APRIL 24, 1973.
SECURITY. NONE.
REMARKS. FOR TRAINING.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
        SELECT DATAIN ASSIGN TO DSK
        RECORDING MODE IS ASCII.
        SELECT RPT ASSIGN TO DSK
        RECORDING MODE IS ASCII.
DATA DIVISION.
FILE SECTION.
FD DATAIN
        VALUE OF IDENTIFICATION IS 'DATAINDAT'.
01 IN-REC
        02 QTR1 PIC 9(7).
        02 APR  PIC 9(7).
        02 MAY  PIC 9(7).
FD RPT
      VALUE OF IDENTIFICATION IS 'RPT   DAT'.
01 OUT-REC
        02 QTR1 PIC9(7).
        02 APR PIC 9(7).
        02 MAY PIC 9(7).
        02 JUN PIC 9(7).
        02 TOTAL PIC 9(7).
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
USER-FIRST-PARAGRAPH.
        OPEN DATAIN INPUT.
        PERFORM READ-1 VARYING M FROM 1 BY 1 UNTIL M GREATER 5.
        ACCEPT G1,G2,G3.
        PERFORM FRCST VARYING I FROM 2 BY 1 UNTIL I GREATER 4.
        PERFORM SUMMATION VARYING I FROM 1 BY 1 UNTIL I GREATER 4
        AFTER J FROM 1 BY 1 UNTIL J GREATER 9.
        PERFORM SUBS VARYING I FROM 1 BY 1 UNTIL I GREATER 5.
        END RUN.
READ-1. READ DATAIN INTO R(M).
FRCST.  R(1,J)=R(1,J-1)*(1+G1)
        R(2,J)=R(2,J-1)
        R(4,J)=R(4,J-1)*(1+G2)
        R(5,J)=R(5,J-1)
        R(8,J)=R(8,J-1)*(1+G3)
SUMMATION. R(J,5)=R(J,5)+R(J,I)
SUBS.   R(3,I)=R(1,I)+R(2,I)
        R(6,I)=R(4,I)+R(5,I)
        R(7,I)=R(3,I)+R(6,I)
        R(9,I)=R(8,I)+R(7,I)
