IDENTIFICATION  DIVISION.
PROGRAM-ID.   IH340  REVISION A.
AUTHOR.       MSDO.
DATE-WRITTEN.  APRIL 1971.
DATE-COMPILED.  09/15/72.
REMARKS. PAYROLL COMPUTATION PROGRAM

     THE PAYROLL IS PREPARED IN BADGE NUMBER SEQUENCE WITHIN
     ACTIVITY AND GRADED AND UNGRADED, USING THE PAYROLL MASTER
     RECORD AS THE BASIS. PAYROLL IS COMPUTED ON AN EXCEPTION
     BASIS. THE EXCEPTIONS ARE PROCESSED FROM THE TIME CARDS. IN
     ADDITION TO PAYROLL EXCEPTION ADJUSTMENTS, LEAVE WITHOUT
     PAY IS PROCESSED FROM THE LEAVE PROGRAM.
     THE SEQUENCE FOR PAYROLL PROCESSING IS

     ACTIVITY MAJOR POS 001
     GRADED OR UNGRADED INT POS 002
     CONTROL GROUP INT POS 003-004
     BADGE MINOR POS 005-010


     THE MASTER PERSONNEL RECORD IS UPDATED BI-WEEKLY TO
     BRING EARNING AND DEDUCTION TOTALS UP TO DATE.

     THE SMOOTH ROLL IS PREPARED FOR PERSONEL SERVICES
     SHOWING EACH INDIVIDUAL PAY RECORD FOR THE PAY PERIOD. IT
     INCLUDES PAGE CONTROL-GROUP ACTIVITY AND GRAND TOTALS

     THE PAYROLL WORK TAPE IS CREATED FOR USE IN PREPARING
     INDIVIDUAL PAYROLL CHECKS, EARNING STATEMENTS, AND
     WITH-HOLDING STATEMENTS.

     CONTROL GROUP TOTALS AND ERROR NOTIFICATION
     MESSAGE ARE PREPARED

     THE PAYROLL EXCEPTION LISTING BY ACTIVITY IS PREPARED
     FOR ALL EXCEPTIONS THAT CANNOT BE AUDITED FROM THE SMOOTH
     ROLL. THIS INCLUDES INDIVIDUAL EXCEPTION CODES WITH EXCEP-
     TION DESCRIPTIONS.


     PAYROLL PROGRAM ROUTINE AND PAGE NUMBER CROSS REFERENCE.
     ROUTINE PAGE NO.
     HOUSEKEEPING 100
     READ PERSONNEL MASTER FILE 108
     READ PAYROLL DETAIL FILE 116
     MATCH PERSONNEL MASTER VS PAYROLL DETAIL 120
     DETAIL PAYROLL CODES 122
     WRITE ERROR, NOTIFICATION MESSAGES 196
     COMPUTE OTHER THAN NORMAL HOURS AND PAY 202
     COMPUTE PAYROLL REGULAR PAY 236
     COMPUTE OVERTIME 252
     TEST FOR ANNUM MAXIMUM PAY 260
     TEST FOR MONEY ADJUSTMENTS 264
     COMPUTE GROSS MONEY 276
     COMPUTE FICA DEDUCTION 278
     COMPUTE CSRA DEDUCTION 286
     COMPUTE FEDERAL TAX DEDUCTION 290
     HEALTH INSURANCE DEDUCTION 298
     LIFE INSURANCE DEDUCTION 306
     BOND OR FREEDOM SHARE DEDUCTION 316
     GOVERNMENT INDEBTED DEDUCTION 324
     COMPUTE STATE TAX DEDUCTION 328
     UNION DUES DEDUCTION 332
     CHARITABLE CONTRIBUTION DEDUCTION 336
     SAVINGS ALLOTMENT DEDUCTION 338
     PREPARE SMOOTH ROLL HEADINGS 340
     PREPARE SMOOTH ROLL DETAIL LINES 346
     WRITE SMOOTH ROLL FILE 364
     PREPARE SMOOTH ROLL PAGE AND ACTIVITY TOTAL LINES 368
     PREPARE PAYROLL YTD ACTIVITY BALANCE TOTALS 374
     PREPARE PAYROLL CONTROL GROUP TOTALS 378
     PREPARE PAYROLL EARNINGS WORK TAPE 382
     CROSSFOOT CURRENT MONEY 388
     WRITE LABOR RECONCILIATION FILE 392
     PREPARE PAYROLL EXCEPTION LISTING 394
     POST PAYROLL YTD TOTALS FOR BALANCE 402
     WRITE UPDATED PERSONNEL MASTER FILE 406
     END OF FILES 406
     END OF JOB 410

     PARAM CARD.
     CC 1 - 4 ZERO
     CC 5 COMPOSIT CHECK SWITCH
     0 = COMPOSIT CHECKS , 1 = BYPASS CHECKS
     CC 6 - 10 ZEROS
     CC 11 - 16 BEG PP DATE MMDDYY
     CC 17 - 22 END PP DATE MMDDYY
     CC 23 - 24 ROLL NR 01 THRU 27 EXCEPTED
     CC 25 - 48 BIPASS ACTIVITY CODES
     10 PLACES. RUN EXCEPTION CODES.
     CC 49 - 56 BEGINING CHECK NR
     CC 57 - 64 ENDING CHECK NR BLOCK 1 *
     CC 65 - 72 BEGINING CHECK NR BLOCK 2 *
     CC 73 - 80 ENDING CHECK NR BLOCK 2 *

     * NOTE IF ONLY ONE BLOCK OF CHECKS, ZEROS IN THESE COLUMNS.



     TAPE ID NAME REC SIZE BLK FAC DEVICE ASSGN
     IH110U01 PERS-MSTR-IN-FILE 0610 001 01D1
     IH335UT1 PAYROLL-DETAIL-FILE 0080 001 01D2
     IH110U01 PERS-MSTR-OUT-FILE 0610 001 01D3
     IH340U01 PAYROLL-WORK-FILE 0400 001 01D4
     IH340UP1 SMOOTH-ROLL-FILE 0160 001 01D5
     IH340UP2 CONTROL-ERROR-FILE 0120 001 01D6
     IH340UP3 PAY-EXCEPT-LIST-FILE 0120 001 01D7

     INTERNAL PROGRAM SWITCHES.
     SW1 ON = PAYROLL DETAIL ERROR.
     SW2 ON = PERSONNEL MASTER INPUT END OF FILE.
     SW3 ON = PAYROLL DETAIL INPUT END OF FILE.
     SW4 ON = THIRD SHIFT BONUS NIGHT PAY.
     SW5 ON = PAYROLL EXCEPTION PAY.
     SW6 ON = COMPUTE PAYROLL EXCEPTION.
     SW7 ON = CODE B BONUS.
     SW8 ON = WHARF BUILDER BONUS.
     SW9 ON = DIVER PAY.
     SW10 ON = OVERTIME PAY TO BE COMPUTED.
     SW11 ON = HOLIDAY HOURS WORKED AND PAID.
     SW12 ON = HOLIDAY INCLUDED IN ANNUAL LEAVE PAYOFF.
     SW13 ON = LIFE INSURANCE AND OPTION DEDUCTIONS CANCELLED.
     SW14 ON = HEALTH INSURANCE DEDUCTION CANCELLED.
     SW15 ON = TAX LEVY DEDUCTION.
     SW16 ON = RETROACTIVE REGULAR HOURS.
     SW17 ON = 80TH HOUR WITH ADDED PAY.
     SW18 ON = PAID BY VOUCHER, NO CHECK NUMBER.
     SW19 ON = CSRA DEDUCTION ADJUSTMENT.
     SW20 ON = FICA DEDUCTION ADJUSTMENT.
     SW21 ON = FEDERAL TAX DEDUCTION ADJUSTMENT.
     SW22 ON = HEALTH INSURANCE DEDUCTION ADJUSTMENT.
     SW23 ON = LIFE INSURANCE DEDUCTION ADJUSTMENT.
     SW24 ON = LIFE INSURANCE OPTION DEDUCTION ADJUSTMENT.
     SW25 ON = STATE TAX DEDUCTION ADJUSTMENT.
     SW26 ON = UNION DUES DEDUCTION ADJUSTMENT.
     SW27 ON = BOND DEDUCTION CANCELLED.
     SW28 ON = DECEASED ANNUAL LEAVE PAYOFF.
     SW29 ON = TERMINAL ANNUAL LEAVE PAYOFF.
     SW30 ON = CASH AWARD.
     SW31 ON = PAYROLL ERROR MESSAGE DO NOT WRITE DETAIL.
     SW32 ON = 25( SUNDAY PREMIUM REGULAR SCHEDULE.
     SW33 ON = 80TH HOUR WITH ADDED PAY HOURLY RATE SAVED.
     SW34 ON = HOLIDAY WORKED ADD TO OTHER MONEY.
     SW35 ON = FICA MAXIMUM REACHED CURRENT PERIOD.
     SW36 ON = COMPUTE TAX ON TOTAL CASH AWARD.
     SW37 ON = WRITE SEPARATE TAX LEVY CHECK.
     SW38 ON = END OF JOB.

     SW40 ON = CHARITY ADJUSTMENT
     SW41 ON = BOND ADJUSTMENT
     SW42 ON = RETRO OVERTIME
     SW43 ON = ALLOT1 ADJUSTMENT
     SW44 ON = ALLOT2 ADJUSTMENT
     SW45 ON = OTHER DED ADJUSTMENT
     SW46 ON = NET PAY ADJUSTMENT
     SW47 ON = NOT SUB TO FED TAX ADJUSTMENT
     SW48 ON = RETRO OTHER MONEY
     SW49 ON = PAYOFF LWOP INVOLVED
     SW50 ON = PAYOFF REGULAR
     SW51 ON = THIRD SHIFT OVERTIME (M)
     SW52 ON = SECOND SHIFT OVERTIME (L)
     SW53 ON = CODE K BONUS
     SW54 ON = CODE N BONUS
     SW55 ON = CODE R BONUS

ENVIRONMENT  DIVISION.

CONFIGURATION  SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
SPECIAL-NAMES.
     CHANNEL (1) IS NEXT-PAGE.

INPUT-OUTPUT  SECTION.
FILE-CONTROL.
     SELECT PERS-MSTR-IN-FILE ASSIGN DSK,
       RECORDING MODE IS ASCII.


     SELECT PAYROLL-DETAIL-FILE ASSIGN DSK,
       RECORDING MODE IS ASCII.


     SELECT PERS-MSTR-OUT-FILE ASSIGN DSK,
       RECORDING MODE IS ASCII.


     SELECT PAYROLL-WORK-FILE ASSIGN DSK,
       RECORDING MODE IS ASCII.


     SELECT SMOOTH-ROLL-FILE ASSIGN DSK,
       RECORDING MODE IS ASCII.


     SELECT CONTROL-ERROR-FILE,
        ASSIGN DSK,
       RECORDING MODE IS ASCII.

     SELECT PAY-EXCEPT-LIST-FILE ASSIGN DSK,
       RECORDING MODE IS ASCII.





DATA  DIVISION.
FILE  SECTION.
FD   PERS-MSTR-IN-FILE
     RECORD CONTAINS 610 CHARACTERS
     LABEL RECORDS ARE STANDARD
        VALUE OF IDENTIFICATION IS  "IH110U010"
     DATA RECORDS ARE PERS-MSTR-IN-REC, CONSTANT-REC-1,
                      CONSTANT-REC-2
          .
01   PERS-MSTR-IN-REC.
     02  MSTR-IN-SEQ.
         04  IN-ACTY-MAJOR   PICTURE X.
         04  IN-GORU-INTER   PICTURE X.
         04  IN-CNTL-GRP     PICTURE XX.
         04  IN-BADGE-MINOR  PICTURE X(6).
     02  FILLER              PICTURE X(600).


01  CONSTANT-REC-1.
     02 CON-ID               PICTURE X(30).
     02 CON-KEY              PICTURE X.
     02 ACT-DATA-1           PICTURE X(253).
     02 FILLER               PICTURE X.
     02 ACT-NAME             PICTURE X(20).
     02 FILLER               PICTURE XXX.
     02 ACT-DATA-2           PICTURE X(273).
     02 FILLER               PICTURE X(29).

01  CONSTANT-REC-2.
     02 FILLER               PICTURE X(31).
     02 UNION-DATA-IN        PICTURE X(175).
     02 LOCAL-CON            PICTURE X(404).


FD   PAYROLL-DETAIL-FILE
     RECORD CONTAINS 80 CHARACTERS
     LABEL RECORDS ARE STANDARD
        VALUE OF IDENTIFICATION IS  "IH335UT10"
     DATA RECORDS ARE PAYROLL-DETAIL-REC, PARAM-CARD
          .
01   PAYROLL-DETAIL-REC.
     02  DTL-SEQ.
         04  DTL-ACTY        PICTURE X.
         04  DTL-GORU        PICTURE X.
         04  DTL-CNTL-GRP    PICTURE XX.
         04  DTL-BADGE       PICTURE X(6).
     02  DTL-PAYROLL-CODES.
         04  DTL-PAY-CODE                    OCCURS 5 TIMES.
             06  PAY-CODE    PICTURE X.
             06  PAY-CODE-WEEK PICTURE X.
     02  REDEF-PAY-CODE REDEFINES DTL-PAYROLL-CODES.
         04  DTL-PAY-NUM     PICTURE 99      OCCURS 5 TIMES.
     02  DTL-HOURS           PICTURE S999V99.
     02 DTL-X-HOURS REDEFINES DTL-HOURS
                             PICTURE X(5).
     02  DTL-AMOUNT          PICTURE S9999V99.
     02  DTL-X-AMOUNT REDEFINES DTL-AMOUNT
                             PICTURE XXXXXX.
     02  FILLER              PICTURE X(49).
01   PARAM-CARD.
     02  PARAM-CNTL          PICTURE XXXX.
     02  PARAM-DATA-IN       PICTURE X(76).


FD   PERS-MSTR-OUT-FILE
     RECORD CONTAINS 610 CHARACTERS
     LABEL RECORDS ARE STANDARD
        VALUE OF IDENTIFICATION IS  "IH110U01B"
     DATA RECORDS ARE PERS-MSTR-OUT-REC
          .
01   PERS-MSTR-OUT-REC.
     02  MSTR-OUT-SEQ.
         04  MSTR-MAJ-CNTRL.
         06  MSTR-ACTY       PICTURE X.
         06  MSTR-GORU       PICTURE X.
             88  ANNUM-MSTR                  VALUE "G".
             88  DIEM-MSTR                   VALUE "U".
         06  MSTR-CONT-GRP   PICTURE XX.
         04  MSTR-BADGE      PICTURE X(6).
     02  MSTR-NAME           PICTURE X(20).
     02  MSTR-ACTIVE-CODE    PICTURE X.
         88  ACTIVE-MSTR                     VALUE " ".
     02  MSTR-COST-WORK-CNTR.
       04  CC-WC-ACTY        PICTURE X.
         04  MSTR-COST-CNTR  PICTURE XX.
         04  MSTR-WORK-CNTR  PICTURE XX.
     02  FILLER              PICTURE XXXX.
     02  MSTR-GS-ANNUM       PICTURE X.
         88  GS-GRADED-MSTR                  VALUE "1".
     02  MSTR-GS-GRADE       PICTURE XX.
     02  MSTR-STEP-NO        PICTURE XX.
     02  FILLER              PICTURE XXXX.
     02  PART-TIME-CODE      PICTURE X.
     02  MSTR-MARRIED-CODE   PICTURE X.
         88  MARRIED-MSTR                    VALUE "M".
         88  SINGLE-MSTR                     VALUE "S".
     02  MSTR-SS-NO          PICTURE X(12).
     02  FILLER              PICTURE X(61).
     02  MSTR-OCC-CD         PICTURE X(10).
     02  MSTR-RET-SER        PICTURE X(5).
     02  MSTR-ANNUAL-RATE    PICTURE S9(5)V99.
     02  FILLER          PICTURE X(29).
     02  MSTR-CLOCK-NO   PICTURE XX.
     02  FILLER          PICTURE X(24).
     02  MSTR-EOD-DATE.
         04  EOD-MODAY.
             06  EOD-MONTH   PICTURE 99.
             06  EOD-DAY     PICTURE 99.
         04  EOD-YEAR        PICTURE S99.
     02  FILLER              PICTURE X(67).
     02  MSTR-RETIRE-CODE    PICTURE X.
         88  CSRA-MSTR                       VALUE "1".
         88  FICA-MSTR                       VALUE "2".
     02  MSTR-FF-CODE        PICTURE X.
         88  FIRE-CHIEF-MSTR                 VALUE "1".
         88  FIRE-FIGHTER-MSTR               VALUE "2".
         88  FIRE-FIGHTER1-MSTR              VALUE "6".
         88  NOT-FF-MSTR                     VALUE " ".
     02  MSTR-FF-SUN-PREM-CD PICTURE X.
         88  FF-QRTR-PREM-MSTR               VALUE "1".
         88  FF-FULL-PREM-MSTR               VALUE "2".
         88  FF-HALF-PREM-MSTR               VALUE "6".
     02  MSTR-NITE-CODE      PICTURE X.
         88  2ND-SHIFT-MSTR                  VALUE "2".
         88  3RD-SHIFT-MSTR                  VALUE "3".
     02  MSTR-TAX-CODE       PICTURE S99.
     02  MSTR-ADDED-TAX      PICTURE S999.
     02  MSTR-STATE-TAX-CODE PICTURE X.
     02  MSTR-UNION-CODE     PICTURE X.
     02  MSTR-UNION REDEFINES MSTR-UNION-CODE
                             PICTURE S9.
     02  MSTR-HOURLY-RATE    PICTURE S99V99.
     02  MSTR-LIFE-INS-CODE  PICTURE X.
         88  LIFE-INSUR-MSTR                 VALUE "1".
     02  MSTR-LIFE-OPT-CODE  PICTURE X.
     02  MSTR-OPT-CODE REDEFINES MSTR-LIFE-OPT-CODE
                             PICTURE S9.
     02  MSTR-LIFE-INS-DED   PICTURE S99V99.
     02  MSTR-LIFE-OPT-DED   PICTURE S99V99.
     02  MSTR-CHARITY-CODE   PICTURE S99.
     02  MSTR-CHARITABLE     PICTURE S99V99.
     02  MSTR-HLTH-CODE      PICTURE S999.
     02 MSTR-HLTH-CODE-RE REDEFINES MSTR-HLTH-CODE PIC X(4).
     02  MSTR-HLTH-CARRIER   PICTURE S9(8).
     02  MSTR-HLTH-DATE      PICTURE S9(6).
     02  MSTR-HLTH-DED       PICTURE S99V99.
     02 MSTR-HLTH-DED-RE REDEFINES MSTR-HLTH-DED PIC X(5).
     02  MSTR-HLTH-CONTRIB   PICTURE S99V99.
     02 MSTR-HLTH-CONTRIB-RE REDEFINES MSTR-HLTH-CONTRIB PIC X(5).
     02  MSTR-BANK-DEP-CODE.
         04  BANK-CODE1      PICTURE XX.
         04  BRANCH-CODE1    PICTURE XX.
     02  MSTR-BANK-DEP-NO    PICTURE X(11).
     02  MSTR-ALLOT1-CODE    PICTURE XXXX.
     02  MSTR-ALLOT1-DEP-NO  PICTURE X(11).
     02  MSTR-ALLOT1-DED     PICTURE S999.
     02  MSTR-ALLOT2-CODE    PICTURE XXXX.
     02  MSTR-ALLOT2-DEP-NO  PICTURE X(11).
     02  MSTR-ALLOT2-DED     PICTURE S999.
     02  MSTR-YTD-NET-PAY    PICTURE S9(5)V99.
     02  MSTR-YTD-FICA       PICTURE S999V99.
     02  MSTR-YTD-RETIRE     PICTURE S9999V99.
     02  MSTR-TOT-RETIRE     PICTURE S9(5)V99.
     02  MSTR-YTD-FED-TAX    PICTURE S9999V99.
     02  MSTR-YTD-HLTH-DED   PICTURE S999V99.
     02  MSTR-YTD-HLTH-CON   PICTURE S999V99.
     02  MSTR-YTD-LIFE-INS   PICTURE S999V99.
     02  MSTR-YTD-LIFE-OPT   PICTURE S999V99.
     02  MSTR-YTD-BONDS      PICTURE S9999V99.
     02  MSTR-ADDL-ST-TAX    PICTURE S999V99.
     02  MSTR-YTD-OTH-DED    PICTURE S9999V99.
     02  MSTR-YTD-STATE-TAX  PICTURE S9999V99.
     02  MSTR-YTD-UNION      PICTURE S999V99.
     02  MSTR-YTD-GOV-INDEBT PICTURE S9999V99.
     02  MSTR-YTD-GOV-PAY    PICTURE S999V99.
     02  MSTR-YTD-CHARITY    PICTURE S999V99.
     02  MSTR-YTD-ALLOT1-DED PICTURE S9(5).
     02  MSTR-YTD-ALLOT2-DED PICTURE S9(5).
     02  MSTR-YTD-REG-MONEY  PICTURE S9(5)V99.
     02  MSTR-YTD-OT-MONEY   PICTURE S9999V99.
     02  MSTR-YTD-OTH-MONEY  PICTURE S9999V99.
     02  MSTR-YTD-TOT-EARN   PICTURE S9(5)V99.
     02  MSTR-QTR-SUB-FICA   PICTURE S9999V99.
     02  MSTR-YTD-SUB-FICA   PICTURE S9999V99.
     02 MSTR-YTD-SUB-FICA-RE REDEFINES MSTR-YTD-SUB-FICA PIC X(7).
     02  MSTR-YTD-NOT-FICA   PICTURE S9(5)V99.
     02  MSTR-YTD-SUB-RET    PICTURE S9(5)V99.
     02  MSTR-BOND-PLEDGE    PICTURE X.
     02  MSTR-NUMERIC-BOND REDEFINES
     MSTR-BOND-PLEDGE    PICTURE 9.
     02  FILLER              PICTURE X(11).
     02  MSTR-BOND-DED       PICTURE S9999V99.
     02  FILLER              PICTURE X(5).
     02  MSTR-YTD-NSFT       PICTURE S9999V99.
     02  FILLER              PICTURE X(24).
     02  MSTR-ST-TAX-EXEM-CD PICTURE S99.
     02 MSTR-ST-TAX-EXEM-CD-RE REDEFINES MSTR-ST-TAX-EXEM-CD
             PIC X(3).
     02  MSTR-ST-QTRLY-TAX   PICTURE S9999V99.
     02  FILLER              PICTURE  XXX.
     02  MSTR-OTHER-PAY-CODE PICTURE X.
     02  FILLER              PICTURE X(7).


FD   SMOOTH-ROLL-FILE
     RECORD CONTAINS 160 CHARACTERS
     LABEL RECORDS ARE STANDARD
        VALUE OF IDENTIFICATION IS  "IH34OUP10"
     DATA RECORDS ARE  SMOOTH-ROLL-REC,  SMOOTH-ROLL-REC-LINE2,
                      SMOOTH-ROLL-TOTAL-LINE1,
                      SMOOTH-ROLL-TOTAL-LINE2,
                      SMOOTH-ROLL-TOTAL-LINE3,
                      SMOOTH-ROLL-HEADING1,
                      SMOOTH-ROLL-HEADING2,
                      SMOOTH-ROLL-HEADING3-4
          .
01   SMOOTH-ROLL-REC.
     02  SR-NAME             PICTURE X(20).
     02  FILLER          PICTURE X.
     02  SR-BANK-CODE    PICTURE XXXX.
     02  FILLER          PICTURE X.
     02  SR-CLOCK-NO     PICTURE XX.
     02  FILLER          PICTURE XX.
     02  SR-HOURLY-RATE      PICTURE ZZZVZZ-.
     02  SR-REG-HOURS        PICTURE ZZZVZZ-.
     02  SR-REG-PAY          PICTURE ZZZZVZZ-.
     02  SR-OT-HOURS         PICTURE ZZZVZZ-.
     02  SR-OT-MONEY         PICTURE ZZZZVZZ-.
     02  SR-EXC-CODE         PICTURE X.
     02  FILLER              PICTURE XX.
     02  SR-OTHER-HOURS      PICTURE ZZZVZZ-.
     02  SR-OTHER-MONEY      PICTURE ZZZZVZZ-.
     02  FILLER              PICTURE X.
     02  SR-CSRA             PICTURE ZZZVZZ-.
     02  SR-FICA             PICTURE ZZZVZZ-.
     02  SR-FED-MAR-CODE     PICTURE X.
     02  FILLER              PICTURE X.
     02  SR-TAX-CODE         PICTURE ZZ.
     02  SR-FED-TAX          PICTURE ZZZZVZZ-.
     02  SR-STATE-TAX-CODE   PICTURE X.
     02  SR-STATE-MAR-CODE   PICTURE XX.
     02  SR-STATE-EXC        PICTURE XX.
     02  SR-STATE-TAX        PICTURE ZZZZVZZ-.
     02  SR-ADDED-TAX        PICTURE ZZZ-.
     02  FILLER              PICTURE XXXX.
     02  SR-FILLER           PICTURE X(10).

01   SMOOTH-ROLL-REC-LINE2.
     02  SR-BADGE            PICTURE Z9(5).
     02  FILLER              PICTURE X.
     02  FILLER              PICTURE X.
     02  SR-PREFIX.
         04  SR-PFX-ACTY     PICTURE X.
         04  SR-PFX-CTL-GP   PICTURE XX.
     02  FILLER              PICTURE X.
     02  SR-CHECK-NO         PICTURE Z(8).
     02  SR-DEPOSIT REDEFINES SR-CHECK-NO  PICTURE X(8).
     02  SR-NET-PAY          PICTURE ZZZZVZZ-.
     02  SR-HLTH-CODE        PICTURE ZZZ.
     02  SR-HLTH-DED         PICTURE ZZZVZZ-.
     02  SR-LIFE-INS-DED     PICTURE ZZZVZZ-.
     02  SR-LIFE-OPT-DED     PICTURE ZZZZVZZ-.
     02  SR-UNION-CODE       PICTURE X.
     02  FILLER              PICTURE X(5).
     02  SR-UNION-DED        PICTURE ZZZZVZZ-.
     02  SR-CHARITY-CODE     PICTURE XX.
     02  FILLER              PICTURE X.
     02  SR-CHARITY-DED      PICTURE ZZZVZZ-.
     02  SR-OTHER-DED        PICTURE ZZZZVZZ-.
     02  FILLER              PICTURE X.
     02  SR-BOND-DED         PICTURE ZZZVZZ-.
     02  R              PICTURE X(6).
     02  SR-BANK-CODE1       PICTURE XXXX.
     02  SR-BANK-ALLOT-DED1  PICTURE ZZZZVZZ-.
     02  SR-BANK-CODE2       PICTURE XXXX.
     02  FILLER              PICTURE X.
     02  SR-BANK-ALLOT-DED2  PICTURE ZZZZVZZ-.
     02  SR-ADDED-ST-TAX     PICTURE ZZZVZZ-.
     02  FILLER              PICTURE X(2).
     02  SR2-FILLER          PICTURE X(10).

01   SMOOTH-ROLL-TOTAL-LINE1.
     02  SR-EMP-COUNT        PICTURE Z(7).
     02  SR-TOT-RATE         PICTURE Z(7)VZZ-.
     02  SR-TOT-NET          PICTURE Z(7)VZZ-.
     02  SR-TOT-REG-HR       PICTURE Z(6)VZZ-.
     02  SR-TOT-REG          PICTURE Z(8)VZZ-.
     02  SR-TOT-OT-HR        PICTURE Z(5)VZZ-.
     02  SR-TOT-OT           PICTURE Z(8)VZZ-.
     02  SR-TOT-OTHER-HR     PICTURE Z(7)VZZ-.
     02  SR-TOT-OTHER        PICTURE Z(8)VZZ-.
     02  SR-TOT-CSRA         PICTURE Z(7)VZZ-.
     02  SR-TOT-FICA         PICTURE Z(6)VZZ-.
     02  SR-TOT-FED-TAX      PICTURE Z(8)VZZ-.
     02  FILLER              PICTURE X(15).

01   SMOOTH-ROLL-TOTAL-LINE2.
     02  SR-TOT-STATE-TAX    PICTURE Z(8)VZZ-.
     02  SR-TOT-HLTH-DED     PICTURE Z(5)VZZ-.
     02  SR-TOT-LIFE-INS     PICTURE Z(6)VZZ-.
     02  SR-TOT-OPTA         PICTURE Z(6)VZZ-.
     02  SR-TOT-OPTC         PICTURE Z(6)VZZ-.
     02  SR-TOT-OPTE         PICTURE Z(6)VZZ-.
     02  FILLER              PICTURE X.
     02  SR-TOT-OPTG         PICTURE Z(6)VZZ-.
     02  SR-TOT-UNION-DED    PICTURE Z(5)VZZ-.
     02  SR-TOT-CHARITY      PICTURE Z(5)VZZ-.
     02  SR-TOT-OTHER-DED    PICTURE Z(6)VZZ-.
     02  SR-TOT-BOND-DED     PICTURE Z(7)VZZ-.
     02  FILLER              PICTURE X(10).
     02  SR-TOT-ALLOT        PICTURE Z(7)VZZ-.
     02  FILLER              PICTURE X(12).

01   SMOOTH-ROLL-TOTAL-LINE3.
     02 FILLER               PICTURE X(28).
     02 SR-TOT-OPTB          PICTURE Z(6)VZZ-.
     02 SR-TOT-OPTD          PICTURE Z(6)VZZ-.
     02 SR-TOT-OPTF          PICTURE Z(6)VZZ-.
     02 SR-TOT-OPT-INS       PICTURE Z(7)VZZ.
     02 SR-AST               PICTURE X.
     02  FILLER              PICTURE X(67).

01   SMOOTH-ROLL-HEADING1.
     02  SR-DEPT             PICTURE X(6).
     02  SR-FROM-MO          PICTURE XX.
     02  SR-DASH1            PICTURE X.
     02  SR-FROM-DAY         PICTURE XX.
     02  FILLER              PICTURE XX.
     02  SR-TO-MO            PICTURE XX.
     02  SR-DASH2            PICTURE X.
     02  SR-TO-DAY           PICTURE XX.
     02  FILLER              PICTURE XXX.
     02  SR-DO-SYMBOL        PICTURE XXXX.
     02  FILLER              PICTURE X(107).

01   SMOOTH-ROLL-HEADING2.
     02  SR-LOCATION         PICTURE X(27).
     02  FILLER              PICTURE X(9).
     02  SR-CPR-KON          PICTURE XXX.
     02  FILLER              PICTURE XX.
     02  SR-ROLL-NO          PICTURE 99.
     02  FILLER              PICTURE X(4).
     02  SR-YEAR-KON         PICTURE X(4).
     02  FILLER              PICTURE X.
     02  SR-PERIOD-YEAR      PICTURE XX.
     02  FILLER              PICTURE X(12).
     02  SR-ACTY-CODE        PICTURE X.
     02  SR-CNTL-GRP         PICTURE XX.
     02  FILLER              PICTURE X.
     02  SR-ACTIVITY         PICTURE X(20).
     02 FILLER               PICTURE XX.
     02  SR-UG-LITERAL       PICTURE X(10).
     02  SR-PAGE-KON         PICTURE X(9).
     02  SR-PAGE-NO          PICTURE ZZZZZ.
     02 FILLER               PICTURE X(16).

01   SMOOTH-ROLL-HEADING3-4.
     02  FILLER              PICTURE X(115).
     02 SR-ADDL-KON          PICTURE X(17).

FD   PAYROLL-WORK-FILE
     RECORD CONTAINS 400 CHARACTERS
     LABEL RECORDS ARE STANDARD
        VALUE OF IDENTIFICATION IS  "IH340U010"
     DATA RECORDS ARE PAYROLL-WORK-REC
          .
01   PAYROLL-WORK-REC.
     02  WT-SEQUENCE.
         04  WT-ACTIVITY     PICTURE X.
         04  WT-GORU         PICTURE X.
         04  WT-CNTL-GRP     PICTURE XX.
         04  WT-BADGE        PICTURE X(6).
     02  WT-COST-WORK-CNTR   PICTURE X(5).
     02  WT-NAME             PICTURE X(20).
     02  WT-RETIRE-CODE      PICTURE X.
     02  WT-MARRIED-CODE     PICTURE X.
     02  WT-UNION-CODE       PICTURE X.
     02  WT-ROLL             PICTURE 99.
     02  WT-BANK-DEP-CODE    PICTURE XXXX.
     02  WT-BANK-DEP-NO      PICTURE X(11).
     02  WT-ALLOT1-CODE      PICTURE XXXX.
     02  WT-ALLOT1-DEP-NO    PICTURE X(11).
     02  WT-ALLOT2-CODE      PICTURE XXXX.
     02  WT-ALLOT2-DEP-NO    PICTURE X(11).
     02  WT-CHECK-NO         PICTURE S9(8).
     02  WT-CHECK-CNTR       PICTURE S9.
     02  WT-NET-PAY          PICTURE S9999V99.
     02  WT-HOURLY-RATE      PICTURE S99V99.
     02  WT-TAX-LEVY-ZEROS.
         04  WT-REG-HOURS    PICTURE S999V99.
         04  WT-REG-PAY      PICTURE S9999V99.
         04  WT-OT-HOURS     PICTURE S999V99.
         04  WT-OT-PAY       PICTURE S9999V99.
         04  WT-OTHER-HOURS  PICTURE S999V99.
         04  WT-OTHER-PAY    PICTURE S9999V99.
         04  WT-SUB-FICA     PICTURE S9999V99.
         04  WT-FICA-CSRA    PICTURE S999V99.
         04  WT-FED-TAX-CODE PICTURE S99.
         04  FILLER          PICTURE X(5).
         04  WT-STATE-TAX    PICTURE S9999V99.
         04  WT-HLTH-CODE    PICTURE S999.
         04  WT-HLTH-DED     PICTURE S999V99.
         04  WT-HLTH-CONTRIB PICTURE S99V99.
         04  WT-LIFE-INS-DED PICTURE S99V99.
         04  WT-LIFE-OPT-DED PICTURE S99V99.
         04  WT-UNION-DED    PICTURE S99V99.
         04  WT-CHARITY-CODE PICTURE XX.
         04  WT-CHARITY-DED  PICTURE S99V99.
         04  WT-OTHER-DED    PICTURE S9999V99.
         04  WT-BOND-DED     PICTURE S999V99.
         04  WT-ALLOT1-DED   PICTURE S999.
         04  WT-ALLOT2-DED   PICTURE S999.
     02  WT-WE-DATE          PICTURE X(6).
     02  WT-OTHER-PAY-CODE   PICTURE X.
     02  WT-STATE-TAX-CODE   PICTURE X.
     02  WT-FF-CODE          PICTURE X.
     02  WT-WORK-SCHED       PICTURE X.
     02  WT-PAY-EXCEP-CODE   PICTURE XX.
     02  WT-MONEY-HOURS-ZEROS.
         04  WT-CATA-MONEY   PICTURE S9(6)V99.
         04  WT-CATA-HOURS   PICTURE S9(6)V99.
         04  WT-CATB-MONEY   PICTURE S9(5)V99.
         04  WT-CATB-HOURS   PICTURE S9(5)V99.
         04  WT-CATC-MONEY   PICTURE S9(4)V99.
         04  WT-CATC-HOURS   PICTURE S9(5)V99.
         04  WT-CATH-MONEY   PICTURE S9(5)V99.
         04  WT-CATK-MONEY   PICTURE S9(5)V99.
         04  WT-CATL-MONEY   PICTURE S9(5)V99.
         04  WT-CATJ-MONEY   PICTURE S9(5)V99.
         04  WT-CATJ-HOURS   PICTURE S9(5)V99.
         04  WT-NEG-OT       PICTURE S9(5)V99.
         04 WT-NEG-OT-RE REDEFINES WT-NEG-OT PIC X(8).
         04  WT-RETRO-OTPAY  PICTURE S9(5)V99.
         04 WT-RETRO-OTPAY-RE REDEFINES WT-RETRO-OTPAY PIC X(8).
         04  WT-RETRO-OTHRS  PICTURE S9(5)V99.
         04  WT-RETRO-OTHRS-RE REDEFINES WT-RETRO-OTHRS PIC X(8).
     02  WT-CLOCK-NO         PICTURE XX.
     02  WT-LIFE-OPT-CD      PICTURE X.
     02  WT-FED-TAX          PICTURE S9(4)V99.
     02  WT-SS-NO            PICTURE X(12).
     02  WT-OCC-CD           PICTURE X(10).
     02  WT-MONEY-HRS-ZEROS.
         04  WT-CATM-MONEY   PICTURE S9(4)V99.
         04  WT-CATM-HOURS   PICTURE S999V99.
         04  WT-CATN-MONEY   PICTURE S9(4)V99.
         04  WT-CATN-HOURS   PICTURE S99V99.
     02  FILLER              PICTURE X(29).


FD   CONTROL-ERROR-FILE
     RECORD CONTAINS 120 CHARACTERS
     LABEL RECORDS ARE STANDARD
        VALUE OF IDENTIFICATION IS  "IH340UP20"
     DATA RECORDS ARE CONTROL-REC,
                      ERROR-MESSAGE-REC

          .
01   CONTROL-REC.
     02  FILLER              PICTURE X.
     02  CNTL-AORD           PICTURE X(5).
     02  FILLER              PICTURE X.
     02  CNTL-MESSAGE        PICTURE X(20).
     02  FILLER              PICTURE X.
     02  CNTL-MONEY          PICTURE Z,ZZZ,ZZZ.99-.
     02  CNTL-COUNT REDEFINES CNTL-MONEY
                             PICTURE ZZZZ,ZZZ,ZZ9-.
     02  FILLER              PICTURE X.
     02  CNTL-GRP-KON        PICTURE XXX.
     02  FILLER              PICTURE X.
     02  CNTL-GROUP          PICTURE XXXX.
     02  FILLER              PICTURE X(30).
     02  CON-MSG-PRINT       PICTURE X(14).
     02  FILLER              PICTURE X(26).

01   ERROR-MESSAGE-REC.
     02  ERR-DETAIL.
         04  ERR-ACTIVITY    PICTURE X.
         04  ERR-CONTROL-GRP PICTURE XX.
         04  FILLER          PICTURE X.
         04  ERR-BADGE       PICTURE X(6).
         04  FILLER          PICTURE X.
         04  ERR-NAME        PICTURE X(20).
       04  FILLER            PICTURE XXX.
         04  ERR-EXPLAIN.
             06  ERR-HOURS   PICTURE ZZZ.ZZ.
             06  ERR-SPACE REDEFINES ERR-HOURS PICTURE X(6).
             06  FILLER      PICTURE XX.
             06  ERR-MESS    PICTURE X(37).
         04  FILLER          PICTURE X(41).


FD   PAY-EXCEPT-LIST-FILE
     RECORD CONTAINS 120 CHARACTERS
     LABEL RECORDS ARE STANDARD
        VALUE OF IDENTIFICATION IS  "IH340UP30"
     DATA RECORDS ARE PAY-EXCEPT-LIST-REC,  EXCEPT-LIST-DTL,
                      EXCEPT-LIST-HEADING
          .
01   PAY-EXCEPT-LIST-REC.
     02  EXC-ACTY-PRINT      PICTURE X.
     02  EXC-CTL-GRP-PRINT   PICTURE XX.
     02  FILLER              PICTURE XX.
     02  EXC-BADGE-KON       PICTURE X(8).
     02  FILLER              PICTURE X.
     02  EXC-BADGE           PICTURE X(6).
     02  EXC-COMMA-KON       PICTURE X.
     02  FILLER              PICTURE X.
     02  EXC-NAME            PICTURE X(20).
     02  FILLER              PICTURE X(78).

01   EXCEPT-LIST-DTL.
     02  EXC-CODE            PICTURE XX.
     02  FILLER              PICTURE X.
     02  EXC-HRS-AMT         PICTURE ZZ,ZZZ.99-.
     02  FINAL-EXPLAIN       PICTURE X(38).
     02  EXC-EXPLAIN         PICTURE X(32).
     02  FILLER              PICTURE XX.
     02  EXC-END-TOTALS      PICTURE Z(6).
     02  FILLER              PICTURE X(29).

01   EXCEPT-LIST-HEADING.
     02  EXC-ACTIVITY        PICTURE X(20).
     02  FILLER              PICTURE XX.
     02  EXC-AORD            PICTURE X(8).
     02  FILLER              PICTURE X.
     02  EXC-LIST-TITLE      PICTURE X(25).
     02  FILLER              PICTURE XXX.
     02  EXC-WE-MO           PICTURE XX.
     02  EXC-SLASH1          PICTURE X.
     02  EXC-WE-DAY          PICTURE XX.
     02  EXC-SLASH2          PICTURE X.
     02  EXC-WE-YR           PICTURE XX.
     02  FILLER              PICTURE XX.
     02  EXC-ROLL-KON        PICTURE XXXX.
     02  FILLER              PICTURE X.
     02  EXC-ROLL            PICTURE 99.
     02  FILLER              PICTURE XX.
     02  EXPGCON             PICTURE X(5).
     02  EXC-PG-NO           PICTURE ZZZ9.
     02  FILLER              PICTURE X(33).



WORKING-STORAGE  SECTION.

01   SEQ-PERS-MSTR           PICTURE X(10)   VALUE ZEROS.
01   SEQ-PAY-DTL             PICTURE X(10)   VALUE ZEROS.
01   PARM-DATA.
     02  COMPOSIT-SW         PICTURE X       VALUE SPACE.
        88 COMPOSIT-CHECKS                   VALUE ZERO.
     02  FILLER              PICTURE X(5)    VALUE SPACES.
     02  WEEK-BEGIN-DATE.
         04  WB-MONTH        PICTURE XX      VALUE SPACES.
         04  WB-DAY          PICTURE XX      VALUE SPACES.
         04  WB-YEAR         PICTURE XX      VALUE SPACES.
     02  WEEK-END-DATE.
         04  WE-MODAY.
             06  WE-MONTH    PICTURE 99      VALUE 00.
             06  WE-DAY      PICTURE 99      VALUE 00.
         04  WE-YEAR         PICTURE 99      VALUE 00.
     02  ROLL-NO             PICTURE 99      VALUE 00.
     02  EXCEPT-CODES.
         04  EXCEPT-1        PICTURE X       VALUE SPACES.
         04  EXCEPT-2        PICTURE X       VALUE SPACES.
         04  EXCEPT-3        PICTURE X       VALUE SPACES.
         04  EXCEPT-4        PICTURE X       VALUE SPACES.
         04  EXCEPT-5        PICTURE X       VALUE SPACES.
         04  EXCEPT-6        PICTURE X       VALUE SPACES.
         04  EXCEPT-7        PICTURE X       VALUE SPACES.
         04  EXCEPT-8        PICTURE X       VALUE SPACES.
         04  EXCEPT-9        PICTURE X       VALUE SPACES.
         04  EXCEPT-10       PICTURE X       VALUE SPACES.
         04  EXCEPT-11       PICTURE X       VALUE SPACES.
         04  EXCEPT-12       PICTURE X       VALUE SPACES.
         04  EXCEPT-13       PICTURE X       VALUE SPACES.
         04  EXCEPT-14       PICTURE X       VALUE SPACES.
         04  EXCEPT-15       PICTURE X       VALUE SPACES.
         04  EXCEPT-16       PICTURE X       VALUE SPACES.
         04  EXCEPT-17       PICTURE X       VALUE SPACES.
         04  EXCEPT-18       PICTURE X       VALUE SPACES.
         04  EXCEPT-19       PICTURE X       VALUE SPACES.
         04  EXCEPT-20       PICTURE X       VALUE SPACES.
         04  EXCEPT-21       PICTURE X       VALUE SPACES.
         04  EXCEPT-22       PICTURE X       VALUE SPACES.
         04  EXCEPT-23       PICTURE X       VALUE SPACES.
         04  EXCEPT-24       PICTURE X       VALUE SPACES.
     02  EXCEPT-CODE-TABLE REDEFINES EXCEPT-CODES.
         04  EXCEPT-TABLE    PICTURE X       OCCURS 24 TIMES.
     02  BEGIN-CHECK-NO      PICTURE 9(8)    VALUE 00000000.
     02  BEGIN-CHECK-NO2     PICTURE 9(8)    VALUE 00000000.
     02  BEGIN-CHECK-NO3     PICTURE 9(8)    VALUE 00000000.
     02  BEGIN-CHECK-NO4     PICTURE 9(8)    VALUE 00000000.

01   TEST-EOD.
     02  TEST-EOD-YR         PICTURE 99      VALUE 00.
     02  TEST-EOD-MODAY      PICTURE XXXX    VALUE "0000".
01   TEST-WE.
     02  TEST-WE-YR          PICTURE 99      VALUE 00.
     02  TEST-WE-MODAY       PICTURE XXXX    VALUE "0000".
01   HOLD-CONTROLS.
     02  MAJOR-CONTROL.
         04  MINOR-ACTIVITY  PICTURE X       VALUE SPACE.
         04  MINOR-AORD      PICTURE X       VALUE SPACE.
     02  MINOR-CONTROL       PICTURE XX      VALUE SPACES.
01   SAVE-HOLD-CONTROLS.
     02  SAVE-MINOR-ACT      PICTURE X       VALUE "0".
     02  SAVE-GORU           PICTURE X       VALUE "0".
     02  SAVE-MINOR-CONTROL  PICTURE XX      VALUE "00".
01   PAY-CODE-TABLE.
     02  FILLER              PICTURE X(19)    VALUE
         "STABWEPCGFHLMJKNRXY".
01   REDEF-PAY-TABLE REDEFINES PAY-CODE-TABLE.
     02  PAY-CODE-TBL        PICTURE X        OCCURS 19 TIMES.
01   SAVE-NITE-WEEK          PICTURE X       VALUE SPACE.
01   SAVE-BONUS-WEEK         PICTURE X       VALUE SPACE.
01   SAVE-SUNDAY-WEEK        PICTURE X       VALUE SPACE.
01   SAVE-DIVER-WEEK         PICTURE X       VALUE SPACE.
01   SAVE-OT-WEEK            PICTURE X       VALUE SPACE.
01   NUMBER-OF               PICTURE 99      VALUE 00.
01   ACTY-CHG                PICTURE X.
01   WORK-OTH-PAY-CODE       PICTURE X       VALUE SPACE.
01   REC-OT-RATE2            PICTURE S9V99   VALUE ZEROS.
01   REC-OT-RATE1            PICTURE S9V99   VALUE ZEROS.
01   DTL-IN-GRP              PICTURE 9(5)    VALUE ZEROS.
01   WT-PAY-EXC-HOLD         PICTURE XX.
01   MESSAGE2.
     02  FILLER              PICTURE X(11)   VALUE "GOVERNMENT ".
     02  MSG2-KON            PICTURE X(8).
     02  FILLER              PICTURE X(8)    VALUE " ADJ TO ".
     02  MSG2-AMT            PICTURE Z,ZZZ.99-.
01   MESSAGE3.
     02  FILLER              PICTURE X(24)   VALUE
         "LWOP EXCEEDS REG HRS BY ".
     02  MSG3-HRS            PICTURE ZZZ.9-.
01   MESSAGE4.
     02  FILLER              PICTURE X(20)   VALUE
         "CURR EARNED EXCEEDS ".
     02  MSG4-MAX            PICTURE Z,ZZZ.99.
     02  FILLER              PICTURE XXXX    VALUE " BY ".
     02  MSG4-AMT            PICTURE Z,ZZZ.99-.
01   MESSAGE5.
     02  FILLER              PICTURE X(19)   VALUE
         "CURR EARNED ADJ TO ".
     02  MSG5-AMT            PICTURE Z,ZZZ.99-.
01   MESSAGE6.
     02  FILLER              PICTURE X(21)   VALUE
         "SUBJECT MONEY ADJ TO ".
     02  MSG6-AMT            PICTURE Z,ZZZ.99-.
01   MESSAGE7.
     02  FILLER              PICTURE X(17)   VALUE
         "DEDUCTION ADJ TO ".
     02  MSG7-AMT            PICTURE Z,ZZZ.99-.
01   MESSAGE8.
     02  FILLER              PICTURE X(5)    VALUE "CODE ".
     02  MSG8-CODE           PICTURE 999.
     02  FILLER              PICTURE X(5)    VALUE " DED ".
     02  MSG8-AMT1           PICTURE ZZ.99-.
     02  FILLER              PICTURE X(9)    VALUE " EMP CON ".
     02  MSG8-AMT2           PICTURE ZZ.99-.
     02  FILLER              PICTURE X(9)    VALUE " CARRIER ".
     02  MSG8-CARRIER        PICTURE X(7).
01   MESSAGE9.
     02  FILLER              PICTURE X(25)   VALUE
         "CURR PAY DOES NOT C/F BY ".
     02  MSG9-AMT            PICTURE Z,ZZZ.99-.
01   MESSAGE10.
     02  FILLER              PICTURE X(35)   VALUE
         "AMT PAID BY VOUCHER EXCEEDS NET BY ".
     02  MSG10-AMT           PICTURE Z,ZZZ.ZZ-.
01   CODE10-MSG              PICTURE X(32)   VALUE
           "CODE 10  SPECIAL TAX ADJUSTMENT".
01   DUP-MSG.
     02  FILLER              PICTURE X(35)   VALUE
         "DUPLICATE RECORDS, 1 RECORD DROPPED".
01   EXC-MAJOR-CONTROL       PICTURE XX      VALUE SPACES.
01   EOJ-MSG.
     02  EOJ-MSG-DESC        PICTURE X(19)   VALUE SPACES.
     02  FILLER              PICTURE X(10)   VALUE SPACES.
     02  EOJ-MSG-TOT         PICTURE ZZ,ZZZ-.

01   DET-CNTL-MSG.
     02  FILLER              PICTURE X(40)   VALUE SPACES.
     02  FILLER              PICTURE X(40)   VALUE
          " TOTAL EXCEPTIONS PROCESSED THIS PREFIX ".
     02  CNTL-MSG-DTL        PICTURE Z(5)    VALUE ZEROS.
     02  FILLER              PICTURE X(35)   VALUE SPACES.
01   INTERNAL-PROGRAM-SWITCHES.
     02  SW1                 PICTURE X       VALUE SPACE.
         88  DTL-ERROR                       VALUE "1".
     02  SW2                 PICTURE X       VALUE SPACE.
         88  EOF-MASTER                      VALUE "1".
     02  SW3                 PICTURE X       VALUE SPACE.
         88  EOF-DETAIL                      VALUE "1".
     02  SW4                 PICTURE X       VALUE SPACE.
         88  THIRD-SHIFT                     VALUE "1".
     02  SW5                 PICTURE X       VALUE SPACE.
         88  PAY-EXCEPT                      VALUE "1".
     02  SW6                 PICTURE X       VALUE SPACE.
         88  EXCEPT-TO-COMPUTE               VALUE "1".
     02  SW7                 PICTURE X       VALUE SPACE.
         88  CODE-B-BONUS                    VALUE "1".
     02  SW8                 PICTURE X       VALUE SPACE.
         88  WHARF-BUILDER                   VALUE "1".
     02  SW9                 PICTURE X       VALUE SPACE.
         88  DIVER-PAY                       VALUE "1".
     02  SW10                PICTURE X       VALUE SPACE.
         88  OVERTIME                        VALUE "1".
     02  SW11                PICTURE X       VALUE SPACE.
         88  HOLIDAY-WORKED                  VALUE "1".
     02  SW12                PICTURE X       VALUE SPACE.
         88  HOLIDAY-PAYOFF                  VALUE "1".
     02  SW13                PICTURE X       VALUE SPACE.
         88  CANCEL-LIFE                     VALUE "1".
     02  SW14                PICTURE X       VALUE SPACE.
         88  CANCEL-HEALTH                   VALUE "1".
     02  SW15                PICTURE X       VALUE SPACE.
         88  TAX-LEVY                        VALUE "1".
     02  SW16                PICTURE X       VALUE SPACE.
         88  RETRO-HOURS                     VALUE "1".
     02  SW17                PICTURE X       VALUE SPACE.
         88  80TH-ADDED-PAY                  VALUE "1".
     02  SW18                PICTURE X       VALUE SPACE.
         88  PAID-BY-VOUCHER                 VALUE "1".
     02  SW19                PICTURE X       VALUE SPACE.
         88  CSRA-ADJUSTMENT                 VALUE "1".
     02  SW20                PICTURE X       VALUE SPACE.
         88  FICA-ADJUSTMENT                 VALUE "1".
     02  SW21                PICTURE X       VALUE SPACE.
         88  TAX-ADJUSTMENT                  VALUE "1".
     02  SW22                PICTURE X       VALUE SPACE.
         88  HLTH-DED-ADJUSTMENT             VALUE "1".
     02  SW23                PICTURE X       VALUE SPACE.
         88  LIFE-INS-ADJUSTMENT             VALUE "1".
     02  SW24                PICTURE X       VALUE SPACE.
         88  LIFE-OPT-ADJUSTMENT             VALUE "1".
     02  SW25                PICTURE X       VALUE SPACE.
         88  STATE-ADJUSTMENT                VALUE "1".
     02  SW26                PICTURE X       VALUE SPACE.
         88  UNION-ADJUSTMENT                VALUE "1".
     02  SW27                PICTURE X       VALUE SPACE.
         88  CANCEL-BOND                     VALUE "1".
     02  SW28                PICTURE X       VALUE SPACE.
         88  DECEASED-PAYOFF                 VALUE "1".
     02  SW29                PICTURE X       VALUE SPACE.
         88  ANNUAL-PAYOFF                   VALUE "1".
     02  SW30                PICTURE X       VALUE SPACE.
         88  CASH-AWARD                      VALUE "1".
     02  SW31                PICTURE X       VALUE SPACE.
         88  NOT-DTL-ERROR                   VALUE "1".
     02  SW32                PICTURE X       VALUE SPACE.
         88  SUNDAY-PREMIUM                  VALUE "1".
     02  SW33                PICTURE X       VALUE SPACE.
         88  80TH-HRLY-SAVED                 VALUE "1".
     02  SW34                PICTURE X       VALUE SPACE.
         88  HOLIDAY-OTH-MONEY               VALUE "1".
     02  SW35                PICTURE X       VALUE SPACE.
         88  FICA-MAXIMUM                    VALUE "1".
     02  SW36                PICTURE X       VALUE SPACE.
         88  WRITE-CASH-AWARD                VALUE "1".
     02  SW37                PICTURE X       VALUE SPACE.
         88  WRITE-TAX-LEVY                  VALUE "1".
     02  SW38                PICTURE X       VALUE SPACE.
         88  END-OF-JOB                      VALUE "1".
     02  SW40                PICTURE X       VALUE SPACE.
         88  CHARITY-ADJ                     VALUE "1".
     02  SW41                PICTURE X       VALUE SPACE.
         88  BOND-ADJUST                     VALUE "1".
     02  SW42                PICTURE X       VALUE SPACE.
         88  RETRO-OVERTIME                  VALUE "1".
     02  SW43                PICTURE X       VALUE SPACE.
         88  ALLOT1-ADJ                      VALUE "1".
     02  SW44                PICTURE X       VALUE SPACE.
         88  ALLOT2-ADJ                      VALUE "1".
     02  SW45                PICTURE X       VALUE SPACE.
         88  ADJ-OTH-DED                     VALUE "1".
     02  SW46                PICTURE X       VALUE SPACE.
         88  ADJ-TO-NET-PAY                  VALUE "1".
     02  SW47                PICTURE X       VALUE SPACE.
         88  ADJ-NSFT                        VALUE "1".
     02  SW48                PICTURE X       VALUE SPACE.
         88  RETRO-OTHER                     VALUE "1".
     02  SW49                PICTURE X       VALUE SPACE.
         88  PAYOFF-LWOP                     VALUE "1".
     02  SW50                PICTURE X       VALUE SPACE.
         88  PAYOFF-SW                       VALUE "1".
     02  SW51                PICTURE X       VALUE SPACE.
         88  SHIFT-2-OT                      VALUE "1".
     02  SW52                PICTURE X       VALUE SPACE.
         88  SHIFT-3-OT                      VALUE "1".
     02  SW53                PICTURE X       VALUE SPACE.
         88  CODE-K-BONUS                    VALUE "1".
     02  SW54                PICTURE X       VALUE SPACE.
         88  CODE-N-BONUS                    VALUE "1".
     02  SW55                PICTURE X       VALUE SPACE.
         88  CODE-R-BONUS                    VALUE "1".
     02  SW56                PICTURE X       VALUE SPACE.
         88  CODE-B-OT                       VALUE "1".
     02  SW57                PICTURE X       VALUE SPACE.
         88  CD10-TAX-ADJ                    VALUE "1".

01   CONTROL-DESCRIPTION.
     02  FILLER              PICTURE X(20)
         VALUE "CHECK COUNT IS".
     02  FILLER              PICTURE X(20)
         VALUE "SUB TO FICA IS".
     02  FILLER              PICTURE X(20)
         VALUE "SUB TO CSRA IS".
     02  FILLER              PICTURE X(20)
         VALUE "HEALTH COUNT IS".
     02  FILLER              PICTURE X(20)
         VALUE "EMPLOYEE DED IS".
     02  FILLER              PICTURE X(20)
         VALUE "EMPLOYER CON IS".
     02  FILLER              PICTURE X(20)
         VALUE "BASIC HOURS ARE".
     02  FILLER              PICTURE X(20)
         VALUE "OVERTIME HOURS ARE".
     02  FILLER  PICTURE X(20) VALUE "BOND DED COUNT IS ".
     02  FILLER  PICTURE X(20) VALUE "BOND DED MONEY IS".
01   REDEF-CNTRL-DESC REDEFINES CONTROL-DESCRIPTION.
     02  CNTRL-DESC          PICTURE X(20) OCCURS 10 TIMES.

01   PAYROLL-EXC-CODE-DESC.
     02  FILLER              PICTURE XX      VALUE "01".
     02  FILLER              PICTURE X(32)   VALUE
             "NIGHT DIFFERENTIAL SECOND SHIFT".
     02  FILLER              PICTURE XX      VALUE "02".
     02  FILLER              PICTURE X(32)   VALUE
             "NIGHT DIFFERENTIAL THIRD SHIFT".
     02  FILLER              PICTURE XX      VALUE "03".
     02  FILLER              PICTURE X(32)   VALUE
         " CODE A DIFFERENTIAL".
     02  FILLER              PICTURE XX      VALUE "04".
     02  FILLER              PICTURE X(32)   VALUE
         " CODE B DIFFERENTIAL".
     02  FILLER              PICTURE XX      VALUE "05".
     02  FILLER              PICTURE X(32)   VALUE
             "DIVER RATE HOURS".
     02  FILLER              PICTURE XX      VALUE "06".
     02  FILLER              PICTURE X(32)   VALUE
             "HOLIDAY WORKED HOURS".
     02  FILLER              PICTURE XX      VALUE "07".
     02  FILLER              PICTURE X(32)   VALUE
             "ADJUSTMENT TO SUBJECT MONEY".
     02  FILLER              PICTURE XX      VALUE "08".
     02  FILLER              PICTURE X(32)   VALUE
             "ADJUSTMENT TO REGULAR MONEY".
     02  FILLER              PICTURE XX      VALUE "09".
     02  FILLER              PICTURE X(32)   VALUE
             "ADJUSTMENT TO OTHER MONEY".
     02  FILLER              PICTURE XX      VALUE "10".
     02  FILLER              PICTURE X(32)   VALUE
             "ADJUSTMENT TO OVERTIME MONEY".
     02  FILLER              PICTURE XX      VALUE "11".
     02  FILLER              PICTURE X(32)   VALUE
             "ADJUSTMENT TO CSRA".
     02  FILLER              PICTURE XX      VALUE "12".
     02  FILLER              PICTURE X(32)   VALUE
             "ADJUSTMENT TO FICA".
     02  FILLER              PICTURE XX      VALUE "13".
     02  FILLER              PICTURE X(32)   VALUE
             "ADJUSTMENT TO HEALTH INSURANCE".
     02  FILLER              PICTURE XX      VALUE "14".
     02  FILLER              PICTURE X(32)   VALUE
             "ADJUSTMENT TO FEDERAL TAXES".
     02  FILLER              PICTURE XX      VALUE "15".
     02  FILLER              PICTURE X(32)   VALUE
             "ADJUSTMENT TO LIFE INSURANCE".
     02  FILLER              PICTURE XX      VALUE "16".
     02  FILLER              PICTURE X(32)   VALUE
             "ADJUSTMENT TO STATE TAXES".
     02  FILLER              PICTURE XX      VALUE "17".
     02  FILLER              PICTURE X(32)   VALUE
             "ADJUSTMENT TO UNION DUES".
     02  FILLER              PICTURE XX      VALUE "18".
     02  FILLER              PICTURE X(32)   VALUE
             "ANNUAL LEAVE PAYOFF HOURS".
     02  FILLER              PICTURE XX      VALUE "19".
     02  FILLER              PICTURE X(32)   VALUE
             "DECEASED PAYOFF HOURS".
     02  FILLER              PICTURE XX      VALUE "20".
     02  FILLER              PICTURE X(32)   VALUE
             "RETROACTIVE REGULAR HOURS".
     02  FILLER              PICTURE XX      VALUE "21".
     02  FILLER              PICTURE X(32)   VALUE
             "HOLIDAY INCLUDED IN PAYOFF HOURS".
     02  FILLER              PICTURE XX      VALUE "22".
     02  FILLER              PICTURE X(32)   VALUE
             "TAX LEVY AMOUNT".
     02  FILLER              PICTURE XX      VALUE "23".
     02  FILLER              PICTURE X(32)   VALUE
             "CASH AWARD".
     02  FILLER              PICTURE XX      VALUE "24".
     02  FILLER              PICTURE X(32)   VALUE
             "CASH AWARD".
     02  FILLER              PICTURE XX      VALUE "25".
     02  FILLER              PICTURE X(32)   VALUE
             "CASH AWARD".
     02  FILLER              PICTURE XX      VALUE "26".
     02  FILLER              PICTURE X(32)   VALUE
             "CASH AWARD".
     02  FILLER              PICTURE XX      VALUE "27".
     02  FILLER              PICTURE X(32)   VALUE
             "SUNDAY REGULAR SCHEDULED HOURS".
     02  FILLER              PICTURE XX      VALUE "28".
     02  FILLER              PICTURE X(32)   VALUE
             "WHARF BUILDER HOURS".
     02  FILLER              PICTURE XX      VALUE "29".
     02  FILLER              PICTURE X(32)   VALUE
             "CHARITABLE CONTRIBUTIONS".
     02  FILLER              PICTURE XX      VALUE "30".
     02  FILLER              PICTURE X(32)   VALUE
           "BONDS".
     02  FILLER              PICTURE XX      VALUE "31".
     02  FILLER              PICTURE X(32)   VALUE
           "RETROACTIVE OVERTIME MONEY".
     02  FILLER              PICTURE XX      VALUE "32".
     02  FILLER              PICTURE X(32)   VALUE
           "SAVINGS ALLOTMENT #1".
     02  FILLER              PICTURE XX      VALUE "33".
     02  FILLER              PICTURE X(32)   VALUE
           "SAVINGS ALLOTMENT #2".
     02  FILLER              PICTURE XX      VALUE "34".
     02  FILLER              PICTURE X(32)   VALUE
             "OTHER DEDUCTIONS".
     02  FILLER              PICTURE XX      VALUE "35".
     02  FILLER              PICTURE X(32)   VALUE
             "NET-PAY".
     02  FILLER              PICTURE XX      VALUE "36".
     02  FILLER              PICTURE X(32)   VALUE
             "AMT NOT SUB TO FED TAX".
     02  FILLER              PICTURE XX      VALUE "37".
     02  FILLER              PICTURE X(32)   VALUE
           "RETROACTIVE OTHER MONEY".
     02  FILLER              PICTURE XX      VALUE "38".
     02  FILLER              PICTURE X(32)   VALUE
         " SHIFT-2 OVERTIME".
     02  FILLER              PICTURE XX      VALUE "39".
     02  FILLER              PICTURE X(32)   VALUE
         " SHIFT-3 OVERTIME".
     02  FILLER              PICTURE XX      VALUE "40".
     02  FILLER              PICTURE X(32)   VALUE
           "ANNUAL LV PAYOFF WITH EARNINGS".
     02  FILLER              PICTURE XX      VALUE "41".
     02  FILLER              PICTURE X(32)   VALUE
           "ANNUAL LV PAYOFF NO EARNINGS".
     02  FILLER              PICTURE XX      VALUE "42".
     02  FILLER              PICTURE X(32)   VALUE
           "CODE J ADDED HOURS".
     02  FILLER              PICTURE XX      VALUE "43".
     02  FILLER              PICTURE X(32)   VALUE
           "CODE K ADDED HOURS".
     02  FILLER              PICTURE XX      VALUE "44".
     02  FILLER              PICTURE X(32)   VALUE
           "CODE N ADDED HOURS".
     02  FILLER              PICTURE XX      VALUE "45".
     02  FILLER              PICTURE X(32)   VALUE
           "CODE R ADDED HOURS".
     02  FILLER              PICTURE XX      VALUE "46".
     02  FILLER              PICTURE X(32)   VALUE
           "CODE A OVERTIME".
     02  FILLER              PICTURE XX      VALUE "47".
     02  FILLER              PICTURE X(32)   VALUE
           "CODE B OVERTIME".
01   REDEF-PAY-EXC-DESC REDEFINES PAYROLL-EXC-CODE-DESC.
     02  CODE-AND-DESC                       OCCURS 47 TIMES.
         04  PAY-EXC-CODE    PICTURE XX.
         04  PAY-EXC-DESC    PICTURE X(32).

01   PAYROLL-EOJ-DESC.
     02  FILLER              PICTURE X(19)   VALUE
             "MASTERS IN".
     02  FILLER              PICTURE X(19)   VALUE
             "DETAIL IN".
     02  FILLER              PICTURE X(19)   VALUE
             "MASTERS OUT".
     02  FILLER              PICTURE X(19)   VALUE
             "ACTIVE MASTERS OUT".
     02  FILLER              PICTURE X(19)   VALUE
             "SMOOTH ROLL OUT".
     02  FILLER              PICTURE X(19)   VALUE
             "WORKTAPE OUT".
     02  FILLER              PICTURE X(19)   VALUE
             "EXCEPTION LIST OUT".
     02  FILLER              PICTURE X(19)       VALUE
             "ERROR DETAILS OUT  ".
     02  FILLER              PICTURE X(19)   VALUE
             "CONTROL RECORDS OUT".
01   REDEF-EOJ-DESC REDEFINES PAYROLL-EOJ-DESC.
     02  EOJ-DESC            PICTURE X(19)   OCCURS 10 TIMES.

01  PAYROLL-WORK-AREAS.
     02  OT-HRS-WK1          PICTURE S999V99  VALUE +000.00.
     02  OT-HRS-WK2          PICTURE S999V99  VALUE +000.00.
     02  LWOP-WK1            PICTURE S999V99  VALUE +000.00.
     02  LWOP-WK2            PICTURE S999V99  VALUE +000.00.
     02  REG-HRS-WK1         PICTURE S999V99  VALUE +000.00.
     02  REG-HRS-WK2         PICTURE S999V99  VALUE +000.00.
     02  WK1-SUBJECT         PICTURE S9(5)V99 VALUE +00000.00.
     02  WK2-SUBJECT         PICTURE S9(5)V99 VALUE +00000.00.
     02  SUNDAY-PREM-WK1     PICTURE S9(5)V99 VALUE +00000.00.
     02  SUNDAY-PREM-WK2     PICTURE S9(5)V99 VALUE +00000.00.
     02  CURR-EARNED         PICTURE S9(5)V99 VALUE +00000.00.
     02  ADJ-RETRO-HRS       PICTURE S999V99  VALUE +000.00.
     02  NET-PAY             PICTURE S9(5)V99 VALUE +00000.00.
     02  REG-MONEY           PICTURE S9(5)V99 VALUE +00000.00.
     02  OT-MONEY            PICTURE S9(5)V99 VALUE +00000.00.
     02  OTHER-HOURS         PICTURE S999V99  VALUE +000.00.
     02  OTHER-MONEY         PICTURE S9(5)V99 VALUE +00000.00.
     02  RETIRE-FICA         PICTURE S999V99  VALUE +000.00.
     02  FED-TAXES           PICTURE S9(5)V99 VALUE +00000.00.
     02  STATE-TAXES         PICTURE S9999V99 VALUE +0000.00.
     02  HLTH-INS-DED        PICTURE S999V99  VALUE +000.00.
     02  HLTH-INS-CON        PICTURE S999V99  VALUE +000.00.
     02  LIFE-INS-DED        PICTURE S999V99  VALUE +000.00.
     02  LIFE-OPT-DED        PICTURE S999V99  VALUE +000.00.
     02  OTHER-DED           PICTURE S9(5)V99 VALUE +00000.00.
     02  UNION-DUES          PICTURE S999V99  VALUE +000.00.
     02  CHARITY-CON         PICTURE S999V99  VALUE +000.00.
     02  BOND-DED            PICTURE S999V99  VALUE +000.00.
     02  ALLOT-DED           PICTURE S9(5)    VALUE +00000.
     02  DIVER-OT-HR1        PICTURE S9(5)V99 VALUE +00000.00.
     02  DIVER-OT-HR2        PICTURE S9(5)V99 VALUE +00000.00.
     02  ADJ-RETIRE          PICTURE S999V99  VALUE +000.00.
     02  ADJ-TAXES           PICTURE S999V99  VALUE +000.00.
     02  ADJ-HEALTH-DED      PICTURE S999V99  VALUE +000.00.
     02  ADJ-HEALTH-CON      PICTURE S999V99  VALUE +000.00.
     02  ADJ-LIFE-INS        PICTURE S999V99  VALUE +000.00.
     02  ADJ-LIFE-OPT        PICTURE S999V99  VALUE +000.00.
     02  ADJ-STATE           PICTURE S999V99  VALUE +000.00.
     02  ADJ-UNION           PICTURE S999V99  VALUE +000.00.
     02  ADJ-CHARITY         PICTURE S999V99  VALUE 000.00.
     02  ADJ-TO-BONDS        PICTURE S9999V99 VALUE 0000.00.
     02  ADJ-TO-ALLOT1       PICTURE S999     VALUE 000.
     02  ADJ-TO-ALLOT2       PICTURE S999     VALUE 000.
     02  ADJ-TO-OTH-DED      PICTURE S9999V99 VALUE 0000.00.
     02  NET-PAY-ADJ         PICTURE S9999V99 VALUE 0000.00.
     02  NOT-SUBJ-FED-TAX    PICTURE S9999V99 VALUE +0000.00.
     02  ALLOT1-WORK         PICTURE S999     VALUE 000.
     02  ALLOT2-WORK         PICTURE S999     VALUE 000.
     02  CODE-A-PAY          PICTURE S9(5)V99 VALUE +00000.00.
     02  CODE-B-PAY          PICTURE S9(5)V99 VALUE +00000.00.
     02  CAT-A-MONEY         PICTURE S9(6)V99 VALUE 000000.00.
     02  CAT-A-HOURS         PICTURE S9(6)V99 VALUE 000000.00.
     02  CAT-B-MONEY         PICTURE S9(5)V99 VALUE 00000.00.
     02  CAT-B-HOURS         PICTURE S9(5)V99 VALUE 00000.00.
     02  CAT-C-MONEY         PICTURE S9(4)V99 VALUE 0000.00.
     02  CAT-C-HOURS         PICTURE S9(5)V99 VALUE 00000.00.
     02  CAT-H-MONEY         PICTURE S9(5)V99 VALUE 00000.00.
     02  CAT-J-MONEY         PICTURE S9(5)V99 VALUE +00000.00.
     02  CAT-J-HOURS         PICTURE S9(5)V99 VALUE +00000.00.
     02  CAT-K-MONEY         PICTURE S9(5)V99 VALUE 00000.00.
     02  CAT-L-MONEY         PICTURE S9(5)V99 VALUE 00000.00.
     02  CAT-M-MONEY         PICTURE S9(4)V99 VALUE   0000.00.
     02  CAT-M-HOURS         PICTURE S999V999 VALUE +000.00.
     02  CAT-N-MONEY         PICTURE S9(4)V99 VALUE +0000.00.
     02  CAT-N-HOURS         PICTURE S99V99   VALUE +00.00.
     02  CAT-WORK            PICTURE S9(6)V99 VALUE 000000.00.
     02  CAT-MONEY           PICTURE S9(6)V99 VALUE 000000.00.
     02  CAT-C-WORK          PICTURE S9(6)V99 VALUE 000000.00.
     02  HOLD-RETRO-OTPAY    PICTURE S9(5)V99 VALUE 00000.00.
     02  HOLD-RETRO-OTHRS    PICTURE S9(3)V99 VALUE 000.00.
     02  VOUCHER-PAID        PICTURE S9(5)V99 VALUE 00000.00.

01  ARITHMETIC-WORK-AREAS.
    02 MINUS-DIVER-RATE      PICTURE S9V99    VALUE ZEROS.
     02  ANNUM-OT-MAX        PICTURE S9V99    VALUE +8.76.
     02  FF-MAX-RATE         PICTURE S9(9)V99 VALUE +12151.00.
     02  ANNUM-MAX-PAY       PICTURE S9(5)V99 VALUE +01279.20.
     02  HRLY-RATE-WORK      PICTURE S9(5)V99 VALUE +00000.00.
     02  SAVE-NITE-PAY       PICTURE S9(5)V99 VALUE +00000.00.
     02  DIEM-NITE-PAY       PICTURE S9(5)V99 VALUE +00000.00.
     02  DIEM-BONUS-PAY      PICTURE S9(5)V99 VALUE +00000.00.
     02  TAX-LEVY-DED        PICTURE S9(5)V99 VALUE +00000.00.
     02  ADJ-WK-SUB          PICTURE S9(5)V99 VALUE +00000.00.
     02  ADJ-REG-HRS         PICTURE S999V99  VALUE +000.00.
     02  ADJ-REG-MONEY       PICTURE S9(5)V99 VALUE +00000.00.
     02  ADJ-OT-HOURS        PICTURE S999V99  VALUE +000.00.
     02  ADJ-OT-MONEY        PICTURE S9(5)V99 VALUE +00000.00.
     02  ADJ-OTHER-MONEY     PICTURE S9(5)V99 VALUE +00000.00.
     02  80TH-INSUR          PICTURE S999V99  VALUE +000.00.
     02  FF-PREM-WORK        PICTURE S999V99  VALUE +000.00.
     02  FF-BONUS-PERCENT    PICTURE SV999    VALUE +.000.
     02  FF-BONUS-HOURS      PICTURE S99V9    VALUE +00.0.
     02  TOT-SUB-RETIRE      PICTURE S9(7)V99 VALUE +0000000.00.
     02  SR-LINE-COUNT       PICTURE S999     VALUE +000.
     02  EX-LINE-COUNT       PICTURE S999     VALUE +054.
     02  SR-PAGE-COUNT       PICTURE S99999      VALUE 00000.
     02  CHECK-COUNT         PICTURE S9       VALUE +1.
     02  ROUND-WORK-AREA     PICTURE S9(6)V999 VALUE +000000.000.
     02  SAVE-PAYOFF         PICTURE S9(9)V99 VALUE +000000000.00.
     02  ST-CURR-EARNED      PICTURE S9(7)V99 VALUE ZEROS.
     02  YRLY-GROSS          PICTURE S9(6)V99 VALUE ZEROS.
     02  YRLY-ADJ-GROSS      PICTURE S9(7)V99 VALUE ZEROS.
     02 YRLY-FED-TAXES       PICTURE S9(6)V99 VALUE ZEROS.
     02 YRLY-NET             PICTURE S9(6)V99 VALUE ZEROS.
     02 HALF-FED             PICTURE S9(5)V99 VALUE ZEROS.
     02 ALLOWANCE            PICTURE S9(4)V99 VALUE ZEROS.
     02 ALLI REDEFINES ALLOWANCE.
        04 DEP-ALLOW         PICTURE S99.
        04 BAL-ALLOW         PICTURE 99V99.
     02  TAXABLE         PICTURE S9(7)V99 VALUE ZERO.
     02  STATAX-1            PICTURE S9(7)V99 VALUE ZEROS.
     02  STATAX-2            PICTURE S9(7)V99 VALUE ZEROS.
     02  STATAX-3            PICTURE S9(7)V99 VALUE ZEROS.
     02  STATAX-4            PICTURE S9(7)V99 VALUE ZEROS.
     02  STATAX-5            PICTURE S9(7)V99 VALUE ZEROS.
     02  STATAX-6            PICTURE S9(7)V99 VALUE ZEROS.
     02  YEARLY-STATAX       PICTURE S9(7)V99 VALUE ZEROS.
     02 NY-CTR               PICTURE S99      VALUE ZEROS.
     02 TAX-PC               PICTURE SV9999.

01   NC-STATE-TAX-TABLE.
     02 FILLER               PICTURE X(6)     VALUE "003359".
     02 FILLER               PICTURE X(6)     VALUE "103090".
     02 FILLER               PICTURE X(6)     VALUE "162928".
     02 FILLER               PICTURE X(6)     VALUE "202821".
     02 FILLER               PICTURE X(6)     VALUE "222767".
     02 FILLER               PICTURE X(6)     VALUE "262659".
     02 FILLER               PICTURE X(6)     VALUE "282605".
     02 FILLER               PICTURE X(6)     VALUE "302552".
     02 FILLER               PICTURE X(6)     VALUE "322498".
     02 FILLER               PICTURE X(6)     VALUE "342444".
     02 FILLER               PICTURE X(6)     VALUE "362390".
     02 FILLER               PICTURE X(6)     VALUE "382336".
     02 FILLER               PICTURE X(6)     VALUE "402282".
     02 FILLER               PICTURE X(6)     VALUE "422228".
     02 FILLER               PICTURE X(6)     VALUE "442175".
     02 FILLER               PICTURE X(6)     VALUE "462121".
     02 FILLER               PICTURE X(6)     VALUE "482021".
     02 FILLER               PICTURE X(6)     VALUE "502013".
     02 FILLER               PICTURE X(6)     VALUE "521959".
     02 FILLER               PICTURE X(6)     VALUE "541905".
     02 FILLER               PICTURE X(6)     VALUE "561852".
     02 FILLER               PICTURE X(6)     VALUE "581805".
     02 FILLER               PICTURE X(6)     VALUE "601758".
     02 FILLER               PICTURE X(6)     VALUE "621712".
     02 FILLER               PICTURE X(6)     VALUE "641666".
     02 FILLER               PICTURE X(6)     VALUE "661620".
     02 FILLER               PICTURE X(6)     VALUE "681574".
     02 FILLER               PICTURE X(6)     VALUE "701528".
     02 FILLER               PICTURE X(6)     VALUE "721482".
     02 FILLER               PICTURE X(6)     VALUE "741435".
     02 FILLER               PICTURE X(6)     VALUE "761389".
     02 FILLER               PICTURE X(6)     VALUE "781343".
     02 FILLER               PICTURE X(6)     VALUE "801297".
     02 FILLER               PICTURE X(6)     VALUE "821251".
01   NC-STABLE REDEFINES NC-STATE-TAX-TABLE.
     02 EXEMP-RATES                           OCCURS 34 TIMES.
        03 EX-EM             PICTURE 99.
        03 EX-AMT            PICTURE 99V99.
01   INCR-TAX.
     02 TAXER                PICTURE 99.
01   NY-TAX-TABLE.
     02  FILLER              PICTURE X(13)  VALUE "0000000002050".
     02  FILLER              PICTURE X(13)  VALUE "0038007803075".
     02  FILLER              PICTURE X(13)  VALUE "0115031404100".
     02  FILLER              PICTURE X(13)  VALUE "0192063005125".
     02  FILLER              PICTURE X(13)  VALUE "0269102406150".
     02  FILLER              PICTURE X(13)  VALUE "0346149707175".
     02  FILLER              PICTURE X(13)  VALUE "0423204908200".
     02  FILLER              PICTURE X(13)  VALUE "0500268109225".
     02  FILLER              PICTURE X(13)  VALUE "0577339110250".
     02  FILLER              PICTURE X(13)  VALUE "0654418111275".
     02  FILLER              PICTURE X(13)  VALUE "0731504912300".
     02  FILLER              PICTURE X(13)  VALUE "0808599613325".
     02  FILLER              PICTURE X(13)  VALUE "0885702314350".
     02  FILLER              PICTURE X(13)  VALUE "0962812815375".
01   TABLE-NY REDEFINES NY-TAX-TABLE.
     02  NY-TAXES                           OCCURS 14 TIMES.
        03 NY-WAGE           PICTURE S9(4).
        03 NY-ST-TAX         PICTURE S99V99.
        03 NY-PCAMT          PICTURE SV99999.
01   CALIF-TAX-TABLES.
     02  CALIF-SINGLE-MAR-WAGES.
         04  FILLER          PICTURE S999V99 VALUE +077.00.
         04  FILLER          PICTURE S999V99 VALUE +058.00.
         04  FILLER          PICTURE S999V99 VALUE +057.00.
         04  FILLER          PICTURE S999V99 VALUE +058.00.
         04  FILLER          PICTURE S999V99 VALUE +058.00.
         04  FILLER          PICTURE S999V99 VALUE +057.00.
         04  FILLER          PICTURE S999V99 VALUE +058.00.
         04  FILLER          PICTURE S999V99 VALUE +058.00.
         04  FILLER          PICTURE S999V99 VALUE +057.00.
         04  FILLER          PICTURE S999V99 VALUE +154.00.
         04  FILLER          PICTURE S999V99 VALUE +115.00.
         04  FILLER          PICTURE S999V99 VALUE +116.00.
         04  FILLER          PICTURE S999V99 VALUE +115.00.
         04  FILLER          PICTURE S999V99 VALUE +115.00.
         04  FILLER          PICTURE S999V99 VALUE +116.00.
         04  FILLER          PICTURE S999V99 VALUE +115.00.
         04  FILLER          PICTURE S999V99 VALUE +116.00.
         04  FILLER          PICTURE S999V99 VALUE +115.00.
     02  REDEF-CALIF-WAGES REDEFINES CALIF-SINGLE-MAR-WAGES.
         04  CALIF-WAGES     PICTURE S999V99 OCCURS 18 TIMES.
     02  CALIF-SINGLE-MAR-TAX.
         04  FILLER          PICTURE S999V99 VALUE +000.00.
         04  FILLER          PICTURE S999V99 VALUE +000.77.
         04  FILLER          PICTURE S999V99 VALUE +001.92.
         04  FILLER          PICTURE S999V99 VALUE +003.65.
         04  FILLER          PICTURE S999V99 VALUE +005.96.
         04  FILLER          PICTURE S999V99 VALUE +008.85.
         04  FILLER          PICTURE S999V99 VALUE +012.31.
         04  FILLER          PICTURE S999V99 VALUE +016.35.
         04  FILLER          PICTURE S999V99 VALUE +020.96.
         04  FILLER          PICTURE S999V99 VALUE +026.15.
         04  FILLER          PICTURE S999V99 VALUE +000.00.
         04  FILLER          PICTURE S999V99 VALUE +001.54.
         04  FILLER          PICTURE S999V99 VALUE +003.85.
         04  FILLER          PICTURE S999V99 VALUE +007.31.
         04  FILLER          PICTURE S999V99 VALUE +011.92.
         04  FILLER          PICTURE S999V99 VALUE +017.69.
         04  FILLER          PICTURE S999V99 VALUE +024.62.
         04  FILLER          PICTURE S999V99 VALUE +032.69.
         04  FILLER          PICTURE S999V99 VALUE +041.92.
         04  FILLER          PICTURE S999V99 VALUE +052.31.
     02  REDEF-CALIF-TAX REDEFINES CALIF-SINGLE-MAR-TAX.
         04  CALIF-TAX       PICTURE S999V99 OCCURS 20 TIMES.
     02  CALIF-TAX-PLUS-PERCENT.
         04  FILLER          PICTURE SV999   VALUE +.010.
         04  FILLER          PICTURE SV999   VALUE +.020.
         04  FILLER          PICTURE SV999   VALUE +.030.
         04  FILLER          PICTURE SV999   VALUE +.040.
         04  FILLER          PICTURE SV999   VALUE +.050.
         04  FILLER          PICTURE SV999   VALUE +.060.
         04  FILLER          PICTURE SV999   VALUE +.070.
         04  FILLER          PICTURE SV999   VALUE +.080.
         04  FILLER          PICTURE SV999   VALUE +.090.
         04  FILLER          PICTURE SV999   VALUE +.100.
         04  FILLER          PICTURE SV999   VALUE +.010.
         04  FILLER          PICTURE SV999   VALUE +.020.
         04  FILLER          PICTURE SV999   VALUE +.030.
         04  FILLER          PICTURE SV999   VALUE +.040.
         04  FILLER          PICTURE SV999   VALUE +.050.
         04  FILLER          PICTURE SV999   VALUE +.060.
         04  FILLER          PICTURE SV999   VALUE +.070.
         04  FILLER          PICTURE SV999   VALUE +.080.
         04  FILLER          PICTURE SV999   VALUE +.090.
         04  FILLER          PICTURE SV999   VALUE +.100.
     02  REDEF-CALIF-PERCENT REDEFINES CALIF-TAX-PLUS-PERCENT.
         04  CALIF-EXCESS-PERCENT PICTURE SV999 OCCURS 20 TIMES.
     02  CALIF-TAX-CREDIT.
         04  FILLER          PICTURE S99V99  VALUE +00.96.
         04  FILLER          PICTURE S99V99  VALUE +01.27.
         04  FILLER          PICTURE S99V99  VALUE +01.58.
         04  FILLER          PICTURE S99V99  VALUE +01.88.
         04  FILLER          PICTURE S99V99  VALUE +02.19.
         04  FILLER          PICTURE S99V99  VALUE +02.50.
         04  FILLER          PICTURE S99V99  VALUE +02.81.
         04  FILLER          PICTURE S99V99  VALUE +03.12.
         04  FILLER          PICTURE S99V99  VALUE +03.42.
         04  FILLER          PICTURE S99V99  VALUE +03.73.
         04  FILLER          PICTURE S99V99  VALUE +00.96.
         04  FILLER          PICTURE S99V99  VALUE +01.92.
         04  FILLER          PICTURE S99V99  VALUE +02.23.
         04  FILLER          PICTURE S99V99  VALUE +02.54.
         04  FILLER          PICTURE S99V99  VALUE +02.85.
         04  FILLER          PICTURE S99V99  VALUE +03.15.
         04  FILLER          PICTURE S99V99  VALUE +03.46.
         04  FILLER          PICTURE S99V99  VALUE +03.77.
         04  FILLER          PICTURE S99V99  VALUE +04.08.
         04  FILLER          PICTURE S99V99  VALUE +04.38.
     02  REDEF-CALIF-TAX-CREDIT REDEFINES CALIF-TAX-CREDIT.
         04  CALIF-CREDIT    PICTURE S99V99  OCCURS 20 TIMES.

01  SMOOTH-ROLL-ACTY-HDR                       VALUE SPACES.
     02 ACT-CON-1            PICTURE X(253).
     02 ACT-CON-2            PICTURE X(20).
     02 ACT-CON-3            PICTURE X(273).

01  REDEF-SMOOTH-ROLL-ACTY-HDR REDEFINES SMOOTH-ROLL-ACTY-HDR.
     02 ACTY-AND-LOCATION            OCCURS 26 TIMES.
        04 SR-ACT-CODE       PICTURE X.
        04 SR-LOCATION-HDR   PICTURE X(20).

01  ACT-MOVE REDEFINES REDEF-SMOOTH-ROLL-ACTY-HDR.
    02 ACT-GP-1              PICTURE X(105).
    02 ACT-GP-2              PICTURE X(60).
    02 ACT-GP-3              PICTURE X(105).
    02 ACT-GP-4              PICTURE X(60).
    02 ACT-GP-5              PICTURE X(105).
    02 ACT-GP-6              PICTURE X(60).
    02 ACT-GP-7              PICTURE X(51).

01  ACTY-STORE                   PICTURE X   VALUE HIGH-VALUE.

01  UNION-DATA               PICTURE X(175)    VALUE SPACES.

01  UNION-TABLE REDEFINES UNION-DATA.
     02 UNION-CON            OCCURS 35 TIMES INDEXED BY AKEY.
       04 UNION-CODE         PICTURE X.
       04 UNION-DUE          PICTURE 99V99.

01  UNION-MOVE REDEFINES UNION-TABLE.
    02 UNION-GP-1            PICTURE X(105).
    02 UNION-GP-2            PICTURE X(60).
    02 UNION-GP-3            PICTURE X(10).


01  OTHER-CON                                  VALUE SPACES.
    02 ACTY-NAME-LOC         PICTURE X(27).
    02 DISBURSING-CODE       PICTURE XXXX.
    02 NARF-ACTY-CODES.
       04 CODE-1             PICTURE X.
       04 CODE-2             PICTURE X.
       04 CODE-3             PICTURE X.
       04 CODE-4             PICTURE X.
    02 DIFF-GRP-1                PICTURE X(19).
    02 FILLER                    PICTURE X(48).
    02 DIFF-GRP-2                PICTURE X(12).
    02 DEPT-NAME                 PICTURE X(6).
    02 SR-PAGE-SW                PICTURE X.
    02 OUT-ACT-A.
      03 ACT-A1                  PICTURE X.
      03 ACT-A2                  PICTURE X.
      03 ACT-A3                  PICTURE X.
      03 ACT-A4                  PICTURE X.
    02 OUT-GRP-A                 PICTURE X(31).
    02 OUT-ACT-B.
      03 ACT-B1                  PICTURE X.
      03 ACT-B2                  PICTURE X.
      03 ACT-B3                  PICTURE X.
      03 ACT-B4                  PICTURE X.
    02 OUT-GRP-B                 PICTURE X(31).
    02 OUT-ACT-C.
      03 ACT-C1                  PICTURE X.
      03 ACT-C2                  PICTURE X.
      03 ACT-C3                  PICTURE X.
      03 ACT-C4                  PICTURE X.
    02 OUT-GRP-C                 PICTURE X(31).
    02 OUT-ACT-D.
      03 ACT-D1                  PICTURE X.
      03 ACT-D2                  PICTURE X.
      03 ACT-D3                  PICTURE X.
      03 ACT-D4                  PICTURE X.
    02 OUT-GRP-D                 PICTURE X(31).
    02 OUT-ACT-E.
      03 ACT-E1                  PICTURE X.
      03 ACT-E2                  PICTURE X.
      03 ACT-E3                  PICTURE X.
      03 ACT-E4                  PICTURE X.
    02 OUT-GRP-E                 PICTURE X(31).
    02 OUT-ACT-F.
      03 ACT-F1                  PICTURE X.
      03 ACT-F2                  PICTURE X.
      03 ACT-F3                  PICTURE X.
      03 ACT-F4                  PICTURE X.
    02 OUT-GRP-F                 PICTURE X(31).
    02 OUT-ACT-G.
      03 ACT-G1                  PICTURE X.
      03 ACT-G2                  PICTURE X.
      03 ACT-G3                  PICTURE X.
      03 ACT-G4                  PICTURE X.
    02 OUT-GRP-G                 PICTURE X(31).
    02 OUT-ACT-H.
      03 ACT-H1                  PICTURE X.
      03 ACT-H2                  PICTURE X.
      03 ACT-H3                  PICTURE X.
      03 ACT-H4                  PICTURE X.
    02 OUT-GRP-H                 PICTURE X(31).
    02 FILLER                    PICTURE XXX.

01  CON-MOVE REDEFINES OTHER-CON.
    02 CON-GP-1              PICTURE X(85).
    02 FILLER                PICTURE X(276).


01  CON-WORK-REC.
    02 FILLER                PICTURE X(9)    VALUE ZEROS.
    02 CONS-ID               PICTURE X       VALUE SPACE.
    02 FILLER                PICTURE X(28)   VALUE ZEROS.
    02 CONS-DATA-1.
       04 DATA-1A            PICTURE X(20)   VALUE SPACE.
       04 DATA-1B            PICTURE X(85)   VALUE SPACE.
    02 FILLER                PICTURE X(17)   VALUE ZEROS.
    02 CONS-DATA-2           PICTURE X(60)   VALUE SPACE.
    02 FILLER                    PICTURE X(180)  VALUE SPACE.

01  PAY-DIFF-AREA                                VALUE ZEROS.
    02 DIFF-AREA-1.
       04 DIFF-A                 PICTURE 9V99.
       04 DIFF-B                 PICTURE 9V99.
       04 WHARF-DIFF             PICTURE 9V99.
       04 SHIFT-2                PICTURE 9V99.
       04 SHIFT-3                PICTURE 9V99.
       04 DIVER-RATE-KON         PICTURE 99V99.
    02 DIFF-AREA-2.
       04 DIFF-J                 PICTURE 9V99.
       04 DIFF-K                 PICTURE 9V99.
       04 DIFF-N                 PICTURE 9V99.
       04 DIFF-R                 PICTURE 9V99.

01   SR-STRIKE-TEST.
     02  FILLER              PICTURE X(40)   VALUE
         "XXXXXXX--ALIGN-TO-6TH-LINE-FROM-TOPXXXXX".
     02  FILLER              PICTURE X(40)   VALUE
         "XXXXXXXXXX--USE------SPECIAL---CARRIAGE-".
     02  FILLER              PICTURE X(40)   VALUE
         "TAPE---SMOOTH-ROLL-PRINTING---XXXXXXXXXX".
01   SMOOTH-ROLL-TOTALS.
     02  SR-PAGE-ACTIVITY-TOTALS.
         04  SR-PAGE-TOTALS.
             06  PT-EMP-CTR  PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-RATE     PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-NET-PAY  PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-REG-HRS  PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-REG-PAY  PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-OT-HRS   PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-OT-PAY   PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-OTH-HRS  PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-OTH-PAY  PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-CSRA     PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-FICA     PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-FED-TAX  PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-ST-TAX   PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-HEALTH   PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-REG-LIFE PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-AADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-CADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-EADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-GADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-UNION    PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-CONTRIB  PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-OTHER    PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-BOND     PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-ALLOT    PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-BADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-DADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-FADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06  PT-OPT-INS  PICTURE S9(7)V99 VALUE +0000000.00.
         04  SR-CNTL-GP-TOTALS.
             06  CG-EMP-CTR  PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-RATE     PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-NET-PAY  PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-REG-HRS  PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-REG-PAY  PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-OT-HRS   PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-OT-PAY   PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-OTH-HRS  PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-OTH-PAY  PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-CSRA     PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-FICA     PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-FED-TAX  PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-ST-TAX   PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-HEALTH   PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-REG-LIFE PICTURE S9(7)V99 VALUE +0000000.00.
             06 CG-AADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06 CG-CADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06 CG-EADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06 CG-GADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-UNION    PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-CONTRIB  PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-OTHER    PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-BOND     PICTURE S9(7)V99 VALUE +0000000.00.
             06  CG-ALLOT    PICTURE S9(7)V99 VALUE +0000000.00.
             06 CG-BADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06 CG-DADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06 CG-FADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06 CG-OPT-INS   PICTURE S9(7)V99 VALUE +0000000.00.
         04  SR-ACTIVITY-TOTALS.
             06  AT-EMP-CTR  PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-RATE     PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-NET-PAY  PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-REG-HRS  PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-REG-PAY  PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-OT-HRS   PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-OT-PAY   PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-OTH-HRS  PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-OTH-PAY  PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-CSRA     PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-FICA     PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-FED-TAX  PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-ST-TAX   PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-HEALTH   PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-REG-LIFE PICTURE S9(7)V99 VALUE +0000000.00.
             06 AT-AADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06 AT-CADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06 AT-EADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06 AT-GADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-UNION    PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-CONTRIB  PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-OTHER    PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-BOND     PICTURE S9(7)V99 VALUE +0000000.00.
             06  AT-ALLOT    PICTURE S9(7)V99 VALUE +0000000.00.
             06 AT-BADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06 AT-DADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06 AT-FADD      PICTURE S9(7)V99 VALUE +0000000.00.
             06 AT-OPT-INS   PICTURE S9(7)V99 VALUE +0000000.00.
         04  PAYROLL-GRAND-TOTALS.
             06  PGT-EMP-CTR  PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-RATE     PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-NET-PAY  PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-REG-HRS  PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-REG-PAY  PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-OT-HRS   PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-OT-PAY   PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-OTH-HRS  PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-OTH-PAY  PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-CSRA     PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-FICA     PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-FED-TAX  PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-ST-TAX   PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-HEALTH   PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-REG-LIFE PICTURE S9(7)V99 VALUE 0000000.00.
             06 PGT-AADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06 PGT-CADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06 PGT-EADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06 PGT-GADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06  PGT-UNION    PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-CONTRIB  PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-OTHER    PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-BOND     PICTURE S9(7)V99 VALUE 0000000.00.
             06  PGT-ALLOT    PICTURE S9(7)V99 VALUE 0000000.00.
             06 PGT-BADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06 PGT-DADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06 PGT-FADD     PICTURE S9(7)V99 VALUE +0000000.00.
             06 PGT-OPT-INS  PICTURE S9(7)V99 VALUE +0000000.00.
     02  REDEF-SR-TOTALS REDEFINES SR-PAGE-ACTIVITY-TOTALS.
         04  REDEF-PAGE-ACTIVITY-TOTS        OCCURS 4 TIMES.
             06  RT-EMP-CTR  PICTURE S9(7)V99.
             06  RT-RATE     PICTURE S9(7)V99.
             06  RT-NET-PAY  PICTURE S9(7)V99.
             06  RT-REG-HRS  PICTURE S9(7)V99.
             06  RT-REG-PAY  PICTURE S9(7)V99.
             06  RT-OT-HRS   PICTURE S9(7)V99.
             06  RT-OT-PAY   PICTURE S9(7)V99.
             06  RT-OTH-HRS  PICTURE S9(7)V99.
             06  RT-OTH-PAY  PICTURE S9(7)V99.
             06  RT-CSRA     PICTURE S9(7)V99.
             06  RT-FICA     PICTURE S9(7)V99.
             06  RT-FED-TAX  PICTURE S9(7)V99.
             06  RT-ST-TAX   PICTURE S9(7)V99.
             06  RT-HEALTH   PICTURE S9(7)V99.
             06  RT-REG-LIFE PICTURE S9(7)V99.
             06  RT-AADD     PICTURE S9(7)V99.
             06 RT-CADD      PICTURE S9(7)V99.
             06 RT-EADD      PICTURE S9(7)V99.
             06 RT-GADD      PICTURE S9(7)V99.
             06  RT-UNION    PICTURE S9(7)V99.
             06  RT-CONTRIB  PICTURE S9(7)V99.
             06  RT-OTHER    PICTURE S9(7)V99.
             06  RT-BOND     PICTURE S9(7)V99.
             06  RT-ALLOT    PICTURE S9(7)V99.
             06 RT-BADD      PICTURE S9(7)V99.
             06 RT-DADD      PICTURE S9(7)V99.
             06 RT-FADD      PICTURE S9(7)V99.
             06 RT-OPT-INS   PICTURE S9(7)V99.

01  CONTROL-TOTALS.
     02  CHECK-COUNTER       PICTURE S9(7)V99 VALUE +0000000.00.
     02  SUBJECT-FICA        PICTURE S9(7)V99 VALUE +0000000.00.
     02  SUBJECT-RETIRE      PICTURE S9(7)V99 VALUE +0000000.00.
     02  HEALTH-COUNT        PICTURE S9(7)V99 VALUE +0000000.00.
     02  EMPLOYEE-HEALTH     PICTURE S9(7)V99 VALUE +0000000.00.
     02  EMPLOYER-HEALTH     PICTURE S9(7)V99 VALUE +0000000.00.
     02  BASIC-HOURS         PICTURE S9(7)V99 VALUE +0000000.00.
     02  OVERTIME-HOURS      PICTURE S9(7)V99 VALUE +0000000.00.
     02  BOND-COUNT      PICTURE   S9(7)V99 VALUE +0000000.00.
     02  BOND-DEDUCTION  PICTURE   S9(7)V99 VALUE +0000000.00.
01  REDEF-CONTROL-TOTALS REDEFINES CONTROL-TOTALS.
     02  CNTRL-TOTS      PICTURE S9(7)V99 OCCURS 10 TIMES.

01   FED-TAX-COMPUTATION-TABLES.
     02  SINGLE-MARRIED-WAGES.
         04  FILLER          PICTURE S999V99 VALUE +069.00.
         04  FILLER          PICTURE S999V99 VALUE +077.00.
         04  FILLER          PICTURE S999V99 VALUE +258.00.
         04  FILLER          PICTURE S999V99 VALUE +058.00.
         04  FILLER          PICTURE S999V99 VALUE +076.00.
         04  FILLER          PICTURE S999V99 VALUE +127.00.
         04  FILLER          PICTURE S999V99 VALUE +079.00.
         04  FILLER          PICTURE S999V99 VALUE +256.00.
         04  FILLER          PICTURE S999V99 VALUE +078.00.
         04  FILLER          PICTURE S999V99 VALUE +235.00.
         04  FILLER          PICTURE S999V99 VALUE +169.00.
         04  FILLER          PICTURE S999V99 VALUE +154.00.
     02  REDEF-WAGES REDEFINES SINGLE-MARRIED-WAGES.
         04  TAXABLE-WAGES   PICTURE S999V99 OCCURS 12 TIMES.
     02  SINGLE-MARRIED-DEDUCTIONS.
         04  FILLER          PICTURE S999V99  VALUE +000.00.
         04  FILLER          PICTURE S999V99 VALUE +006.72.
         04  FILLER          PICTURE S999V99 VALUE +020.58.
         04  FILLER          PICTURE S999V99 VALUE +074.76.
         04  FILLER          PICTURE S999V99 VALUE +088.10.
         04  FILLER          PICTURE S999V99 VALUE +108.62.
         04  FILLER          PICTURE S999V99 VALUE +147.99.
         04  FILLER          PICTURE S999V99  VALUE +000.00.
         04  FILLER          PICTURE S999V99 VALUE +008.12.
         04  FILLER          PICTURE S999V99 VALUE +049.08.
         04  FILLER          PICTURE S999V99 VALUE +064.68.
         04  FILLER          PICTURE S999V99 VALUE +121.08.
         04  FILLER          PICTURE S999V99 VALUE +168.40.
         04  FILLER          PICTURE S999V99 VALUE +217.68.
     02  REDEF-DEDUCTIONS REDEFINES SINGLE-MARRIED-DEDUCTIONS.
         04  TAX-DEDUCTIONS  PICTURE S999V99 OCCURS 14 TIMES.
     02  TAX-PLUS-PERCENT.
         04  FILLER          PICTURE SV999    VALUE +.140.
         04  FILLER          PICTURE SV999   VALUE +.180.
         04  FILLER          PICTURE SV999   VALUE +.210.
         04  FILLER          PICTURE SV999   VALUE +.230.
         04  FILLER          PICTURE SV999   VALUE +.270.
         04  FILLER          PICTURE SV999   VALUE +.310.
         04  FILLER          PICTURE SV999   VALUE +.350.
         04  FILLER          PICTURE SV999    VALUE +.140.
         04  FILLER          PICTURE SV999   VALUE +.160.
         04  FILLER          PICTURE SV999   VALUE +.200.
         04  FILLER          PICTURE SV999   VALUE +.240.
         04  FILLER          PICTURE SV999   VALUE +.280.
         04  FILLER          PICTURE SV999   VALUE +.320.
         04  FILLER          PICTURE SV999   VALUE +.360.
     02  REDEF-PERCENT REDEFINES TAX-PLUS-PERCENT.
         04  EXCESS-PERCENT  PICTURE SV999   OCCURS 14 TIMES.

01   PAYROLL-EXC-LIST-TOTALS.
     02  EXC-CODE1           PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE2           PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE3           PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE4           PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE5           PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE6           PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE7           PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE8           PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE9           PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE10          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE11          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE12          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE13          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE14          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE15          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE16          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE17          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE18          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE19          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE20          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE21          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE22          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE23          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE24          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE25          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE26          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE27          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE28          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE29          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE30          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE31          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE32          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE33          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE34          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE35          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE36          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE37          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE38          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE39          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE40          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE41          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE42          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE43          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE44          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE45          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE46          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE47          PICTURE S9(5)V99 VALUE +00000.00.
     02  EXC-CODE48          PICTURE S9(5)V99 VALUE +00000.00.
01   REDEF-LIST-TOTS REDEFINES PAYROLL-EXC-LIST-TOTALS.
     02  EXC-LIST-TOT        PICTURE S9(5)V99 OCCURS 48 TIMES.

01   PAYROLL-EOJ-REC-TOTS.
     02  MSTR-IN             PICTURE S9(5)   VALUE +00000.
     02  DTL-IN              PICTURE S9(5)   VALUE +00000.
     02  MSTR-OUT            PICTURE S9(5)   VALUE +00000.
     02  ACTIVE-OUT          PICTURE S9(5)   VALUE +00000.
     02  SR-OUT              PICTURE S9(5)   VALUE +00000.
     02  WT-OUT              PICTURE S9(5)   VALUE +00000.
     02  EXC-OUT             PICTURE S9(5)   VALUE +00000.
     02  ERR-DET-OUT         PICTURE S9(5)   VALUE +00000.
     02  CONTROL-REC-OUT     PICTURE S9(5)   VALUE +00000.
     02  YTD-OUT             PICTURE S9(5) VALUE ZERO.
01   REDEF-EOJ-TOTS REDEFINES PAYROLL-EOJ-REC-TOTS.
     02  EOJ-TOTALS          PICTURE S9(5) OCCURS 10 TIMES.

01   BINARY-WORK-AREA.
     02  SUBS-1              PICTURE S99     VALUE +00.
     02  SUBS-2              PICTURE S99     VALUE +00.
     02  SUBS-3              PICTURE S99     VALUE +00.
     02  SUBS-4              PICTURE S99     VALUE 00.
     02  WORK-CODE           PICTURE S99     VALUE +00.
     02  CASH-AWARD-SUBS     PICTURE S99     VALUE +00.

01   CONTR-HEADER.
     02  FILLER        PICTURE X(20) VALUE "CONTROL LISTING".
     02  CONTR-GORU    PICTURE X(20).
     02  FILLER        PICTURE X(12) VALUE "IH340  PPE".
     02  CONTR-DATE    PICTURE X(18).
     02  FILLER        PICTURE X(8) VALUE "PAGE NO".
     02  CONTR-PAGE    PICTURE ZZZZ9.
     02  FILLER        PICTURE X(37) VALUE SPACES.

01   CLPAGE    PICTURE 9(5) VALUE ZERO.
01   EXCPAGE                 PICTURE 9999  VALUE ZERO.

PROCEDURE  DIVISION.
1STPAR.
     NOTE *******************************************************
          *                                                     *
          *  PAYROLL HOUSEKEEPING ROUTINE                       *
          *      OPEN ALL INPUT AND OUTPUT FILES                *
          *      GETPARM  WEEK/BEGINNING AND WEEK/ENDING DATES  *
          *          PER ANNUM ROLL NUMBER                      *
          *              EXCEPTION RUN CONTROL SWITCH SETTINGS  *
          *                                                     *
          *******************************************************.

100140.
     DISPLAY "BEGIN IH340 REVISION A AS OF  04/71".
     OPEN INPUT PERS-MSTR-IN-FILE.
     OPEN INPUT PAYROLL-DETAIL-FILE.
         OPEN OUTPUT PERS-MSTR-OUT-FILE.
         OPEN OUTPUT SMOOTH-ROLL-FILE.
         OPEN OUTPUT PAYROLL-WORK-FILE.
         OPEN OUTPUT CONTROL-ERROR-FILE,
         OPEN OUTPUT PAY-EXCEPT-LIST-FILE.
             MOVE SPACES TO SMOOTH-ROLL-REC,
                            PAYROLL-WORK-REC,
                            CONTROL-REC,
                        PAY-EXCEPT-LIST-REC.
     WRITE SMOOTH-ROLL-REC FROM SR-STRIKE-TEST BEFORE ADVANCING
         NEXT-PAGE.
     MOVE ALL SPACES TO SMOOTH-ROLL-REC.


     NOTE *******************************************************
          *                                                     *
          *  EXTRACT CONSTANT DATA FROM CONSTANT RECORDS        *
          *  GET PARM DATA FROM EXEC CARD                       *
          *      AUDIT FIELDS FOR CORRECT INFORMATION           *
          *                                                     *
          *******************************************************.

103000.
     READ PAYROLL-DETAIL-FILE, AT END GO TO 408010.
     IF PARAM-CNTL NOT EQUAL TO ZEROS, GO TO 490000.
     MOVE PARAM-DATA-IN TO PARM-DATA.
     PERFORM 376000.
         IF BEGIN-CHECK-NO NOT NUMERIC,
             GO TO 104100.
       IF ROLL-NO NOT NUMERIC GO TO 104120.
         IF ROLL-NO GREATER THAN 00,
             AND LESS THAN 28,
            GO TO PROCESS-CONSTANTS.
     GO TO 104120.
104100.
     DISPLAY "XXXXXXXXXX BEGIN CHECK INVALID" BEGIN-CHECK-NO.
     STOP "XXXXXXXXXX HALT 0004".
     GO TO 104100.
104120.
     IF ROLL-NO EQUALS 99 GO TO PROCESS-CONSTANTS.
     DISPLAY "XXXXXXXXXX ROLL NR. INVALID" ROLL-NO.
     STOP "XXXXXXXXXX HALT 0005".
     GO TO 104120.


PROCESS-CONSTANTS.
     READ PERS-MSTR-IN-FILE  AT END GO TO 408140.
        IF IN-ACTY-MAJOR EQUAL "V" GO TO PROCESS-CONSTANTS.
     IF CON-ID NOT EQUAL TO ZEROS GO TO CONSTANT-MISS.
     IF CON-KEY NOT EQUAL TO "1" GO TO CK-FOR-2.
     MOVE ACT-DATA-1 TO ACT-CON-1.
     MOVE ACT-NAME TO ACT-CON-2.
     MOVE ACT-DATA-2 TO ACT-CON-3.
     MOVE CONSTANT-REC-1 TO PERS-MSTR-OUT-REC.
     WRITE PERS-MSTR-OUT-REC.
     IF OTHER-CON EQUAL TO SPACES GO TO PROCESS-CONSTANTS.
     GO TO WRITE-CON-WORK.

CK-FOR-2.
     IF CON-KEY NOT EQUAL TO "2" GO TO CONSTANT-MISS.
     MOVE UNION-DATA-IN TO UNION-DATA.
     MOVE LOCAL-CON TO OTHER-CON.
     MOVE CONSTANT-REC-2 TO PERS-MSTR-OUT-REC.
     WRITE PERS-MSTR-OUT-REC.
     IF ACT-CON-1 EQUAL TO SPACES GO TO PROCESS-CONSTANTS.
     GO TO WRITE-CON-WORK.

CONSTANT-MISS.
     DISPLAY "XXXXXXXXXX CONSTANT REC ERROR".
     GO TO CONSTANT-MISS.

WRITE-CON-WORK.
     MOVE "1" TO CONS-ID.
     MOVE ACT-GP-1 TO CONS-DATA-1.
     MOVE ACT-GP-2 TO CONS-DATA-2.
     MOVE CON-WORK-REC TO PAYROLL-WORK-REC.
     WRITE PAYROLL-WORK-REC.
     MOVE "2" TO CONS-ID.
     MOVE ACT-GP-3 TO CONS-DATA-1.
     MOVE ACT-GP-4 TO CONS-DATA-2.
     MOVE CON-WORK-REC TO PAYROLL-WORK-REC.
     WRITE PAYROLL-WORK-REC.
     MOVE "3" TO CONS-ID.
     MOVE ACT-GP-5 TO CONS-DATA-1.
     MOVE ACT-GP-6 TO CONS-DATA-2.
     MOVE CON-WORK-REC TO PAYROLL-WORK-REC.
     WRITE PAYROLL-WORK-REC.
     MOVE "4" TO CONS-ID.
     MOVE ACT-GP-7 TO CONS-DATA-1.
     MOVE SPACES TO CONS-DATA-2.
     MOVE CON-WORK-REC TO PAYROLL-WORK-REC.
     WRITE PAYROLL-WORK-REC.
     MOVE "5" TO CONS-ID.
     MOVE UNION-GP-1 TO CONS-DATA-1.
     MOVE UNION-GP-2 TO CONS-DATA-2.
     MOVE CON-WORK-REC TO PAYROLL-WORK-REC.
     WRITE PAYROLL-WORK-REC.
     MOVE "6" TO CONS-ID.
     MOVE UNION-GP-3 TO DATA-1A.
     MOVE CON-GP-1 TO DATA-1B.
     MOVE SPACES TO CONS-DATA-2.
     MOVE CON-WORK-REC TO PAYROLL-WORK-REC.
     WRITE PAYROLL-WORK-REC.
     MOVE SPACES TO PAYROLL-WORK-REC.
     MOVE ZEROES TO WT-TAX-LEVY-ZEROS.
     MOVE ZEROES TO WT-MONEY-HOURS-ZEROS.

     NOTE *******************************************************
          *                                                     *
          *  BEGIN PAYROLL MAIN PROGRAM ROUTINE                 *
          *      READ PERSONNEL MASTER FILE AND                 *
          *          SEQUENCE CHECK EACH MASTER                 *
          *                                                     *
          *******************************************************.

108090.
     READ PERS-MSTR-IN-FILE,
        AT END GO TO 408140.
        IF IN-ACTY-MAJOR EQUAL "V" GO TO 108090.
     ADD  +1 TO MSTR-IN.
     MOVE +1 TO CHECK-COUNT.
     IF MSTR-IN-SEQ GREATER THAN SEQ-PERS-MSTR,
         MOVE MSTR-IN-SEQ TO SEQ-PERS-MSTR,
         MOVE PERS-MSTR-IN-REC TO PERS-MSTR-OUT-REC,
             GO TO 110070.
     IF MSTR-IN-SEQ IS EQUAL TO SEQ-PERS-MSTR, GO TO 109000.
             GO TO 110000.

109000.
     PERFORM 198160.
     MOVE DUP-MSG TO ERR-EXPLAIN.
     ALTER 198140 TO PROCEED TO 108090.
     GO TO 198050.
     NOTE *******************************************************
          *                                                     *
          *  TEST FOR PAYROLL RUN EXCEPTIONS,                   *
          *      IF RUN EXCEPTION CODE EQUAL TO PERSONNEL       *
          *          MASTER ACTIVITY CODE BYPASS MASTER         *
          *                                                     *
          *******************************************************.

110000.
     DISPLAY "XXXXXXXXXX MASTER IN  " MSTR-IN-SEQ.
     DISPLAY "XXXXXXXXXX MASTER HOLD" SEQ-PERS-MSTR.
     STOP "XXXXXXXXXX HALT 0001".
     GO TO 110000.
110070.
     IF EXCEPT-CODES EQUAL TO SPACES,
             GO TO 112070.
         MOVE 01 TO SUBS-1.
110110.
         IF MSTR-ACTY EQUAL TO EXCEPT-TABLE (SUBS-1),
             GO TO 406100.
     IF SUBS-1 IS LESS THAN 24,
             ADD 01 TO SUBS-1,
                 GO TO 110110.

     NOTE *******************************************************
          *                                                     *
          *  SELECT ACTIVE PERSONNEL                            *
          *      TEST WEEK ENDING DATE AGAINST ENTRANCE         *
          *          ON DUTY DATE, IF EOD IS GREATER THAN       *
          *          W/E DATE BYPASS MASTER                     *
          *  LOAD PAY DIFF  VALUES INTO COMPUTE AREA            *
          *                                                     *
          *******************************************************.

112070.
     IF NOT ACTIVE-MSTR,
         GO TO 406100.
         MOVE EOD-YEAR TO TEST-EOD-YR.
         MOVE EOD-MODAY TO TEST-EOD-MODAY.
         MOVE WE-YEAR TO TEST-WE-YR.
         MOVE WE-MODAY TO TEST-WE-MODAY.
         IF TEST-EOD GREATER THAN TEST-WE,
             GO TO 406100.
     IF MSTR-ACTY EQUAL TO ACTY-STORE GO TO 112120.
     MOVE MSTR-ACTY TO ACTY-STORE.
     IF OUT-ACT-A EQUAL TO SPACES GO TO 112074.
     IF ACT-A1 EQUAL TO MSTR-ACTY GO TO 112072.
     IF ACT-A2 EQUAL TO MSTR-ACTY GO TO 112072.
     IF ACT-A3 EQUAL TO MSTR-ACTY GO TO 112072.
     IF ACT-A4 EQUAL TO MSTR-ACTY GO TO 112072.
     GO TO 112074.
112072.
     MOVE OUT-GRP-A TO PAY-DIFF-AREA.
     GO TO 112100.
112074.
     IF OUT-ACT-B EQUAL TO SPACES GO TO 112078.
     IF ACT-B1 EQUAL TO MSTR-ACTY GO TO 112076.
     IF ACT-B2 EQUAL TO MSTR-ACTY GO TO 112076.
     IF ACT-B3 EQUAL TO MSTR-ACTY GO TO 112076.
     IF ACT-B4 EQUAL TO MSTR-ACTY GO TO 112076.
     GO TO 112078.
112076.
     MOVE OUT-GRP-B TO PAY-DIFF-AREA.
     GO TO 112100.
112078.
     IF OUT-ACT-C EQUAL TO SPACES GO TO 112082.
     IF ACT-C1 EQUAL TO MSTR-ACTY GO TO 112080.
     IF ACT-C2 EQUAL TO MSTR-ACTY GO TO 112080.
     IF ACT-C3 EQUAL TO MSTR-ACTY GO TO 112080.
     IF ACT-C4 EQUAL TO MSTR-ACTY GO TO 112080.
     GO TO 112082.
112080.
     MOVE OUT-GRP-C TO PAY-DIFF-AREA.
     GO TO 112100.
112082.
     IF OUT-ACT-D EQUAL TO SPACES GO TO 112086.
     IF ACT-D1 EQUAL TO MSTR-ACTY GO TO 112084.
     IF ACT-D2 EQUAL TO MSTR-ACTY GO TO 112084.
     IF ACT-D3 EQUAL TO MSTR-ACTY GO TO 112084.
     IF ACT-D4 EQUAL TO MSTR-ACTY GO TO 112084.
     GO TO 112086.
112084.
     MOVE OUT-GRP-D TO PAY-DIFF-AREA.
     GO TO 112100.
112086.
     IF OUT-ACT-E EQUAL TO SPACES GO TO 112090.
     IF ACT-E1 EQUAL TO MSTR-ACTY GO TO 112088.
     IF ACT-E2 EQUAL TO MSTR-ACTY GO TO 112088.
     IF ACT-E3 EQUAL TO MSTR-ACTY GO TO 112088.
     IF ACT-E4 EQUAL TO MSTR-ACTY GO TO 112088.
     GO TO 112090.
112088.
     MOVE OUT-GRP-E TO PAY-DIFF-AREA.
     GO TO 112100.
112090.
     IF OUT-ACT-F EQUAL TO SPACES GO TO 112092.
     IF ACT-F1 EQUAL TO MSTR-ACTY GO TO 112091.
     IF ACT-F2 EQUAL TO MSTR-ACTY GO TO 112091.
     IF ACT-F3 EQUAL TO MSTR-ACTY GO TO 112091.
     IF ACT-F4 EQUAL TO MSTR-ACTY GO TO 112091.
     GO TO 112092.
112091.
     MOVE OUT-GRP-F TO PAY-DIFF-AREA.
     GO TO 112100.
112092.
     IF OUT-ACT-G EQUAL TO SPACES GO TO 112094.
     IF ACT-G1 EQUAL TO MSTR-ACTY GO TO 112093.
     IF ACT-G2 EQUAL TO MSTR-ACTY GO TO 112093.
     IF ACT-G3 EQUAL TO MSTR-ACTY GO TO 112093.
     IF ACT-G4 EQUAL TO MSTR-ACTY GO TO 112093.
     GO TO 112094.
112093.
     MOVE OUT-GRP-G TO PAY-DIFF-AREA.
     GO TO 112100.
112094.
     IF OUT-ACT-H EQUAL TO SPACES GO TO 112098.
     IF ACT-H1 EQUAL TO MSTR-ACTY GO TO 112096.
     IF ACT-H2 EQUAL TO MSTR-ACTY GO TO 112096.
     IF ACT-H3 EQUAL TO MSTR-ACTY GO TO 112096.
     IF ACT-H4 EQUAL TO MSTR-ACTY GO TO 112096.
     GO TO 112098.
112096.
     MOVE OUT-GRP-H TO PAY-DIFF-AREA.
     GO TO 112100.
112098.
     MOVE DIFF-GRP-1 TO DIFF-AREA-1.
     MOVE DIFF-GRP-2 TO DIFF-AREA-2.
112100.
     MULTIPLY DIVER-RATE-KON BY -1.00 GIVING MINUS-DIVER-RATE.
112120.
     IF MSTR-HOURLY-RATE EQUAL TO +00.00,
         MOVE ZEROS TO NET-PAY,
             GO TO 338170.

FFNOTE1.
     NOTE *******************************************************
          *                                                     *
          *  TEST FOR FIREFIGHTER OR FIRECHIEF MASTER           *
          *      SAVE PREMIUM PERCENT, PREMIUM HOURS,           *
          *      AND PREMIUM BONUS HOURS                        *
          *                                                     *
          *******************************************************.
112170.

     IF NOT-FF-MSTR,
         GO TO 114070.
     IF FIRE-CHIEF-MSTR,
         GO TO 112400.
     MOVE +144 TO FF-PREM-WORK.
     MOVE +64.0 TO FF-BONUS-HOURS.
     IF FF-QRTR-PREM-MSTR,
         MOVE +.150 TO FF-BONUS-PERCENT,
             GO TO 114070.
     IF FF-HALF-PREM-MSTR,
         MOVE +.225 TO FF-BONUS-PERCENT,
             GO TO 114070.
     IF FF-FULL-PREM-MSTR,
         MOVE +.250 TO FF-BONUS-PERCENT,
             GO TO 114070.
112370.
         MOVE +.200 TO FF-BONUS-PERCENT.
             GO TO 114070.
112400.
     MOVE +112 TO FF-PREM-WORK.
     MOVE +32.0 TO FF-BONUS-HOURS.
     IF FF-HALF-PREM-MSTR,
         MOVE +.175 TO FF-BONUS-PERCENT,
             GO TO 114070.
     IF FF-FULL-PREM-MSTR,
             GO TO 112370.
         MOVE +.150 TO FF-BONUS-PERCENT.

     NOTE *******************************************************
          *                                                     *
          *  TEST FOR MAJOR CONTROL BREAK BY ACTIVITY, OR MINOR *
          *      CONTROL BREAK BY CONTROL GROUP CODE            *
          *          WRITE SMOOTH ROLL PAGE AND ACTIVITY        *
          *          TOTALS                                     *
          *          WRITE PAYROLL CONTROLS                     *
          *                                                     *
          *******************************************************.

114070.
     GO TO 114170.
114090.
     IF MSTR-MAJ-CNTRL NOT EQUAL TO HOLD-CONTROLS,
     MOVE HOLD-CONTROLS TO SAVE-HOLD-CONTROLS,
         ALTER 372090 TO PROCEED TO 372110,
                 GO TO 368080.
114170.
     ALTER 114070 TO PROCEED TO 114090.
114190.
     MOVE MSTR-MAJ-CNTRL TO HOLD-CONTROLS.

     NOTE *******************************************************
          *                                                     *
          *  READ PAYROLL DETAIL FILE                           *
          *      EDIT HOURS AND AMOUNT FIELDS FOR TRUE          *
          *      NUMERIC VALUES                                 *
          *          SEQUENCE CHECK EACH DETAIL                 *
          *                                                     *
          *******************************************************.

116100.
     GO TO 116120.
116120.
     ALTER 116100 TO PROCEED TO 120170.
116140.
     READ PAYROLL-DETAIL-FILE,
         AT END GO TO 408010.
     ADD +1 TO DTL-IN.
     ADD +1 TO DTL-IN-GRP.
     EXAMINE DTL-X-HOURS REPLACING ALL " " BY "0".
     EXAMINE DTL-X-AMOUNT REPLACING ALL " " BY "0".
     IF DTL-SEQ EQUAL TO SEQ-PAY-DTL,
         GO TO 194010.
     IF DTL-SEQ LESS THAN SEQ-PAY-DTL,
         GO TO 480000.
         MOVE DTL-SEQ TO SEQ-PAY-DTL.

     NOTE *******************************************************
          *                                                     *
          *  TEST FOR PAYROLL RUN EXCEPTIONS                    *
          *      IF RUN EXCEPTION CODE EQUAL TO PAYROLL DETAIL  *
          *          ACTIVITY CODE BYPASS DETAIL                *
          *                                                     *
          *******************************************************.

118140.
     IF EXCEPT-CODES EQUAL TO SPACES,
             GO TO 120110.
         MOVE 01 TO SUBS-1.
118180.
         IF DTL-ACTY EQUAL TO EXCEPT-TABLE (SUBS-1),
             MOVE "DETAIL WITH RUN EXCEPTION CODE" TO ERR-EXPLAIN,
                 GO TO 196160.
     IF SUBS-1 NOT EQUAL TO 24,
             ADD 01 TO SUBS-1,
                 GO TO 118180.

     NOTE *******************************************************
          *                                                     *
          *  MATCH PERSONNEL MASTER VS PAYROLL DETAIL           *
          *                                                     *
          *******************************************************.

120110.
     GO TO 120130.
120130.
     ALTER 120110 TO PROCEED TO 196010.
120150.
     MOVE SPACE TO SW1.
120170.
     IF EOF-MASTER, GO TO 196140.
     IF EOF-DETAIL, GO TO 236010.
         IF DTL-SEQ LESS THAN MSTR-OUT-SEQ,
             GO TO 196140.
         IF MSTR-OUT-SEQ LESS THAN DTL-SEQ,
             GO TO 236010.
     MOVE 01 TO SUBS-1.
     MOVE DTL-PAY-CODE (SUBS-1) TO WT-PAY-EXC-HOLD.

     NOTE *******************************************************
          *                                                     *
          *  PAYROLL DETAIL MATCHED TO PERSONNEL MASTER         *
          *      AUDIT PAYROLL CODES                            *
          *      EXECUTE SELECTED ROUTINES DEPENDING ON PAYROLL *
          *          DETAIL CODES                               *
          *                                                     *
          *******************************************************.

122130.
     MOVE 00 TO SUBS-1.
122150.
     ADD 01 TO SUBS-1.
     IF SUBS-1 GREATER THAN 05,
         OR DTL-PAY-CODE (SUBS-1) EQUAL TO SPACES,
             GO TO 200100.
     IF DTL-PAY-CODE (SUBS-1) IS EQUAL TO "ZZ" GO TO 192090.
     IF DTL-PAY-CODE (SUBS-1) GREATER THAN 09
         AND LESS THAN 66, GO TO 126010.
         MOVE 01 TO SUBS-2.
124020.
         IF     PAY-CODE (SUBS-1) EQUAL TO PAY-CODE-TBL (SUBS-2),
             GO TO 128010, 130160, 132080, 134140, 136050, 136170,
                   138110, 140060, 142060, 144010, 144140,
                   144160 144180 145020 145040 145060 145080
                   146020  146040
                 DEPENDING ON SUBS-2.
         IF SUBS-2 NOT EQUAL TO 19
                 ADD 01 TO SUBS-2,
                     GO TO 124020.
124112.
         MOVE "INCORRECT PAY CODE" TO ERR-EXPLAIN.
124122.
         ALTER 198140 TO PROCEED TO 122150.
             GO TO 198160.

     NOTE *******************************************************
          *                                                     *
          *  PAYROLL NUMERIC CODES 10 THROUGH 50                *
          *                                                     *
          *******************************************************.

126010.
         SUBTRACT 09 FROM DTL-PAY-NUM (SUBS-1), GIVING WORK-CODE.
         GO TO 146070, 148010, 148120, 150010, 150150, 152090,
               154030, 154130, 156062, 156200, 158130, 160030,
               160160, 162060, 162180, 164080, 164200, 166100,
               168010, 168110, 170030, 170130, 172050, 172150,
               174050, 174150, 176070, 176170, 178070, 178170,
               180090, 180190, 182110, 184010, 184110, 186090,
               186190, 188130, 190010, 190170, 192090,
           192351, 192352, 192353, 192354, 192355, 192356,
           192357, 192358, 192359, 192360, 192361, 192362,
           192363, 192364, 192365,
             DEPENDING ON WORK-CODE.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE S                         *
          *  NIGHT PAY FOR SECOND SHIFT                         *
          *          PAYROLL CODE WEEK INDICATOR MUST BE 1 OR 2 *
          *                                                     *
          *******************************************************.

128010.
     MOVE 01 TO SUBS-2.
128014.
     IF ANNUM-MSTR,
         MULTIPLY MSTR-HOURLY-RATE BY +.10,
             GIVING HRLY-RATE-WORK, ROUNDED,
         MULTIPLY DTL-HOURS BY HRLY-RATE-WORK, ROUNDED,
         ADD HRLY-RATE-WORK TO SAVE-NITE-PAY,
             GO TO 128100.
128072.
     IF PAY-CODE-WEEK (SUBS-1) NOT EQUAL TO "1",
         AND PAY-CODE-WEEK (SUBS-1) NOT EQUAL TO "2",
             MOVE SPACE TO SW4,
                 GO TO 124112.
         MOVE PAY-CODE-WEEK (SUBS-1) TO SAVE-NITE-WEEK.
         IF NOT OVERTIME  ADD DTL-HOURS TO CAT-C-HOURS.
         IF THIRD-SHIFT,
             MOVE SPACE TO SW4,
             ADD SHIFT-3 TO DIEM-NITE-PAY,
             GO TO 128140.
     ADD SHIFT-2 TO DIEM-NITE-PAY.
     GO TO 128180.
128100.
     IF NOT OVERTIME
         ADD DTL-HOURS TO CAT-C-HOURS,
         ADD HRLY-RATE-WORK TO CAT-C-MONEY.
     GO TO 128200.
128140.
     IF NOT OVERTIME
         MOVE ZEROS TO CAT-WORK
         MULTIPLY DTL-HOURS BY SHIFT-3 GIVING CAT-WORK, ROUNDED,
         ADD CAT-WORK TO CAT-C-MONEY.
     GO TO 128200.
128180.
     IF NOT OVERTIME
         MOVE ZEROS TO CAT-WORK
         MULTIPLY DTL-HOURS BY SHIFT-2 GIVING CAT-WORK, ROUNDED,
         ADD CAT-WORK TO CAT-C-MONEY.
     GO TO 128200.
128200.
         ADD DTL-HOURS TO EXC-LIST-TOT (SUBS-2).
130020.
         MOVE "1" TO SW6.
130040.
     MOVE "1" TO SW5.
         GO TO 122150.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE T                         *
          *  NIGHT PAY FOR THIRD SHIFT                          *
          *                                                     *
          *******************************************************.

130160.
     MOVE 02 TO SUBS-2.
     IF ANNUM-MSTR, GO TO 128014.
         MOVE "1" TO SW4.
             GO TO 128072.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE A                         *
          *                                                     *
          *******************************************************.

132080.
     MOVE 03 TO SUBS-2.
132100.
     IF ANNUM-MSTR, GO TO 124112.
     IF PAY-CODE-WEEK (SUBS-1) EQUAL TO 1, GO TO 133000.
     IF PAY-CODE-WEEK (SUBS-1) EQUAL TO 2, GO TO 133000.
     MOVE SPACE TO SW7.
     MOVE SPACE TO SW8.
     GO TO 124112.
133000.
     MOVE PAY-CODE-WEEK (SUBS-1) TO SAVE-BONUS-WEEK.
     IF CODE-B-BONUS,
         MOVE SPACE TO SW7,
         ADD DTL-HOURS TO CAT-C-HOURS
         MOVE ZEROS TO CAT-WORK,
         MULTIPLY DTL-HOURS BY DIFF-B GIVING CAT-WORK, ROUNDED,
         ADD CAT-WORK TO CAT-C-MONEY
         ADD DIFF-B TO DIEM-BONUS-PAY, CODE-B-PAY,
             GO TO 128200.
     IF WHARF-BUILDER,
         MOVE SPACE TO SW8,
         ADD DTL-HOURS TO CAT-C-HOURS
         MOVE ZEROS TO CAT-WORK,
         MULTIPLY DTL-HOURS BY WHARF-DIFF GIVING CAT-WORK ROUNDED
         ADD CAT-WORK TO CAT-C-MONEY
         ADD WHARF-DIFF TO DIEM-BONUS-PAY,
             GO TO 128200.
     ADD DIFF-A TO DIEM-BONUS-PAY, CODE-A-PAY,
         ADD DTL-HOURS TO CAT-C-HOURS
         MOVE ZEROS TO CAT-WORK,
         MULTIPLY DTL-HOURS BY DIFF-A GIVING CAT-WORK, ROUNDED,
         ADD CAT-WORK TO CAT-C-MONEY
         GO TO 128200.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE B                         *
          *                                                     *
          *******************************************************.

134140.
     MOVE 04 TO SUBS-2.
     MOVE "1" TO SW7.
         GO TO 132100.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE W                         *
          *              WHARF  BUILDER                         *
          *                                                     *
          *******************************************************.

136050.
     MOVE 28 TO SUBS-2.
     MOVE "1" TO SW8.
         GO TO 132100.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE E                         *
          *  DIVER PAY, REPLACES ANY REGULAR HOURLY RATE        *
          *                                                     *
          *******************************************************.

136170.
     IF ANNUM-MSTR,
         OR (PAY-CODE-WEEK (SUBS-1) NOT EQUAL TO "1",
             AND PAY-CODE-WEEK (SUBS-1) NOT EQUAL TO "2" ),
                 GO TO 124112.
     MOVE PAY-CODE-WEEK (SUBS-1) TO SAVE-DIVER-WEEK.
     MOVE 05 TO SUBS-2.
     MOVE "1" TO SW9.
         GO TO 128200.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE P                         *
          *                                                     *
          *******************************************************.

138110.
     IF PAY-CODE-WEEK (SUBS-1) NOT EQUAL TO "1",
         AND PAY-CODE-WEEK (SUBS-1) NOT EQUAL TO "2",
             GO TO 124112.
     MOVE PAY-CODE-WEEK (SUBS-1) TO SAVE-SUNDAY-WEEK.
     MOVE 27 TO SUBS-2.
     MOVE "1" TO SW32.
         GO TO 128200.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE C                         *
          *  OVERTIME ROUTINE                                   *
          *      SPLIT HOURS BY WEEK INDICATOR FOR WEEK 1 AND 2 *
          *                                                     *
          *******************************************************.

140060.
     IF PAY-CODE-WEEK (SUBS-1) EQUAL TO "1",
         ADD DTL-HOURS TO OT-HRS-WK1,
             GO TO 140140.
     IF PAY-CODE-WEEK (SUBS-1) EQUAL TO "2",
         ADD DTL-HOURS TO OT-HRS-WK2,
             GO TO 140140.
         GO TO 124112.
140140.
     MOVE PAY-CODE-WEEK (SUBS-1) TO SAVE-OT-WEEK.
     MOVE "1" TO SW10, SW6.
         GO TO 122150.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE G                         *
          *  LWOP ROUTINE                                       *
          *      SAVE LWOP HOURS ACCORDING TO WEEK INDICATOR    *
          *                                                     *
          *******************************************************.

142060.
     MOVE "F" TO WORK-OTH-PAY-CODE.
     IF PAY-CODE-WEEK (SUBS-1) EQUAL TO "1",
         ADD DTL-HOURS TO LWOP-WK1,
             GO TO 122150.
     IF PAY-CODE-WEEK (SUBS-1) EQUAL TO "2",
         ADD DTL-HOURS TO LWOP-WK2,
             GO TO 122150.
         GO TO 124112.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE F                         *
          *  HOLIDAY WORKED AND PAID                            *
          *                                                     *
          *******************************************************.

144010.
     MOVE 06 TO SUBS-2.
     MOVE "1" TO SW11.
144032.
     ADD DTL-HOURS TO OTHER-HOURS.
         GO TO 128200.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE H                         *
          *  HOLIDAY INCLUDED IN ANNUAL LEAVE PAYOFF            *
          *      INCREASE OTHER HOURS FOR EACH INCLUDED HOLIDAY *
          *                                                     *
          *******************************************************.

144140.
     MOVE 21 TO SUBS-2.
     MOVE "1" TO SW12.
     GO TO 144032.
     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE L                         *
          *  NITE PAY FOR SECOND SHIFT WHEN WORKING OVERTIME    *
          *                                                     *
          *******************************************************.

144160.
     IF ANNUM-MSTR GO TO 124112.
     IF PAY-CODE-WEEK (SUBS-1) EQUALS 1 OR 2 GO TO 144165.
     GO TO 124112.
144165.
     MULTIPLY DTL-HOURS BY SHIFT-2 GIVING HRLY-RATE-WORK ROUNDED.
     MOVE 38 TO SUBS-2.
     MOVE 1 TO SW51.
144170.
     ADD HRLY-RATE-WORK TO OT-MONEY.
     MOVE +00000.00 TO HRLY-RATE-WORK.
     GO TO 128200.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE M                         *
          *   NITE PAY FOR THIRD SHIFT WHEN WORKING OVERTIME    *
          *                                                     *
          *******************************************************.

144180.
     IF ANNUM-MSTR GO TO 124112.
     IF PAY-CODE-WEEK (SUBS-1) EQUALS 1 OR 2 GO TO 144185.
     GO TO 124112.
144185.
     MULTIPLY DTL-HOURS BY SHIFT-3 GIVING HRLY-RATE-WORK ROUNDED.
     MOVE 39 TO SUBS-2.
     MOVE 1 TO SW52.
     GO TO 144170.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE J                         *
          *     CODE J BONUS PAY                                *
          *                                                     *
          *******************************************************.

145020.
     MOVE 42 TO SUBS-2.
145030.
     IF ANNUM-MSTR GO TO 124112.
     IF PAY-CODE-WEEK (SUBS-1) EQUAL TO 1 GO TO 145035.
     IF PAY-CODE-WEEK (SUBS-1) EQUAL TO 2 GO TO 145035.
     MOVE SPACE TO SW53 SW54 SW55.
     GO TO 124112.
145035.
     MOVE PAY-CODE-WEEK (SUBS-1) TO SAVE-BONUS-WEEK.
     IF CODE-K-BONUS
         MOVE SPACE TO SW53
         ADD DTL-HOURS TO CAT-C-HOURS
         MULTIPLY DTL-HOURS BY DIFF-K GIVING CAT-WORK ROUNDED
         ADD CAT-WORK TO CAT-C-MONEY
         ADD DIFF-K TO DIEM-BONUS-PAY
         GO TO 128200.
     IF CODE-N-BONUS
         MOVE SPACE TO SW54
         ADD DTL-HOURS TO CAT-C-HOURS
         MULTIPLY DTL-HOURS BY DIFF-N GIVING CAT-WORK ROUNDED
         ADD CAT-WORK TO CAT-C-MONEY
         ADD DIFF-N TO DIEM-BONUS-PAY
         GO TO 128200.
     IF CODE-R-BONUS
         MOVE SPACE TO SW55
         ADD DTL-HOURS TO CAT-C-HOURS
         MULTIPLY DTL-HOURS BY DIFF-R GIVING CAT-WORK ROUNDED
         ADD CAT-WORK TO CAT-C-MONEY
         ADD DIFF-R TO DIEM-BONUS-PAY
         GO TO 128200.
     ADD DTL-HOURS TO CAT-C-HOURS
         MULTIPLY DTL-HOURS BY DIFF-J GIVING CAT-WORK ROUNDED
         ADD CAT-WORK TO CAT-C-MONEY
         ADD DIFF-J TO DIEM-BONUS-PAY
         GO TO 128200.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE K                         *
          *        CODE K BONUS PAY                             *
          *                                                     *
          *******************************************************.

145040.
     MOVE 43 TO SUBS-2.
     MOVE 1 TO SW53.
     GO TO 145030.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE N                         *
          *        CODE N BONUS PAY                             *
          *                                                     *
          *******************************************************.

145060.
     MOVE 44 TO SUBS-2.
     MOVE 1 TO SW54.
     GO TO 145030.
     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE R                         *
          *        CODE R BONUS PAY                             *
          *                                                     *
          *******************************************************.

145080.
     MOVE 45 TO SUBS-2.
     MOVE 1 TO SW55.
     GO TO 145030.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE X                         *
          *   CODE A BONUS WHEN WORKING OVERTIME                *
          *                                                     *
          *******************************************************.

146020.
     MOVE 46 TO SUBS-2.
146025.
     IF ANNUM-MSTR GO TO 124112.
     IF PAY-CODE-WEEK (SUBS-1) EQUALS 1 OR 2 GO TO 146030.
     MOVE SPACE TO SW56.
     GO TO 124112.
146030.
     IF CODE-B-OT
         MOVE SPACE TO SW56
         MULTIPLY DTL-HOURS BY DIFF-B GIVING HRLY-RATE-WORK
             ROUNDED
         GO TO 146035.
     MULTIPLY DTL-HOURS BY DIFF-A GIVING HRLY-RATE-WORK ROUNDED.
146035.
     MULTIPLY +1.5 BY HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO OT-MONEY.
     MOVE +00000.00 TO HRLY-RATE-WORK.
     GO TO 128200.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE Y                         *
          *   CODE B BONUS WHEN WORKING OVERTIME                *
          *                                                     *
          *******************************************************.

146040.
     MOVE 47 TO SUBS-2.
     MOVE 1 TO SW56
     GO TO 146025.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 10                        *
          *           SPECIAL TAX ADJUSTMENT                    *
          *           20% GROSS FEDERAL TAX                     *
          *           3% GROSS CALIF STATE TAX                  *
          *                                                     *
          *******************************************************.

146070.
     MOVE 1 TO SW57.
     MOVE CODE10-MSG TO ERR-EXPLAIN.
     MOVE 1 TO SW31.
     GO TO 124122.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 11                        *
          *  CANCEL LIFE INSURANCE AND LIFE INSURANCE OPTION    *
          *      DEDUCTIONS FOR CURRENT PAY PERIOD              *
          *                                                     *
          *******************************************************.

148010.
     MOVE "1" TO SW13.
         GO TO 122150.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 12                        *
          *  CANCEL HEALTH INSURANCE DEDUCTION FOR CURRENT      *
          *      PAY PERIOD                                     *
          *                                                     *
          *******************************************************.

148120.
     MOVE "1" TO SW14.
         GO TO 122150.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 13                        *
          *  TAX LEVY DEDUCTION                                 *
          *                                                     *
          *******************************************************.

150010.
     MOVE DTL-AMOUNT TO TAX-LEVY-DED.
     MOVE "1" TO SW15.
     MOVE 22 TO SUBS-2.
150050.
     ADD DTL-AMOUNT TO EXC-LIST-TOT (SUBS-2).
         GO TO 130040.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 14                        *
          *  RETROACTIVE REGULAR HOURS                          *
          *                                                     *
          *******************************************************.

150150.
     ADD DTL-HOURS TO ADJ-REG-HRS.
     MOVE "1" TO SW16.
     MOVE 20 TO SUBS-2.
         GO TO 128200.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 15                        *
          *  80TH HOUR WITH ADDED PAY                           *
          *      INCREASE LIFE INSURANCE DEDUCTION IF PER DIEM  *
          *      IF NOT INSURED, BYPASS CODE                    *
          *                                                     *
          *******************************************************.

152090.
     IF ANNUM-MSTR,
         GO TO 124112.
     IF LIFE-INSUR-MSTR,
         ADD +.28 TO ADJ-LIFE-INS
         MOVE 1 TO SW23.
             GO TO 122150.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 16                        *
          *  PAID BY VOUCHER                                    *
          *      NO CHECK NUMBER                                *
          *                                                     *
          *******************************************************.

154030.
     MOVE "1" TO SW18.
     ADD DTL-AMOUNT TO VOUCHER-PAID.
         GO TO 122150.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 17                        *
          *  PLUS SUBJECT MONEY ADJUSTMENT ROUTINE              *
          *                                                     *
          *******************************************************.

154130.
     MOVE 07 TO SUBS-2.
     ADD DTL-AMOUNT TO ADJ-WK-SUB.
         GO TO 150050.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 18                        *
          *  MINUS SUBJECT MONEY ADJUSTMENT ROUTINE             *
          *                                                     *
          *******************************************************.

156062.
     ALTER 156110 TO PROCEED TO 154130.
156080.
     MULTIPLY -1.0 BY DTL-HOURS.
     MULTIPLY -1.00 BY DTL-AMOUNT.
156110.
     GO TO 154130.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 19                        *
          *  PLUS REGULAR MONEY ADJUSTMENT ROUTINE              *
          *                                                     *
          *******************************************************.

156200.
     MOVE 08 TO SUBS-2.
     ADD DTL-AMOUNT TO ADJ-REG-MONEY, CAT-A-MONEY.
     ADD DTL-HOURS TO ADJ-REG-HRS, CAT-A-HOURS.
         GO TO 150050.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 20                        *
          *  MINUS REGUALAR MONEY ADJUSTMENT ROUTINE            *
          *                                                     *
          *******************************************************.

158130.
     ALTER 156110 TO PROCEED TO 156200.
         GO TO 156080.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 21                        *
          *  PLUS OTHER MONEY ADJUSTMENT ROUTINE                *
          *                                                     *
          *******************************************************.

160030.
     MOVE 09 TO SUBS-2.
     ADD DTL-AMOUNT TO ADJ-OTHER-MONEY.
     IF MSTR-OTHER-PAY-CODE EQUALS "P" OR "S"
         ADD DTL-AMOUNT TO CAT-H-MONEY GO TO 160035.
     IF MSTR-OTHER-PAY-CODE EQUALS "A" OR "Q"
         ADD DTL-AMOUNT TO CAT-L-MONEY GO TO 160035.
     ADD DTL-AMOUNT TO CAT-C-MONEY.
     ADD DTL-HOURS TO CAT-C-HOURS.
160035.
     ADD DTL-HOURS TO OTHER-HOURS.
         GO TO 150050.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 22                        *
          *  MINUS OTHER MONEY ADJUSTMENT ROUTINE               *
          *                                                     *
          *******************************************************.

160160.
     ALTER 156110 TO PROCEED TO 160030.
         GO TO 156080.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 23                        *
          *  PLUS OVERTIME MONEY ADJUSTMENT ROUTINE             *
          *                                                     *
          *******************************************************.

162060.
     MOVE 10 TO SUBS-2.
     ADD DTL-AMOUNT TO ADJ-OT-MONEY.
     ADD DTL-HOURS TO ADJ-OT-HOURS.
         GO TO 150050.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 24                        *
          *  MINUS OVERTIME MONEY ADJUSTMENT ROUTINE            *
          *                                                     *
          *******************************************************.

162180.
     ALTER 156110 TO PROCEED TO 162060.
         GO TO 156080.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 25                        *
          *  PLUS CSRA DEDUCTION ADJUSTMENT ROUTINE             *
          *                                                     *
          *******************************************************.

164080.
     MOVE 11 TO SUBS-2.
     MOVE "1" TO SW19.
164102.
     ADD  DTL-AMOUNT TO ADJ-RETIRE.
         GO TO 150050.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 26                        *
          *  MINUS CSRA DEDUCTION ROUTINE                       *
          *                                                     *
          *******************************************************.

164200.
     ALTER 156110 TO PROCEED TO 164080.
         GO TO 156080.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 27                        *
          *  PLUS FICA DEDUCTION ADJUSTMENT ROUTINE             *
          *                                                     *
          *******************************************************.

166100.
     MOVE 12 TO SUBS-2.
     MOVE "1" TO SW20.
         GO TO 164102.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 28                        *
          *  MINUS FICA DEDUCTION ADJUSTMENT ROUTINE            *
          *                                                     *
          *******************************************************.

168010.
     ALTER 156110 TO PROCEED TO 166100.
         GO TO 156080.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 29                        *
          *  PLUS TAX DEDUCTION ADJUSTMENT ROUTINE              *
          *                                                     *
          *******************************************************.

168110.
     MOVE 14 TO SUBS-2.
     MOVE "1" TO SW21.
     ADD  DTL-AMOUNT TO ADJ-TAXES.
         GO TO 150050.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 30                        *
          *  MINUS TAX DEDUCTION ADJUSTMENT ROUTINE             *
          *                                                     *
          *******************************************************.

170030.
     ALTER 156110 TO PROCEED TO 168110.
         GO TO 156080.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 31                        *
          *  PLUS HEALTH INSURANCE DEDUCTION ADJUSTMENT ROUTINE *
          *                                                     *
          *******************************************************.

170130.
     MOVE 13 TO SUBS-2.
     ADD  DTL-AMOUNT TO ADJ-HEALTH-DED.
     MOVE "1" TO SW22.
         GO TO 150050.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 32                        *
          *  MINUS HEALTH INSURANCE DEDUCTION ADJUST ROUTINE    *
          *                                                     *
          *******************************************************.

172050.
     ALTER 156110 TO PROCEED TO 170130.
         GO TO 156080.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 33                        *
          *  PLUS HEALTH INSURANCE CONTRIB ADJUSTMENT ROUTINE   *
          *                                                     *
          *******************************************************.

172150.
     ADD  DTL-AMOUNT TO ADJ-HEALTH-CON.
     MOVE "1" TO SW22.
         GO TO 122150.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 34                        *
          *  MINUS HEALTH INSURANCE CONTRIB ADJUSTMENT ROUTINE  *
          *                                                     *
          *******************************************************.

174050.
     ALTER 156110 TO PROCEED TO 172150.
         GO TO 156080.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 35                        *
          *  PLUS LIFE INSURANCE DEDUCTION ADJUSTMENT ROUTINE   *
          *                                                     *
          *******************************************************.

174150.
     ADD  DTL-AMOUNT TO ADJ-LIFE-INS.
     MOVE "1" TO SW23.
174182.
     MOVE 15 TO SUBS-2.
         GO TO 150050.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 36                        *
          *  MINUS LIFE INSURANCE DEDUCTION ADJUSTMENT ROUTINE  *
          *                                                     *
          *******************************************************.

176070.
     ALTER 156110 TO PROCEED TO 174150.
         GO TO 156080.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 37                        *
          *  PLUS LIFE INSURANCE OPTION DEDUCT ADJUST ROUTINE   *
          *                                                     *
          *******************************************************.

176170.
     ADD  DTL-AMOUNT TO ADJ-LIFE-OPT.
     MOVE "1" TO SW24.
         GO TO 174182.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 38                        *
          *  MINUS LIFE INSURANCE OPTION DEDUCT ADJUST ROUTINE  *
          *                                                     *
          *******************************************************.

178070.
     ALTER 156110 TO PROCEED TO 176170.
         GO TO 156080.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 39                        *
          *  PLUS STATE TAXES ADJUSTMENT ROUTINE                *
          *                                                     *
          *******************************************************.

178170.
     MOVE 16 TO SUBS-2.
     ADD  DTL-AMOUNT TO ADJ-STATE.
     MOVE "1" TO SW25.
         GO TO 150050.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 40                        *
          *  MINUS STATE TAXES ADJUSTMENT ROUTINE               *
          *                                                     *
          *******************************************************.

180090.
     ALTER 156110 TO PROCEED TO 178170.
         GO TO 156080.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 41                        *
          *  PLUS UNION DUES DEDUCTION ADJUSTMENT ROUTINE       *
          *                                                     *
          *******************************************************.

180190.
     MOVE 17 TO SUBS-2.
     ADD  DTL-AMOUNT TO ADJ-UNION.
     MOVE "1" TO SW26.
         GO TO 150050.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 42                        *
          *  MINUS UNION DUES DEDUCTION ADJUSTMENT ROUTINE      *
          *                                                     *
          *******************************************************.

182110.
     ALTER 156110 TO PROCEED TO 180190.
         GO TO 156080.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 43                        *
          *  PLUS GOVERNMENT INDEBTED TOTAL ADJUSTMENT ROUTINE  *
          *                                                     *
          *******************************************************.

184010.
     ADD DTL-AMOUNT TO MSTR-YTD-GOV-INDEBT.
         GO TO 122150.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 44                        *
          *  MINUS GOVERNMENT INDEBTED TOTAL ADJUSTMENT ROUTINE *
          *                                                     *
          *******************************************************.

184110.
     SUBTRACT DTL-AMOUNT FROM MSTR-YTD-GOV-INDEBT.
     IF MSTR-YTD-GOV-INDEBT POSITIVE,
         GO TO 122150.
     MOVE MSTR-YTD-GOV-INDEBT TO MSG2-AMT.
     MOVE +0000.00 TO MSTR-YTD-GOV-INDEBT.
     MOVE "INDEBTED" TO MSG2-KON.
184180.
     MOVE +000.00 TO MSTR-YTD-GOV-PAY.
     MOVE MESSAGE2 TO ERR-EXPLAIN.
         GO TO 124122.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 45                        *
          *  PLUS GOVERNMENT PAYMENT ADJUSTMENT ROUTINE         *
          *                                                     *
          *******************************************************.

186090.
     ADD DTL-AMOUNT TO MSTR-YTD-GOV-PAY.
         GO TO 122150.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 46                        *
          *  MINUS GOVERNMENT PAYMENT ADJUSTMENT ROUTINE        *
          *                                                     *
          *******************************************************.

186190.
     SUBTRACT DTL-AMOUNT FROM MSTR-YTD-GOV-PAY.
     IF MSTR-YTD-GOV-PAY POSITIVE,
         GO TO 122150.
     MOVE "PAYMENTS" TO MSG2-KON.
     MOVE MSTR-YTD-GOV-PAY TO MSG2-AMT.
         GO TO 184180.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 47                        *
          *  CANCEL BOND DEDUCTION FOR CURRENT PAY PERIOD       *
          *                                                     *
          *******************************************************.

188130.
     MOVE "1" TO SW27.
         GO TO 122150.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 48                        *
          *  DECEASED ANNUAL LEAVE PAYOFF                       *
          *      INACTIVATE PERSONNEL MASTER RECORD             *
          *                                                     *
          *******************************************************.

190010.
     MOVE "1" TO SW28.
     MOVE 19 TO SUBS-2.
190040.
     ADD DTL-HOURS TO OTHER-HOURS.
     MOVE "1" TO MSTR-ACTIVE-CODE.
     MOVE "1" TO SW29.
         GO TO 128200.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 49                        *
          *  TERMINAL ANNUAL LEAVE PAYOFF                       *
          *      INACTIVATE PERSONNEL MASTER RECORD             *
          *                                                     *
          *******************************************************.

190170.
     MOVE 18 TO SUBS-2.
         GO TO 190040.

     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE ZZ                        *
          *  CASH AWARD                                         *
          *      MAXIMUM OF 4 CASH AWARDS PER PERSON            *
          *                                                     *
          *******************************************************.

192090.
     MOVE 23 TO CASH-AWARD-SUBS.
     ADD DTL-AMOUNT TO EXC-LIST-TOT (CASH-AWARD-SUBS).
     ADD DTL-AMOUNT TO SAVE-PAYOFF.
     MOVE "1" TO SW5, SW30.
         GO TO 226090.

192351.
     MOVE 29 TO SUBS-2.
     ADD DTL-AMOUNT TO ADJ-CHARITY.
     MOVE 1 TO SW40.
     GO TO 150050.
192352.
     ALTER 156110 TO PROCEED TO 192351.
     GO TO 156080.
192353.
     MOVE 30 TO SUBS-2.
     ADD DTL-AMOUNT TO ADJ-TO-BONDS.
     MOVE 1 TO SW41.
     GO TO 150050.
192354.
     ALTER 156110 TO PROCEED TO 192353.
     GO TO 156080.
     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 55                        *
          *         RETROACTIVE OVERTIME MONEY                  *
          *                                                     *
          *******************************************************.
192355.
     MOVE 31 TO SUBS-2.
     ADD DTL-AMOUNT TO ADJ-OT-MONEY, CAT-K-MONEY.
     ADD DTL-HOURS TO ADJ-OT-HOURS.
     MOVE DTL-HOURS TO WT-RETRO-OTHRS.
     MOVE DTL-AMOUNT TO WT-RETRO-OTPAY.
     MOVE 1 TO SW42.
     GO TO 150050.
     NOTE *******************************************************
          *                                                     *
          *              PAYROLL CODE 56                        *
          *         RETROACTIVE OTHER MONEY                     *
          *                                                     *
          *******************************************************.
192356.
     MOVE 37 TO SUBS-2.
     ADD DTL-AMOUNT TO ADJ-OTHER-MONEY, CAT-K-MONEY.
     ADD DTL-HOURS TO OTHER-HOURS.
     MOVE 1 TO SW48.
     GO TO 150050.
192357.
     MOVE 32 TO SUBS-2.
     ADD DTL-AMOUNT TO ADJ-TO-ALLOT1.
     MOVE 1 TO SW43.
     GO TO 150050.
192358.
     ALTER 156110 TO PROCEED TO 192357.
     GO TO 156080.
192359.
     MOVE 33 TO SUBS-2.
     ADD DTL-AMOUNT TO ADJ-TO-ALLOT2.
     MOVE 1 TO SW44.
     GO TO 150050.
192360.
     ALTER 156110 TO PROCEED TO 192359.
     GO TO 156080.
192361.
     MOVE 34 TO SUBS-2.
     ADD DTL-AMOUNT TO ADJ-TO-OTH-DED.
     MOVE 1 TO SW45.
     GO TO 150050.
192362.
     ALTER 156110 TO PROCEED TO 192361.
     GO TO 156080.
192363.
     MOVE 35 TO SUBS-2.
     ADD DTL-AMOUNT TO NET-PAY-ADJ.
     MOVE 1 TO SW46.
     GO TO 150050.
192364.
     ALTER 156110 TO PROCEED TO 192363.
     GO TO 156080.
192365.
     MOVE 36 TO SUBS-2.
     ADD DTL-AMOUNT TO NOT-SUBJ-FED-TAX, MSTR-YTD-NSFT.
     MOVE 1 TO SW47.
     GO TO 150050.
     NOTE *******************************************************
          *                                                     *
          *  EQUAL PAYROLL EXCEPTION DETAIL                     *
          *      CHECK FOR PREVIOUS DETAIL ERROR OR             *
          *      MORE CASH AWARDS                               *
          *                                                     *
          *******************************************************.

194010.
     IF DTL-ERROR, GO TO 198082.
     IF NOT WRITE-CASH-AWARD, GO TO 122130.
         IF DTL-PAY-CODE (01) NOT EQUAL TO "ZZ",
             OR CASH-AWARD-SUBS EQUAL TO 27,
                 MOVE "INCORRECT PAY CODE" TO ERR-EXPLAIN,
                     GO TO 196180.
         MOVE "1" TO SW30.
         ADD 01 TO CASH-AWARD-SUBS.
         ADD DTL-AMOUNT TO EXC-LIST-TOT (CASH-AWARD-SUBS).
         ADD DTL-AMOUNT TO SAVE-PAYOFF.
             GO TO 276040.

     NOTE *******************************************************
          *                                                     *
          *  PAYROLL EXCEPTION DETAIL SEQUENCE CONTROL BREAK    *
          *      IF PREVIOUS DETAIL ERROR GO TO MATCH ROUTINE   *
          *      IF PREVIOUS DETAIL CASH AWARD GO TO            *
          *          PROCESS CASH AWARD                         *
          *                                                     *
          *******************************************************.

196010.
     IF DTL-ERROR, GO TO 120150.
     IF WRITE-CASH-AWARD,
             GO TO 276040.
     GO TO 226090.

     NOTE *******************************************************
          *                                                     *
          *  PAYROLL ERROR OR NOTIFICATION MESSAGE ROUTINE      *
          *                                                     *
          *******************************************************.

196140.
     MOVE "UNMATCHED DETAIL" TO ERR-EXPLAIN.
196160.
     MOVE "1" TO SW1.
196180.
     ALTER 198140 TO PROCEED TO 116140.
     MOVE DTL-ACTY TO ERR-ACTIVITY.
     MOVE DTL-CNTL-GRP TO ERR-CONTROL-GRP.
     MOVE DTL-BADGE TO ERR-BADGE.
         ADD +1 TO ERR-DET-OUT.
198050.
     WRITE CONTROL-REC AFTER ADVANCING 2 LINES.
         MOVE SPACES TO CONTROL-REC.
     IF NOT-DTL-ERROR, GO TO 198120.
198082.
         MOVE "1" TO SW31.
         MOVE PAYROLL-DETAIL-REC TO ERR-DETAIL.
           ADD +1 TO ERR-DET-OUT.
             GO TO 198050.
198120.
     MOVE SPACE TO SW31.
198140.
         GO TO 116140.
198160.
     MOVE MSTR-BADGE TO ERR-BADGE.
     MOVE MSTR-NAME TO ERR-NAME.
     MOVE MSTR-ACTY TO ERR-ACTIVITY.
     MOVE MSTR-CONT-GRP TO ERR-CONTROL-GRP.
199900.
         ADD +1 TO ERR-DET-OUT.
             GO TO 198050.

     NOTE *******************************************************
          *                                                     *
          *  ALL PAYROLL CODES PROCESSED FROM PAYROLL EXCEPTION *
          *      DETAIL MATCHED TO PERSONNEL MASTER             *
          *          TEST FOR EXCEPTION PAY TO BE COMPUTED      *
          *                                                     *
          *******************************************************.

200100.
     IF NOT EXCEPT-TO-COMPUTE,
         ADD SAVE-NITE-PAY TO OTHER-MONEY,
         MOVE +00000.00 TO SAVE-NITE-PAY,
             GO TO 116140.
     MOVE SPACE TO SW6.
     IF SAVE-NITE-PAY ZERO,
             GO TO 202120.
         IF DIEM-MSTR, GO TO 202010.
         IF ANNUAL-PAYOFF, OR HOLIDAY-PAYOFF,
             ADD SAVE-NITE-PAY TO SAVE-PAYOFF.
         IF OVERTIME,
             ADD SAVE-NITE-PAY TO OT-MONEY,
                 GO TO 202030.
202010.
         ADD SAVE-NITE-PAY TO OTHER-MONEY.
202030.
         MOVE +00000.00 TO SAVE-NITE-PAY.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTE OTHER THAN NORMAL HOURS AND EXCEPTION PAY  *
          *                                                     *
          *******************************************************.

202120.
     IF OVERTIME,
         GO TO 212170.
     IF ANNUAL-PAYOFF,
         GO TO 214130.
     IF RETRO-HOURS,
         GO TO 218040.
     IF HOLIDAY-PAYOFF,
             GO TO 214130.
     IF HOLIDAY-WORKED,
         GO TO 220100.
204052.
     IF DIVER-PAY,
         GO TO 222060.
     IF SUNDAY-PREMIUM,
         GO TO 224070.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTE AND POST PER DIEM NIGHT PAY                *
          *                                                     *
          *******************************************************.

204170.
     IF DIEM-NITE-PAY ZERO,
         GO TO 208060.
     MULTIPLY DTL-HOURS BY DIEM-NITE-PAY ROUNDED.
     IF OVERTIME,
         ADD DIEM-NITE-PAY TO OT-MONEY,
             GO TO 208060.
     IF ANNUAL-PAYOFF,
         ADD DIEM-NITE-PAY TO SAVE-PAYOFF,
         GO TO 206100.
     IF HOLIDAY-WORKED,
         GO TO 206140.
     IF HOLIDAY-PAYOFF, ADD DIEM-NITE-PAY TO SAVE-PAYOFF.
     IF RETRO-HOURS,
         ADD DIEM-NITE-PAY TO ADJ-WK-SUB,
             GO TO 206100.
     IF SAVE-NITE-WEEK EQUAL TO "2",
         ADD DIEM-NITE-PAY TO WK2-SUBJECT,
             GO TO 206100.
         ADD DIEM-NITE-PAY TO WK1-SUBJECT.
206100.
     IF MSTR-NITE-CODE NOT EQUAL TO SPACE,
         ADD DIEM-NITE-PAY TO REG-MONEY,
             GO TO 208060.
206140.
         ADD DIEM-NITE-PAY TO OTHER-MONEY.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTE AND POST PER DIEM BONUS PAY                *
          *                                                     *
          *******************************************************.

208060.
     IF DIEM-BONUS-PAY ZERO,
         GO TO 210010.
     MULTIPLY DTL-HOURS BY DIEM-BONUS-PAY ROUNDED.
     IF ANNUAL-PAYOFF,
         ADD DIEM-BONUS-PAY TO SAVE-PAYOFF,
             GO TO 208190.
     IF HOLIDAY-WORKED,
         GO TO 208190.
     IF HOLIDAY-PAYOFF, ADD DIEM-BONUS-PAY TO SAVE-PAYOFF.
     IF RETRO-HOURS,
         ADD DIEM-BONUS-PAY TO ADJ-WK-SUB,
             GO TO 208190.
     IF SAVE-BONUS-WEEK EQUAL TO "2",
         ADD DIEM-BONUS-PAY TO WK2-SUBJECT,
             GO TO 208190.
         ADD DIEM-BONUS-PAY TO WK1-SUBJECT.
208190.
     ADD DIEM-BONUS-PAY TO OTHER-MONEY.
210010.
     MOVE +00000.00 TO DIEM-NITE-PAY, DIEM-BONUS-PAY.
210030.
     MOVE SPACE TO SW17, SW10, SW29, SW16, SW11, SW9, SW32, SW12.
         GO TO 116140.

     NOTE *******************************************************
          *                                                     *
          *  PER DIEM OVERTIME TO BE COMPUTED                   *
          *      TEST FOR OVERTIME AT DIVER RATE                *
          *          SAVE DIVER RATE HOURS BY WEEK INDICATOR    *
          *                                                     *
          *******************************************************.

212170.
     MOVE SPACE TO SW32.
     IF NOT DIVER-PAY,
         GO TO 204170.
     IF SAVE-OT-WEEK EQUAL TO "1",
         ADD DTL-HOURS TO DIVER-OT-HR1,
             GO TO 204170.
         ADD DTL-HOURS TO DIVER-OT-HR2.
             GO TO 204170.

     NOTE *******************************************************
          *                                                     *
          *  DECEASED OR TERMINAL ANNUAL LEAVE PAYOFF           *
          *      COMPUTE FIREFIGHTER PREMIUM PAYOFF             *
          *                                                     *
          *******************************************************.

214120.
     IF NOT-FF-MSTR MOVE -80.00 TO HRLY-RATE-WORK
         GO TO 214125.
     IF FIRE-CHIEF-MSTR MOVE -112.00 TO HRLY-RATE-WORK
         GO TO 214125.
     MOVE -144.00 TO HRLY-RATE-WORK.
214125.
     ADD LWOP-WK1 LWOP-WK2 TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE
         OR HRLY-RATE-WORK ZERO
         MOVE "1" TO SW49.
     MOVE SPACE TO SW50.
214130.
     IF ANNUAL-PAYOFF OR HOLIDAY-PAYOFF MOVE "1" TO SW50.
     MULTIPLY DTL-HOURS BY MSTR-HOURLY-RATE,
         GIVING HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO SAVE-PAYOFF.
     IF ANNUAL-PAYOFF OR HOLIDAY-PAYOFF,
         ADD HRLY-RATE-WORK TO CAT-J-MONEY
         ADD DTL-HOURS TO CAT-J-HOURS.
     IF HOLIDAY-OTH-MONEY,
         MOVE SPACE TO SW34,
         ADD HRLY-RATE-WORK TO OTHER-MONEY,
             GO TO 216010.
         ADD HRLY-RATE-WORK TO ADJ-OTHER-MONEY.
216010.
     IF DIEM-MSTR,
             GO TO 204170.
216050.
     IF NOT-FF-MSTR,
         GO TO 210030.
     MULTIPLY FF-BONUS-PERCENT BY HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO ADJ-OTHER-MONEY.
     IF ANNUAL-PAYOFF, OR HOLIDAY-PAYOFF,
         ADD HRLY-RATE-WORK TO SAVE-PAYOFF CAT-J-MONEY.
         GO TO 210030.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTE RETROACTIVE REGULAR HOURS                  *
          *      COMPUTE FIREFIGHTER PREMIUM                    *
          *                                                     *
          *******************************************************.

218040.
     IF NOT-FF-MSTR,
         MOVE MSTR-HOURLY-RATE TO ROUND-WORK-AREA,
             GO TO 218142.
     MULTIPLY +80 BY MSTR-HOURLY-RATE,
         GIVING ROUND-WORK-AREA.
     DIVIDE FF-PREM-WORK INTO ROUND-WORK-AREA.
218142.
     MULTIPLY DTL-HOURS BY ROUND-WORK-AREA,
         GIVING HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO ADJ-REG-MONEY.
     ADD HRLY-RATE-WORK TO ADJ-WK-SUB, CAT-K-MONEY.
218180.
     IF DIEM-MSTR,
         GO TO 204170.
     GO TO 216050.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTE HOURS WORKED ON HOLIDAY                    *
          *      TEST FOR DIVER RATE                            *
          *                                                     *
          *******************************************************.

220100.
     IF DIVER-PAY,
         MOVE DIVER-RATE-KON TO HRLY-RATE-WORK,
             GO TO 220150.
         MOVE MSTR-HOURLY-RATE TO HRLY-RATE-WORK.
220150.
     MULTIPLY DTL-HOURS BY HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO OTHER-MONEY, CAT-B-MONEY.
     ADD DTL-HOURS TO CAT-B-HOURS.
         GO TO 216010.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTE DIVER RATE FOR REGULAR HOURS               *
          *                                                     *
          *******************************************************.

222060.
     MULTIPLY DIVER-RATE-KON BY DTL-HOURS,
         GIVING HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO OTHER-MONEY, CAT-A-MONEY.
     ADD DTL-HOURS TO OTHER-HOURS, CAT-A-HOURS.
     IF SAVE-DIVER-WEEK EQUAL TO "1",
         ADD HRLY-RATE-WORK TO WK1-SUBJECT,
         ADD DTL-HOURS TO REG-HRS-WK1,
             GO TO 218180.
         ADD HRLY-RATE-WORK TO WK2-SUBJECT.
         ADD DTL-HOURS TO REG-HRS-WK2.
             GO TO 218180.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTE 25 PERCENT SUNDAY REGULAR SCHEDULE         *
          *      INCLUDE ALL BONUS PAY EARNED                   *
          *      SAVE PREMIUM BY WEEK INDICATOR FOR PER DIEM    *
          *                                                     *
          *******************************************************.

224070.
     MOVE MSTR-HOURLY-RATE TO HRLY-RATE-WORK.
     IF DIEM-MSTR,
         ADD DIEM-NITE-PAY, DIEM-BONUS-PAY TO HRLY-RATE-WORK.
     MULTIPLY +.25 BY HRLY-RATE-WORK ROUNDED.
     MULTIPLY DTL-HOURS BY HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO OTHER-MONEY CAT-N-MONEY.
     ADD DTL-HOURS TO CAT-N-HOURS.
     IF ANNUM-MSTR,
         GO TO 210010.
     IF SAVE-SUNDAY-WEEK EQUAL TO "1",
         ADD HRLY-RATE-WORK TO SUNDAY-PREM-WK1,
             GO TO 210010.
         ADD HRLY-RATE-WORK TO SUNDAY-PREM-WK2.
             GO TO 210010.

     NOTE *******************************************************
          *                                                     *
          *  BEGIN PAYROLL COMPUTATION AND DEDUCTION ROUTINES   *
          *  TEST FOR OVERTIME AND LWOP IN FIRST WEEK           *
          *      REDUCE LWOP HOURS BY OVERTIME HOURS            *
          *          WRITE NOTIFICATION MESSAGE                 *
          *                                                     *
          *******************************************************.

226090.
     IF LWOP-WK1 ZERO,
         GO TO 232010.
     IF OT-HRS-WK1 ZERO,
         GO TO 232010.
     SUBTRACT OT-HRS-WK1 FROM LWOP-WK1,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         MOVE OT-HRS-WK1 TO ERR-HOURS
         GO TO 230010.
     MOVE LWOP-WK1 TO ERR-HOURS.
     MOVE +000.00 TO LWOP-WK1.
     MULTIPLY -1.00 BY HRLY-RATE-WORK.
     MOVE HRLY-RATE-WORK TO OT-HRS-WK1.
     IF DIVER-OT-HR1 ZERO,
         GO TO 228160.
     SUBTRACT DIVER-OT-HR1 FROM HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         GO TO 228160.
     MOVE SPACES TO ERR-SPACE.
     ADD HRLY-RATE-WORK TO DIVER-OT-HR1.
     SUBTRACT HRLY-RATE-WORK FROM REG-HRS-WK1.
     MULTIPLY MINUS-DIVER-RATE BY HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO REG-MONEY.
     ADD HRLY-RATE-WORK TO WK1-SUBJECT.

     NOTE *******************************************************
          *                                                     *
          *  WRITE NOTIFICATION MESSAGE                         *
          *      OVERTIME HOURS APPLIED TO LWOP                 *
          *                                                     *
          *******************************************************.

228160.
     ALTER 198140 TO PROCEED TO 232010.
228180.
     MOVE "OT HOURS APPLIED TO LWOP" TO ERR-MESS.
228200.
     MOVE "1" TO SW31.
         GO TO 198160.
230010.
     MOVE HRLY-RATE-WORK TO LWOP-WK1.
     IF DIVER-OT-HR1 ZERO,
         GO TO 230090.
     ADD DIVER-OT-HR1 TO REG-HRS-WK1.
     MULTIPLY DIVER-RATE-KON BY DIVER-OT-HR1 ROUNDED.
     ADD DIVER-OT-HR1 TO REG-MONEY.
     ADD DIVER-OT-HR1 TO WK1-SUBJECT.
230090.
     MOVE +00000.00 TO OT-HRS-WK1, DIVER-OT-HR1.
         GO TO 228160.

     NOTE *******************************************************
          *                                                     *
          *  TEST FOR OVERTIME AND LWOP IN SECOND WEEK          *
          *      REDUCE LWOP HOURS BY OVERTIME HOURS            *
          *          WRITE NOTIFICATION MESSAGE                 *
          *                                                     *
          *******************************************************.

232010.
     IF LWOP-WK2 ZERO,
         GO TO 236010.
     IF OT-HRS-WK2 ZERO,
         GO TO 236010.
     SUBTRACT OT-HRS-WK2 FROM LWOP-WK2,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         MOVE OT-HRS-WK2 TO ERR-HOURS
         GO TO 234040.
     MOVE LWOP-WK2 TO ERR-HOURS.
     MOVE +000.00 TO LWOP-WK2.
     MULTIPLY -1.00 BY HRLY-RATE-WORK.
     MOVE HRLY-RATE-WORK TO OT-HRS-WK2.
     IF DIVER-OT-HR2 ZERO,
         GO TO 234010.
     SUBTRACT DIVER-OT-HR2 FROM HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         GO TO 234010.
     MOVE SPACES TO ERR-SPACE.
     ADD HRLY-RATE-WORK TO DIVER-OT-HR2.
     SUBTRACT HRLY-RATE-WORK FROM REG-HRS-WK2.
     MULTIPLY MINUS-DIVER-RATE BY HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO REG-MONEY.
     ADD HRLY-RATE-WORK TO WK2-SUBJECT.
234010.
     ALTER 198140 TO PROCEED TO 236010.
         GO TO 228180.
234040.
     MOVE HRLY-RATE-WORK TO LWOP-WK2.
     IF DIVER-OT-HR2 ZERO,
         GO TO 234120.
     ADD DIVER-OT-HR2 TO REG-HRS-WK2.
     MULTIPLY DIVER-RATE-KON BY DIVER-OT-HR2 ROUNDED.
     ADD DIVER-OT-HR2 TO REG-MONEY.
     ADD DIVER-OT-HR2 TO WK2-SUBJECT.
234120.
     MOVE +00000.00 TO OT-HRS-WK2, DIVER-OT-HR2.
         GO TO 234010.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTATION OF PAYROLL REGULAR HOURS               *
          *      INCLUDE FIREFIGHTER REGULAR HOURS              *
          *          TEST FOR LWOP EXCEEDING REGULAR HOURS      *
          *                                                     *
          *******************************************************.

236010.
     IF DIEM-MSTR,
         GO TO 236080.
     IF GS-GRADED-MSTR,
         GO TO 238060.
236080.
     SUBTRACT LWOP-WK1, REG-HRS-WK1 FROM +040.00
         GIVING HRLY-RATE-WORK.
236102.
     IF HRLY-RATE-WORK POSITIVE,
         OR HRLY-RATE-WORK ZERO,
             GO TO 240080.
     ALTER 198140 TO PROCEED TO 240060.

     NOTE *******************************************************
          *                                                     *
          *  WRITE NOTIFICATION MESSAGE                         *
          *      LWOP HOURS EXCEED REGULAR HOURS                *
          *                                                     *
          *******************************************************.

238020.
     MOVE HRLY-RATE-WORK TO MSG3-HRS.
     MOVE MESSAGE3 TO ERR-EXPLAIN.
         GO TO 228200.
238060.
     IF LWOP-WK1 ZERO, AND LWOP-WK2 ZERO,
         MOVE +80.00 TO HRLY-RATE-WORK,
             GO TO 236102.
     MOVE +00000.00 TO HRLY-RATE-WORK.
     SUBTRACT LWOP-WK1, LWOP-WK2 FROM HRLY-RATE-WORK.
     IF NOT-FF-MSTR,
         ADD +80.00 TO HRLY-RATE-WORK,
             GO TO 236102.
         ADD FF-PREM-WORK TO HRLY-RATE-WORK.
             GO TO 244100.

     NOTE *******************************************************
          *                                                     *
          *  LWOP HOURS LESS THAN REGULAR HOURS                 *
          *      COMPUTE REGULAR MONEY                          *
          *                                                     *
          *******************************************************.

240060.
     MOVE +00000.00 TO HRLY-RATE-WORK.
240080.
     MOVE HRLY-RATE-WORK TO REG-HRS-WK1.
     ADD HRLY-RATE-WORK TO CAT-A-HOURS.
     MULTIPLY MSTR-HOURLY-RATE BY HRLY-RATE-WORK ROUNDED.
     IF GS-GRADED-MSTR ADD HRLY-RATE-WORK TO CAT-A-MONEY.
     IF DIEM-MSTR ADD HRLY-RATE-WORK TO CAT-MONEY.
     ADD HRLY-RATE-WORK TO WK1-SUBJECT.
     ADD HRLY-RATE-WORK TO REG-MONEY.

DIEM1.
     NOTE *******************************************************
          *                                                     *
          *   TEST FOR PER DIEM MASTERS                         *
          *      COMPUTE PER DIEM WEEK 2 PAY                    *
          *                                                     *
          *******************************************************.
241000.

     IF DIEM-MSTR,
         GO TO 242070.
     IF GS-GRADED-MSTR,
         GO TO 246122.
242070.
     SUBTRACT LWOP-WK2, REG-HRS-WK2 FROM +040.00
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         ALTER 198140 TO PROCEED TO 242140,
             GO TO 238020.
         GO TO 242160.
242140.
     MOVE +00000.00 TO HRLY-RATE-WORK.
242160.
     MOVE HRLY-RATE-WORK TO REG-HRS-WK2.
     ADD HRLY-RATE-WORK TO CAT-A-HOURS.
     ADD REG-HRS-WK2 TO REG-HRS-WK1.
     MULTIPLY MSTR-HOURLY-RATE BY HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO WK2-SUBJECT, CAT-MONEY.
     ADD HRLY-RATE-WORK TO REG-MONEY.
     IF 2ND-SHIFT-MSTR
         MULTIPLY REG-HRS-WK1 BY SHIFT-2 GIVING CAT-C-WORK ROUNDED
         GO TO 242180.
     IF 3RD-SHIFT-MSTR
         MULTIPLY REG-HRS-WK1 BY SHIFT-3 GIVING CAT-C-WORK ROUNDED
         GO TO 242180.
     ADD CAT-MONEY TO CAT-A-MONEY.
     GO TO 252080.
242180.
     ADD CAT-C-WORK TO CAT-C-MONEY.
     SUBTRACT CAT-C-WORK FROM CAT-MONEY.
     ADD CAT-MONEY TO CAT-A-MONEY.
     ADD REG-HRS-WK1 TO CAT-C-HOURS.
         GO TO 252080.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTATION OF FIREFIGHTER REGULAR HOURS           *
          *                                                     *
          *******************************************************.

244100.
     IF HRLY-RATE-WORK NEGATIVE,
         GO TO 244140.
     ADD HRLY-RATE-WORK TO REG-HRS-WK1.
244140.
     MULTIPLY +80.0 BY MSTR-HOURLY-RATE,
         GIVING HRLY-RATE-WORK ROUNDED.
     MOVE HRLY-RATE-WORK TO ROUND-WORK-AREA.
     DIVIDE FF-PREM-WORK INTO ROUND-WORK-AREA,
         GIVING HRLY-RATE-WORK ROUNDED.
     MULTIPLY REG-HRS-WK1 BY HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO WK1-SUBJECT.
     ADD HRLY-RATE-WORK TO REG-MONEY.
     MULTIPLY FF-BONUS-PERCENT BY HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO WK1-SUBJECT.
246098.
     ADD HRLY-RATE-WORK TO OTHER-MONEY.
         GO TO 252080.
246122.
     IF NOT-FF-MSTR,
         GO TO 252080.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTATION OF 15( OR 20( BONUS FOR PREMIUM        *
          *      FIREFIGHTERS AND FIRECHIEF WITHOUT LWOP        *
          *          TEST ANNUAL RATE FOR MAXIMUM OF GS-10      *
          *          FIRST STEP                                 *
          *          ALSO APPLY ADDITIONAL SUNDAY PREMIUM PAY   *
          *                                                     *
          *******************************************************.

248030.
     IF MSTR-ANNUAL-RATE GREATER THAN FF-MAX-RATE,
         MOVE FF-MAX-RATE TO HRLY-RATE-WORK,
             GO TO 248080.
         MOVE MSTR-ANNUAL-RATE TO HRLY-RATE-WORK.
248080.
     ADD FF-BONUS-HOURS TO REG-HRS-WK1.
     MULTIPLY FF-BONUS-PERCENT BY HRLY-RATE-WORK ROUNDED.
     ADD MSTR-ANNUAL-RATE TO HRLY-RATE-WORK.
     MOVE HRLY-RATE-WORK TO ROUND-WORK-AREA.
     DIVIDE +2080 INTO ROUND-WORK-AREA,
         GIVING HRLY-RATE-WORK ROUNDED.
     SUBTRACT MSTR-HOURLY-RATE FROM HRLY-RATE-WORK.
     MULTIPLY +80 BY HRLY-RATE-WORK.
     ADD HRLY-RATE-WORK TO WK1-SUBJECT.
         GO TO 246098.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTE PER ANNUM OVERTIME                         *
          *      TEST FOR GS-10 STEP 1 MAXIMUM RATE             *
          *                                                     *
          *******************************************************.

252080.
     IF DIEM-MSTR,
         GO TO 254140.
     IF NOT GS-GRADED-MSTR,
         GO TO 254140.
252150.
     ADD OT-HRS-WK2 TO OT-HRS-WK1.
     IF OT-HRS-WK1 ZERO,
         GO TO 260140.
     MULTIPLY MSTR-HOURLY-RATE BY +1.5,
         GIVING HRLY-RATE-WORK ROUNDED.
     IF HRLY-RATE-WORK GREATER THAN ANNUM-OT-MAX,
         MOVE ANNUM-OT-MAX TO HRLY-RATE-WORK.
     MULTIPLY OT-HRS-WK1 BY HRLY-RATE-WORK ROUNDED.
     ADD HRLY-RATE-WORK TO OT-MONEY.
         GO TO 260140.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTE PER DIEM WEEK 1 OVERTIME                   *
          *                                                     *
          *******************************************************.

254140.
     IF OT-HRS-WK1 ZERO,
         GO TO 258030.
     MULTIPLY MSTR-HOURLY-RATE BY +1.5,
        GIVING HRLY-RATE-WORK ROUNDED.
         MULTIPLY OT-HRS-WK1 BY HRLY-RATE-WORK ROUNDED.
256130.
     ADD HRLY-RATE-WORK TO OT-MONEY.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTE PER DIEM WEEK 2 OVERTIME                   *
          *                                                     *
          *******************************************************.

258030.
     IF OT-HRS-WK2 ZERO,
         GO TO 264160.
     MULTIPLY MSTR-HOURLY-RATE BY +1.5,
        GIVING HRLY-RATE-WORK ROUNDED.
         MULTIPLY OT-HRS-WK2 BY HRLY-RATE-WORK ROUNDED.
260020.
     ADD HRLY-RATE-WORK TO OT-MONEY.
         GO TO 264160.

     NOTE *******************************************************
          *                                                     *
          *  TEST FOR PER ANNUM MAXIMUM ACCRUAL PERIOD PAY      *
          *      WRITE NOTIFICATION MESSAGE FOR CURRENT         *
          *          EARNED EXCEEDING GS-15 STEP 10 MAXIMUM     *
          *                                                     *
          *******************************************************.

260140.
     MOVE ANNUM-MAX-PAY TO HRLY-RATE-WORK.
     SUBTRACT REG-MONEY, OT-MONEY, OTHER-MONEY,
         FROM HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         GO TO 264160.
     IF MSTR-GS-GRADE EQUAL TO "PL",
         OR MSTR-GS-GRADE GREATER THAN "15",
         OR (MSTR-GS-GRADE EQUAL TO "15",
         AND MSTR-STEP-NO EQUAL TO "10" ),
             MOVE +00000.00 TO OT-MONEY, OTHER-MONEY,
                 GO TO 264160.

ERNOTE1.
     NOTE *******************************************************
          *                                                     *
          *  WRITE NOTIFICATION MESSAGE                         *
          *      CURRENT EARNED EXCEEDS MAXIMUM                 *
          *                                                     *
          *******************************************************.
261000.

     IF OT-MONEY ZERO,
         ADD HRLY-RATE-WORK TO OTHER-MONEY,
             GO TO 262160.
         ADD HRLY-RATE-WORK TO OT-MONEY.
262160.
     MOVE ANNUM-MAX-PAY TO MSG4-MAX.
     MOVE HRLY-RATE-WORK TO MSG4-AMT.
     MOVE MESSAGE4 TO ERR-EXPLAIN.
     ALTER 198140 TO PROCEED TO 264020.
         GO TO 228200.
264020.
     IF OT-MONEY POSITIVE,
         GO TO 264160.
     ADD OT-MONEY TO OTHER-MONEY.
     MOVE +00000.00 TO OT-MONEY.

     NOTE *******************************************************
          *                                                     *
          *  TEST FOR ADJUSTMENT TO REGULAR MONEY               *
          *      WRITE NOTIFICATION MESSAGE IF REGULAR          *
          *          MONEY ADJUSTED TO CREDIT                   *
          *                                                     *
          *******************************************************.

264160.
     IF ADJ-REG-MONEY ZERO,
         GO TO 270090.
     MOVE ADJ-REG-MONEY TO HRLY-RATE-WORK.
     MOVE +00000.00 TO ADJ-REG-MONEY.
264184.
     ADD REG-MONEY TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         OR HRLY-RATE-WORK ZERO,
             GO TO 268140.
         MOVE +00000.00 TO REG-MONEY.
         ADD OTHER-MONEY TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         OR HRLY-RATE-WORK ZERO,
             GO TO 268170.
         MOVE +00000.00 TO OTHER-MONEY.
         ADD OT-MONEY TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         OR HRLY-RATE-WORK ZERO,
             GO TO 268200.
         MOVE +00000.00 TO OT-MONEY.
         ADD ADJ-OTHER-MONEY TO HRLY-RATE-WORK.
         MOVE +00000.00 TO ADJ-OTHER-MONEY.
     IF HRLY-RATE-WORK POSITIVE,
         OR HRLY-RATE-WORK ZERO,
             GO TO 268170.
         ADD ADJ-OT-MONEY TO HRLY-RATE-WORK.
         MOVE +00000.00 TO ADJ-OT-MONEY.
     IF HRLY-RATE-WORK POSITIVE,
         OR HRLY-RATE-WORK ZERO,
             GO TO 268200.
     MOVE +00000.00 TO WK1-SUBJECT, WK2-SUBJECT, ADJ-WK-SUB.
     ALTER 198140 TO PROCEED TO 278090.

     NOTE *******************************************************
          *                                                     *
          *  WRITE NOTIFICATION MESSAGE                         *
          *      CURRENT EARNED ADJUSTED TO CREDIT              *
          *                                                     *
          *******************************************************.

268100.
     MOVE HRLY-RATE-WORK TO MSG5-AMT.
     MOVE MESSAGE5 TO ERR-EXPLAIN.
         GO TO 228200.
268140.
     MOVE HRLY-RATE-WORK TO REG-MONEY.
         GO TO 270090.
268170.
     MOVE HRLY-RATE-WORK TO OTHER-MONEY.
         GO TO 270090.
268200.
     MOVE HRLY-RATE-WORK TO OT-MONEY.

     NOTE *******************************************************
          *                                                     *
          *  TEST FOR ADJUSTMENT TO OTHER MONEY                 *
          *                                                     *
          *******************************************************.

270090.
     IF ADJ-OTHER-MONEY ZERO,
         GO TO 272060.
     MOVE ADJ-OTHER-MONEY TO HRLY-RATE-WORK.
     MOVE +00000.00 TO ADJ-OTHER-MONEY.
     ADD OTHER-MONEY TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         MOVE +00000.00 TO OTHER-MONEY,
             GO TO 264184.
         GO TO 268170.

     NOTE *******************************************************
          *                                                     *
          *  TEST FOR ADJUSTMENT TO OVERTIME MONEY              *
          *                                                     *
          *******************************************************.

272060.
     IF ADJ-OT-MONEY ZERO,
         GO TO 274050.
     MOVE ADJ-OT-MONEY TO HRLY-RATE-WORK.
     MOVE +00000.00 TO ADJ-OT-MONEY.
     ADD OT-MONEY TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         MOVE HRLY-RATE-WORK TO WT-NEG-OT
         MOVE +00000.00 TO OT-MONEY,
             GO TO 264184.
         GO TO 268200.

     NOTE *******************************************************
          *                                                     *
          *  TEST FOR ADJUSTMENT TO SUBJECT MONEY               *
          *      WRITE NOTIFICATION MESSAGE IF SUBJECT          *
          *          MONEY ADJUSTED TO CREDIT                   *
          *                                                     *
          *******************************************************.

274050.
     MOVE ADJ-WK-SUB TO HRLY-RATE-WORK.
     MOVE +00000.00 TO ADJ-WK-SUB.
     ADD WK1-SUBJECT, WK2-SUBJECT TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         MOVE +00000.00 TO WK1-SUBJECT, WK2-SUBJECT,
         MOVE HRLY-RATE-WORK TO MSG6-AMT,
         MOVE MESSAGE6 TO ERR-EXPLAIN,
         ALTER 198140 TO PROCEED TO 276040,
             GO TO 228200.
         MOVE HRLY-RATE-WORK TO WK1-SUBJECT.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTE PAYROLL GROSS MONEY                        *
          *                                                     *
          *******************************************************.

276040.
     IF PAYOFF-SW PERFORM 214120 THRU 214125.
     ADD REG-MONEY, OT-MONEY, OTHER-MONEY,
         GIVING HRLY-RATE-WORK.
     ADD HRLY-RATE-WORK TO CURR-EARNED.
     ADD HRLY-RATE-WORK TO NET-PAY.
     IF DECEASED-PAYOFF,
         GO TO 278090.
     ADD HRLY-RATE-WORK TO MSTR-YTD-TOT-EARN.
     ADD REG-MONEY TO MSTR-YTD-REG-MONEY.
     ADD OTHER-MONEY TO MSTR-YTD-OTH-MONEY.
     ADD OT-MONEY TO MSTR-YTD-OT-MONEY.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTATION OF FICA DEDUCTION ROUTINE              *
          *      YTD SUBJECT TO FICA MAXIMUM IS 9,000 DOLLARS   *
          *      FICA DEDUCTION PERCENTAGE IS 5-2 OF GROSS     *
          *      FICA DEDUCTION MAXIMUM IS 468 DOLLARS          *
          *      WRITE NOTIFICATION MESSAGE FOR FICA            *
          *          DEDUCTION ADJUSTED TO CREDIT               *
          *                                                     *
          *******************************************************.

278090.
     IF NOT FICA-MSTR,
         GO TO 286130.
     EXAMINE MSTR-YTD-SUB-FICA-RE REPLACING ALL " " BY "0".
     SUBTRACT +9000.00 FROM MSTR-YTD-SUB-FICA
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK ZERO,
         GO TO 282110.
     IF HRLY-RATE-WORK POSITIVE,
         ALTER 198140 TO PROCEED TO 290150,
         MOVE "YTD SUBJECT TO FICA OVER MAXIMUM" TO ERR-EXPLAIN,
             GO TO 228200.
     ADD CURR-EARNED TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         GO TO 282170.
     MOVE CURR-EARNED TO WK1-SUBJECT.
280040.
     ADD WK1-SUBJECT TO MSTR-QTR-SUB-FICA.
     ADD WK1-SUBJECT TO MSTR-YTD-SUB-FICA.
     ADD WK1-SUBJECT TO SUBJECT-FICA.
     MULTIPLY WK1-SUBJECT BY +.052
         GIVING RETIRE-FICA ROUNDED.
     IF FICA-ADJUSTMENT,
         GO TO 284040.
280130.
     IF WRITE-CASH-AWARD
         MOVE CURR-EARNED TO NET-PAY.
     SUBTRACT RETIRE-FICA FROM NET-PAY,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         ADD HRLY-RATE-WORK TO RETIRE-FICA,
         ALTER 198140 TO PROCEED TO 280130,
             GO TO 268100.
     MOVE HRLY-RATE-WORK TO NET-PAY.
     IF NET-PAY ZERO,
         GO TO 282072.
282022.
     IF FICA-MAXIMUM,
         SUBTRACT MSTR-YTD-FICA, RETIRE-FICA, FROM +00468.00
             GIVING HRLY-RATE-WORK,
         ADD HRLY-RATE-WORK TO RETIRE-FICA,
         SUBTRACT HRLY-RATE-WORK FROM NET-PAY.
282072.
     MOVE SPACE TO SW35.
     ADD RETIRE-FICA TO MSTR-YTD-FICA.
         GO TO 290150.
282110.
     MOVE +00000.00 TO WK1-SUBJECT.
     IF DECEASED-PAYOFF,
         GO TO 290150.
     ADD CURR-EARNED TO MSTR-YTD-NOT-FICA.
         GO TO 290150.
282170.
     IF NOT DECEASED-PAYOFF,
         ADD HRLY-RATE-WORK TO MSTR-YTD-NOT-FICA.
     MULTIPLY -1.00 BY HRLY-RATE-WORK.
     ADD CURR-EARNED, HRLY-RATE-WORK,
         GIVING WK1-SUBJECT.
     MOVE "1" TO SW35.
             GO TO 280040.
284040.
     ADD ADJ-RETIRE TO RETIRE-FICA.
     IF RETIRE-FICA ZERO,
         GO TO 282022.
     IF RETIRE-FICA POSITIVE,
         GO TO 280130.
     ALTER 198140 TO PROCEED TO 280130.

     NOTE *******************************************************
          *                                                     *
          *  WRITE NOTIFICATION MESSAGE                         *
          *      FICA OR CSRA DEDUCTION ADJUSTED TO CREDIT      *
          *                                                     *
          *******************************************************.

284190.
     MOVE RETIRE-FICA TO MSG7-AMT.
284210.
     MOVE MESSAGE7 TO ERR-EXPLAIN.
         GO TO 228200.

285000.
     NOTE *******************************************************
          *                                                     *
          *  COMPUTATION OF CSRA DEDUCTION ROUTINE              *
          *      CSRA DEDUCTION PERCENTAGE IS  7  OF SUBJECT    *
          *      WRITE NOTIFICATION MESSAGE FOR CSRA            *
          *          DEDUCTION ADJUSTED TO CREDIT               *
          *                                                     *
          *******************************************************.

286130.
     IF WRITE-CASH-AWARD,
         GO TO 290150.
     IF NOT CSRA-MSTR,
         GO TO 290150.
     IF NOT DECEASED-PAYOFF,
         ADD WK1-SUBJECT TO MSTR-YTD-SUB-RET.
     ADD WK1-SUBJECT TO SUBJECT-RETIRE.
     ADD WK1-SUBJECT TO TOT-SUB-RETIRE.
     MULTIPLY WK1-SUBJECT BY +.07,
         GIVING RETIRE-FICA ROUNDED.
     IF CSRA-ADJUSTMENT,
         GO TO 288170.
288060.
     SUBTRACT RETIRE-FICA FROM NET-PAY,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         ADD HRLY-RATE-WORK TO RETIRE-FICA,
         ALTER 198140 TO PROCEED TO 288060,
             GO TO 268100.
     MOVE HRLY-RATE-WORK TO NET-PAY.
     ADD RETIRE-FICA TO MSTR-YTD-RETIRE.
     ADD RETIRE-FICA TO MSTR-TOT-RETIRE.
         GO TO 290150.
288170.
     ADD ADJ-RETIRE TO RETIRE-FICA.
     IF RETIRE-FICA ZERO,
         GO TO 290150.
     IF RETIRE-FICA POSITIVE,
         GO TO 288060.
     ALTER 198140 TO PROCEED TO 288060.
         GO TO 284190.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTATION OF FEDERAL TAX DEDUCTION ROUTINE       *
          *      SEPARATE DEDUCTION TABLE FOR SINGLE OR MARRIED *
          *      ADDED TAX DEDUCTIONS ONLY IF NO EXEMPTIONS     *
          *      COMPUTE TAX ONLY IF CURRENT EARNED OVER $8     *
          *                                                     *
          *******************************************************.

290150.
     IF DECEASED-PAYOFF,
         GO TO 298000.
     IF WRITE-CASH-AWARD AND FICA-MSTR GO TO 297000.
     IF WRITE-CASH-AWARD,
         MOVE CURR-EARNED TO NET-PAY,
             GO TO 297000.
     IF ADJ-NSFT,
     SUBTRACT NOT-SUBJ-FED-TAX FROM CURR-EARNED.
     IF CD10-TAX-ADJ
         GO TO 297000.
     MOVE +00000.00 TO HRLY-RATE-WORK.
     IF MSTR-TAX-CODE NOT ZERO,
         MULTIPLY MSTR-TAX-CODE BY -28.80
             GIVING HRLY-RATE-WORK.
     ADD CURR-EARNED TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         GO TO 294140.
292052.
     MOVE +00000.00 TO HRLY-RATE-WORK.
292070.
     MOVE HRLY-RATE-WORK TO FED-TAXES.
     IF MSTR-ADDED-TAX EQUAL TO ZEROS OR SPACES GO TO 292122.
     ADD MSTR-ADDED-TAX TO FED-TAXES.
292122.
     IF TAX-ADJUSTMENT,
         GO TO 294050.
292150.
     SUBTRACT FED-TAXES FROM NET-PAY,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         ADD HRLY-RATE-WORK TO FED-TAXES,
         ALTER 198140 TO PROCEED TO 292150,
             GO TO 268100.
     MOVE HRLY-RATE-WORK TO NET-PAY.
     ADD FED-TAXES TO MSTR-YTD-FED-TAX.
         GO TO 298000.
294050.
     ADD ADJ-TAXES TO FED-TAXES.
     IF FED-TAXES ZERO,
         GO TO 298000.
     IF FED-TAXES POSITIVE,
         GO TO 292150.
     ALTER 198140 TO PROCEED TO 292150.
     MOVE FED-TAXES TO MSG7-AMT.
         GO TO 284210.
294140.
     IF HRLY-RATE-WORK NOT GREATER THAN +00021.00
         GO TO 292052.
     IF MARRIED-MSTR,
         MOVE 07 TO SUBS-1
         MOVE 08 TO SUBS-2
         MOVE 08 TO SUBS-3
             GO TO 296020.
     MOVE 01 TO SUBS-1, SUBS-2.
    MOVE 01 TO SUBS-3.
296020.
     IF HRLY-RATE-WORK NOT GREATER THAN TAXABLE-WAGES (SUBS-1),
         SUBTRACT +21.00 FROM HRLY-RATE-WORK.
296060.
     SUBTRACT TAXABLE-WAGES (SUBS-1) FROM HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         GO TO 296150.
     ADD TAXABLE-WAGES (SUBS-1) TO HRLY-RATE-WORK.
296110.
     MULTIPLY EXCESS-PERCENT (SUBS-3) BY HRLY-RATE-WORK ROUNDED.
     ADD TAX-DEDUCTIONS (SUBS-2) TO HRLY-RATE-WORK.
         GO TO 292070.
296150.
     ADD 1 TO SUBS-1.
     ADD 1 TO SUBS-2.
     ADD 1 TO SUBS-3.
     IF SUBS-3 EQUAL TO 07 OR 14
         GO TO 296110.
     GO TO 296060.
297000.
     MULTIPLY CURR-EARNED BY +.20 GIVING FED-TAXES ROUNDED.
     GO TO 292122.
298000.
     ADD NOT-SUBJ-FED-TAX TO CURR-EARNED.

     NOTE *******************************************************
          *                                                     *
          *  HEALTH INSURANCE DEDUCTION ROUTINE                 *
          *      WRITE NOTIFICATION MESSAGE IF NORMAL HEALTH    *
          *          INSURANCE DEDUCTION NOT TAKEN              *
          *                                                     *
          *******************************************************.

298080.
     EXAMINE MSTR-HLTH-CODE-RE REPLACING ALL " " BY "0".
     EXAMINE MSTR-HLTH-DED-RE  REPLACING ALL " " BY "0".
     EXAMINE MSTR-HLTH-CONTRIB-RE REPLACING ALL " " BY "0".
     IF WRITE-CASH-AWARD,
         GO TO 328100.
     IF CANCEL-HEALTH,
         MOVE SPACE TO SW14,
             GO TO 302200.
     IF MSTR-HLTH-CODE NOT GREATER THAN +003
         GO TO 306030.
     IF PAYOFF-LWOP GO TO 302200.
     IF FIRE-FIGHTER-MSTR,
         MOVE -144.00 TO HRLY-RATE-WORK,
             GO TO 300030.
     IF FIRE-CHIEF-MSTR,
         MOVE -112.00 TO HRLY-RATE-WORK,
             GO TO 300030.
         MOVE -80.00 TO HRLY-RATE-WORK.
300030.
     ADD LWOP-WK1, LWOP-WK2 TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         OR HRLY-RATE-WORK ZERO,
             GO TO 302200.
     MOVE MSTR-HLTH-DED TO HLTH-INS-DED.
     MOVE MSTR-HLTH-CONTRIB TO HLTH-INS-CON.
     IF HLTH-DED-ADJUSTMENT,
         GO TO 302020.
300102.
     SUBTRACT HLTH-INS-DED FROM NET-PAY,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         GO TO 304050.
     MOVE HRLY-RATE-WORK TO NET-PAY.
     ADD HLTH-INS-DED TO EMPLOYEE-HEALTH.
     ADD HLTH-INS-CON TO EMPLOYER-HEALTH.
     ADD 1 TO HEALTH-COUNT.
     ADD HLTH-INS-DED TO MSTR-YTD-HLTH-DED.
     ADD HLTH-INS-CON TO MSTR-YTD-HLTH-CON.
         GO TO 306030.
302020.
     ADD ADJ-HEALTH-DED TO HLTH-INS-DED.
     ADD ADJ-HEALTH-CON TO HLTH-INS-CON.
     IF HLTH-INS-DED ZERO,
         GO TO 304050.
     IF HLTH-INS-DED POSITIVE,
         GO TO 300102.
     ALTER 198140 TO PROCEED TO 300102.
     MOVE HLTH-INS-DED TO MSG7-AMT.
         GO TO 284210.

     NOTE *******************************************************
          *                                                     *
          *  WRITE NOTIFICATION MESSAGE                         *
          *      HEALTH INSURANCE NORMAL DEDUCTION NOT TAKEN    *
          *                                                     *
          *******************************************************.

302200.
     IF HLTH-DED-ADJUSTMENT,
         MOVE ADJ-HEALTH-DED TO HLTH-INS-DED,
         MOVE ADJ-HEALTH-CON TO HLTH-INS-CON,
             GO TO 300102.
304050.
     MOVE +000.00 TO HLTH-INS-DED, HLTH-INS-CON.
     MOVE MSTR-HLTH-CODE TO MSG8-CODE.
     MOVE MSTR-HLTH-DED TO MSG8-AMT1.
     MOVE MSTR-HLTH-CONTRIB TO MSG8-AMT2.
     MOVE MESSAGE8 TO ERR-EXPLAIN.
     ALTER 198140 TO PROCEED TO 306030.
         GO TO 228200.

     NOTE *******************************************************
          *                                                     *
          *  LIFE INSURANCE DEDUCTION ROUTINE                   *
          *      LIFE INSURANCE OPTION DEDUCTION INCLUDED       *
          *      COMPUTE LIFE INSURANCE AT 80TH HOUR            *
          *                                                     *
          *******************************************************.

306030.
     IF CANCEL-LIFE,
         MOVE +000.00 TO LIFE-INS-DED, LIFE-OPT-DED,
             GO TO 308060.
     IF NOT LIFE-INSUR-MSTR,
         GO TO 316100.
     IF PAYOFF-LWOP
         MOVE +000.00 TO LIFE-INS-DED LIFE-OPT-DED
         GO TO 308060.
     IF FIRE-FIGHTER-MSTR,
         MOVE -144.00 TO HRLY-RATE-WORK,
             GO TO 306170.
     IF FIRE-CHIEF-MSTR,
         MOVE -112.00 TO HRLY-RATE-WORK,
             GO TO 306170.
     MOVE -80.00 TO HRLY-RATE-WORK.
306170.
     ADD LWOP-WK1, LWOP-WK2 TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         OR HRLY-RATE-WORK ZERO,
             MOVE "1" TO SW13,
             MOVE +000.00 TO LIFE-INS-DED, LIFE-OPT-DED,
                 GO TO 308060.
     MOVE MSTR-LIFE-INS-DED TO LIFE-INS-DED.
308055.
     MOVE MSTR-LIFE-OPT-DED TO LIFE-OPT-DED.
308060.
     IF LIFE-INS-ADJUSTMENT,
         GO TO 310010.
308082.
     IF LIFE-OPT-ADJUSTMENT,
         GO TO 310160.
308110.
     SUBTRACT LIFE-INS-DED, LIFE-OPT-DED FROM NET-PAY,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         ALTER 198140 TO PROCEED TO 312170,
             GO TO 268100.
     MOVE HRLY-RATE-WORK TO NET-PAY.
     ADD LIFE-INS-DED TO MSTR-YTD-LIFE-INS.
     ADD LIFE-OPT-DED TO MSTR-YTD-LIFE-OPT.
         GO TO 316100.
310010.
     ADD ADJ-LIFE-INS TO LIFE-INS-DED.
     IF LIFE-INS-DED NEGATIVE,
         ALTER 198140 TO PROCEED TO 308082,
         MOVE LIFE-INS-DED TO MSG7-AMT,
             GO TO 284210.
         GO TO 308082.
310160.
     IF MSTR-LIFE-OPT-CODE IS LESS THAN "A"
         AND GREATER THAN "G",
         MOVE "INCORRECT LIFE OPTION ADJUSTMENT" TO ERR-EXPLAIN,
         ALTER 198140 TO PROCEED TO 308110,
             GO TO 228200.
     ADD ADJ-LIFE-OPT TO LIFE-OPT-DED.
     IF LIFE-OPT-DED NEGATIVE,
         ALTER 198140 TO PROCEED TO 308110,
         MOVE LIFE-OPT-DED TO MSG7-AMT,
             GO TO 284210.
         GO TO 308110.
312170.
     ADD LIFE-OPT-DED TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         MOVE +000.00 TO LIFE-OPT-DED,
         ADD HRLY-RATE-WORK TO LIFE-INS-DED,
             GO TO 308110.
         MOVE HRLY-RATE-WORK TO LIFE-OPT-DED.
         GO TO 308110.

     NOTE *******************************************************
          *                                                     *
          *  BOND DEDUCTION ROUTINE                             *
          *                                                     *
          *******************************************************.

316100.
     IF CANCEL-BOND,
         GO TO 324170.
     MOVE MSTR-BOND-DED TO BOND-DED.
     IF PAYOFF-LWOP
         MOVE +000.00 TO BOND-DED.
     IF BOND-ADJUST,
        GO TO 317000.
316300.
     MOVE 01 TO SUBS-1.
316350.
     SUBTRACT BOND-DED FROM NET-PAY,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         MOVE +000.00 TO BOND-DED,
             GO TO 324170.
         MOVE HRLY-RATE-WORK TO NET-PAY.

     ADD BOND-DED TO MSTR-YTD-BONDS.
     IF BOND-DED POSITIVE
          ADD BOND-DED TO BOND-DEDUCTION
        ADD 1 TO BOND-COUNT.
     GO TO 324170.
317000.
     ADD ADJ-TO-BONDS TO BOND-DED.
     IF BOND-DED ZERO GO TO 324170.
     IF BOND-DED POSITIVE, GO TO 316350.
     ALTER 198140 TO PROCEED TO 316350.
     MOVE BOND-DED TO MSG7-AMT.
        GO TO 284210.
     NOTE *******************************************************
          *                                                     *
          *  GOVERNMENT INDEBTED DEDUCTION ROUTINE              *
          *      WRITE NOTIFICATION MESSAGE IF PAYMENT          *
          *          EXCEEDS NET PAY                            *
          *      LAST PAYMENT AUTOMATICALLY REDUCED TO          *
          *          BALANCE AMOUNT                             *
          *                                                     *
          *******************************************************.

324170.
     IF NOT ADJ-OTH-DED,
         GO TO 325050.
     SUBTRACT ADJ-TO-OTH-DED FROM NET-PAY,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE,
         GO TO 325000.
     MOVE 0000.00 TO ADJ-TO-OTH-DED.
325000.
     ADD ADJ-TO-OTH-DED TO MSTR-YTD-OTH-DED.
325050.
     IF MSTR-YTD-GOV-INDEBT ZERO,
         GO TO 328100.
     SUBTRACT MSTR-YTD-GOV-PAY FROM NET-PAY,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         ALTER 198140 TO PROCEED TO 328100,
         MOVE "PAYMENT EXCEEDS NET PAY, NO PAYMENT" TO
             ERR-EXPLAIN,
                 GO TO 228200.
         MOVE HRLY-RATE-WORK TO NET-PAY.
         MOVE MSTR-YTD-GOV-PAY TO HRLY-RATE-WORK.
         SUBTRACT MSTR-YTD-GOV-PAY FROM MSTR-YTD-GOV-INDEBT.
     IF MSTR-YTD-GOV-INDEBT ZERO,
         GO TO 326150.
     IF MSTR-YTD-GOV-INDEBT POSITIVE,
         GO TO 326180.
     ADD MSTR-YTD-GOV-INDEBT TO HRLY-RATE-WORK.
     SUBTRACT MSTR-YTD-GOV-INDEBT FROM NET-PAY.
326150.
     MOVE +0000.00 TO MSTR-YTD-GOV-INDEBT,
         MSTR-YTD-GOV-PAY.
326180.
     ADD HRLY-RATE-WORK TO OTHER-DED.
     ADD HRLY-RATE-WORK TO MSTR-YTD-OTH-DED.

     NOTE *******************************************************
          *                                                     *
          *  COMPUTATION OF STATE TAX DEDUCTION ROUTINE         *
          *      ARIZONA STATE TAX IS 1 PERCENT OF GROSS        *
          *      UTAH STATE TAX IS 14 PERCENT OF FED TAX        *
          *      MISSOURI STATE TAX IS 9 PERCENT OF FED TAX     *
          *                                                     *
          *******************************************************.

328100.
     IF MSTR-ST-TAX-EXEM-CD-RE EQUALS "ZZ" GO TO 332120.
     EXAMINE MSTR-ST-TAX-EXEM-CD-RE REPLACING ALL " " BY "0".
     IF DECEASED-PAYOFF,
         GO TO 332120.
     IF CURR-EARNED EQUALS ZEROS GO TO 332120.
     IF MSTR-STATE-TAX-CODE IS EQUAL TO "0" GO TO 332120.
     IF MSTR-STATE-TAX-CODE IS EQUAL TO " " GO TO 332120.
     MOVE CURR-EARNED TO ST-CURR-EARNED.
     MOVE MSTR-ST-TAX-EXEM-CD TO DEP-ALLOW.
     IF MSTR-STATE-TAX-CODE = "B" GO TO ALABAMA.
     IF MSTR-STATE-TAX-CODE = "G" GO TO GEORGIA.
     IF MSTR-STATE-TAX-CODE = "V" GO TO VIRGINIA.
     IF MSTR-STATE-TAX-CODE = "E" GO TO MASSACHUSETTS.
     IF MSTR-STATE-TAX-CODE = "M" GO TO MARYLAND.
     IF MSTR-STATE-TAX-CODE = "C" GO TO NORTH-CAROLINA.
     IF MSTR-STATE-TAX-CODE = "Y" GO TO NEW-YORK.
     IF MSTR-STATE-TAX-CODE EQUAL TO "P" GO TO PENNSYLVANIA.
     IF MSTR-STATE-TAX-CODE IS EQUAL TO "W" GO TO 328200.
     IF MSTR-STATE-TAX-CODE EQUAL TO "F" GO TO OHIO.
     IF MSTR-STATE-TAX-CODE EQUAL TO "A" OR "D" OR "T"
         MULTIPLY FED-TAXES BY +.10,
             GIVING STATE-TAXES ROUNDED,
                 GO TO 330010.
     IF MSTR-STATE-TAX-CODE EQUAL TO "R"
         MULTIPLY FED-TAXES BY +.15
         GIVING STATE-TAXES ROUNDED
         GO TO 330010.
     IF MSTR-STATE-TAX-CODE = "J" OR "K"  GO TO SOUTH-CAROLINA.
     IF MSTR-STATE-TAX-CODE EQUAL TO "S",
             MULTIPLY FED-TAXES BY +.09,
             GIVING STATE-TAXES ROUNDED,
                 GO TO 330010.
     IF MSTR-STATE-TAX-CODE EQUAL TO "U",
         MULTIPLY FED-TAXES BY +.14,
             GIVING STATE-TAXES ROUNDED GO TO 330010.
     GO TO 330020.
PENNSYLVANIA.
     MULTIPLY ST-CURR-EARNED BY .023 GIVING STATE-TAXES ROUNDED.
     IF DEP-ALLOW EQUAL TO ZEROS GO TO END-ECOAST-TAXES.
     ADD DEP-ALLOW TO STATE-TAXES.
     GO TO END-ECOAST-TAXES.
ALABAMA.
     MULTIPLY ST-CURR-EARNED BY +26 GIVING YRLY-GROSS.
     MULTIPLY YRLY-GROSS BY +.07 GIVING YRLY-ADJ-GROSS.
     IF +500.00 IS LESS THAN YRLY-ADJ-GROSS MOVE +500.00 TO
     YRLY-ADJ-GROSS.
     SUBTRACT YRLY-ADJ-GROSS FROM YRLY-GROSS.
     MULTIPLY FED-TAXES BY +26 GIVING YRLY-FED-TAXES.
     SUBTRACT YRLY-FED-TAXES FROM YRLY-GROSS GIVING YRLY-NET.
     IF ALLOWANCE GREATER YRLY-NET GO TO END-ECOAST-TAXES.
     SUBTRACT ALLOWANCE FROM YRLY-NET GIVING TAXABLE.
     IF TAXABLE IS NOT GREATER THAN +1000.00 GO TO ALA-1.
     MOVE +15.00 TO STATAX-1.
     SUBTRACT +1000.00 FROM TAXABLE.
     IF TAXABLE IS NOT GREATER THAN +2000.00 GO TO ALA-2.
     MOVE +60.00 TO STATAX-2.
     SUBTRACT +2000.00 FROM TAXABLE.
     IF TAXABLE IS NOT GREATER THAN +2000.00 GO TO ALA-3.
     MOVE +90.00 TO STATAX-3.
     SUBTRACT +2000.00 FROM TAXABLE.
     MULTIPLY TAXABLE BY +.05 GIVING STATAX-4.
     GO TO FINISH-ALAGAVANC.
ALA-1.
     MULTIPLY TAXABLE BY +.015 GIVING STATAX-1.
     GO TO FINISH-ALAGAVANC.
ALA-2.
     MULTIPLY TAXABLE BY +.03 GIVING STATAX-2.
     GO TO FINISH-ALAGAVANC.
ALA-3.
     MULTIPLY TAXABLE BY +.045 GIVING STATAX-3.
FINISH-ALAGAVANC.
     ADD STATAX-1, STATAX-2, STATAX-3, STATAX-4, STATAX-5,
     STATAX-6 GIVING YEARLY-STATAX.
     DIVIDE +26 INTO YEARLY-STATAX GIVING STATE-TAXES ROUNDED.
END-ECOAST-TAXES.
     MOVE ZEROS TO ST-CURR-EARNED.
     MOVE +000000.00 TO YRLY-GROSS.
     MOVE ZEROS TO YRLY-ADJ-GROSS.
     MOVE +000000.00 TO YRLY-FED-TAXES.
     MOVE +00000.00 TO HALF-FED.
     MOVE +000000.00 TO YRLY-NET.
     MOVE +0000.00 TO ALLOWANCE.
     MOVE ZEROS TO TAXABLE.
     MOVE ZEROS TO STATAX-1.
     MOVE ZEROS TO STATAX-2.
     MOVE ZEROS TO STATAX-3.
     MOVE ZEROS TO STATAX-4.
     MOVE ZEROS TO STATAX-5.
     MOVE ZEROS TO STATAX-6.
     MOVE ZEROS TO YEARLY-STATAX.
     MOVE 0 TO NY-CTR.
     GO TO 330010.
GEORGIA.
     MULTIPLY ST-CURR-EARNED BY .15 GIVING STATAX-1.
     IF 80.00 IS LESS THAN STATAX-1 MOVE 80.00 TO STATAX-1.
     IF 50.00 IS GREATER THAN STATAX-1 MOVE 50.00 TO STATAX-1.
     SUBTRACT STATAX-1 FROM ST-CURR-EARNED GIVING TAXABLE.
     IF DEP-ALLOW IS EQUAL TO ZERO GO TO GA-1
         ELSE SUBTRACT 1 FROM DEP-ALLOW.
     MULTIPLY DEP-ALLOW BY 27.00 GIVING STATAX-2.
     IF MARRIED-MSTR ADD 115.00 TO STATAX-2
         ELSE ADD 57.50 TO STATAX-2.
     SUBTRACT STATAX-2 FROM TAXABLE.
GA-1.
     IF TAXABLE IS NOT GREATER THAN ZERO
         MOVE ZEROS TO STATE-TAXES
         GO TO END-ECOAST-TAXES.
     IF NOT MARRIED-MSTR GO TO GA-2.
     IF TAXABLE IS NOT GREATER THAN 40.00
         MULTIPLY .01 BY TAXABLE GIVING STATE-TAXES ROUNDED
         GO TO END-ECOAST-TAXES.
     IF TAXABLE IS NOT GREATER THAN 115.00
         SUBTRACT 40.00 FROM TAXABLE
         MULTIPLY .02 BY TAXABLE ROUNDED
         ADD .40    TAXABLE GIVING STATE-TAXES
         GO TO END-ECOAST-TAXES.
     IF TAXABLE IS NOT GREATER THAN 192.00
         SUBTRACT 115.00 FROM TAXABLE
         MULTIPLY .04 BY TAXABLE ROUNDED
         ADD 2.00    TAXABLE GIVING STATE-TAXES
         GO TO END-ECOAST-TAXES.
     IF TAXABLE IS NOT GREATER THAN 269.00
         SUBTRACT 192.00 FROM TAXABLE
         MULTIPLY .04 BY TAXABLE ROUNDED
         ADD 4.30    TAXABLE GIVING STATE-TAXES
         GO TO END-ECOAST-TAXES.
     IF TAXABLE IS NOT GREATER THAN 385.00
         SUBTRACT 269.00 FROM TAXABLE
         MULTIPLY .05 BY TAXABLE ROUNDED
         ADD 7.35    TAXABLE GIVING STATE-TAXES
         GO TO END-ECOAST-TAXES.
     SUBTRACT 385.00 FROM TAXABLE.
     MULTIPLY .06 BY TAXABLE ROUNDED.
     ADD 13.10    TAXABLE GIVING STATE-TAXES.
     GO TO END-ECOAST-TAXES.
GA-2.
     IF TAXABLE IS NOT GREATER THAN 29.00
         MULTIPLY .01 BY TAXABLE GIVING STATE-TAXES ROUNDED
         GO TO END-ECOAST-TAXES.
     IF TAXABLE IS NOT GREATER THAN 86.50
         SUBTRACT 29.00 FROM TAXABLE
         MULTIPLY .02 BY TAXABLE ROUNDED
         ADD .29    TAXABLE GIVING STATE-TAXES
         GO TO END-ECOAST-TAXES.
     IF TAXABLE IS NOT GREATER THAN 144.25
         SUBTRACT 86.50  FROM TAXABLE
         MULTIPLY .03 BY TAXABLE ROUNDED
         ADD 1.44    TAXABLE GIVING STATE-TAXES
         GO TO END-ECOAST-TAXES.
     IF TAXABLE IS NOT GREATER THAN 202.00
         SUBTRACT 144.25 FROM TAXABLE
         MULTIPLY .04 BY TAXABLE ROUNDED
         ADD 3.17    TAXABLE GIVING STATE-TAXES
         GO TO END-ECOAST-TAXES.
     IF TAXABLE IS NOT GREATER THAN 269.25
         SUBTRACT 202.00 FROM TAXABLE
         MULTIPLY .05 BY TAXABLE ROUNDED
         ADD 5.48    TAXABLE GIVING STATE-TAXES
         GO TO END-ECOAST-TAXES.
     SUBTRACT 269.25 FROM TAXABLE.
     MULTIPLY .06 BY TAXABLE ROUNDED.
     ADD 8.85     TAXABLE GIVING STATE-TAXES.
     GO TO END-ECOAST-TAXES.
VIRGINIA.
     COMPUTE YRLY-ADJ-GROSS ROUNDED =
         (ST-CURR-EARNED * 26) - (+650.00 +
         (+600.00 * MSTR-ST-TAX-EXEM-CD)).
     IF YRLY-ADJ-GROSS IS NOT GREATER THAN ZERO
         MOVE ZEROS TO STATE-TAXES
         GO TO END-ECOAST-TAXES.
     IF YRLY-ADJ-GROSS IS GREATER THAN +12000.00
         SUBTRACT +12000.00 FROM YRLY-ADJ-GROSS GIVING STATAX-1
         MULTIPLY STATAX-1 BY +.0575 GIVING STATAX-2 ROUNDED
         ADD +470.00  STATAX-2 GIVING YEARLY-STATAX
         GO TO VA-1.
     IF YRLY-ADJ-GROSS IS GREATER THAN +5000.00
         SUBTRACT +5000.00  FROM YRLY-ADJ-GROSS GIVING STATAX-1
         MULTIPLY STATAX-1 BY +.05   GIVING STATAX-2 ROUNDED
         ADD +120.00  STATAX-2 GIVING YEARLY-STATAX
         GO TO VA-1.
     IF YRLY-ADJ-GROSS IS GREATER THAN +3000.00
         SUBTRACT +3000.00  FROM YRLY-ADJ-GROSS GIVING STATAX-1
         MULTIPLY STATAX-1 BY +.03   GIVING STATAX-2 ROUNDED
         ADD +60.00   STATAX-2 GIVING YEARLY-STATAX
         GO TO VA-1.
     MULTIPLY YRLY-ADJ-GROSS BY +.02
         GIVING YEARLY-STATAX ROUNDED.
VA-1.
     DIVIDE +26 INTO YEARLY-STATAX GIVING STATE-TAXES ROUNDED.
     GO TO END-ECOAST-TAXES.
MASSACHUSETTS.
     IF MSTR-ST-TAX-EXEM-CD EQUALS 00 GO TO MASS-1.
     MULTIPLY MSTR-ST-TAX-EXEM-CD BY +23.00 GIVING ALLOWANCE.
     ADD +56.00 TO ALLOWANCE.
     IF ALLOWANCE GREATER ST-CURR-EARNED GO TO END-ECOAST-TAXES.
     SUBTRACT ALLOWANCE FROM ST-CURR-EARNED.
MASS-1.
     DIVIDE +2 INTO FED-TAXES GIVING HALF-FED.
     SUBTRACT HALF-FED FROM ST-CURR-EARNED.
     SUBTRACT RETIRE-FICA FROM ST-CURR-EARNED GIVING TAXABLE.
     MULTIPLY TAXABLE BY +.04 GIVING STATE-TAXES ROUNDED.
     GO TO END-ECOAST-TAXES.
MARYLAND.
     MULTIPLY MSTR-ST-TAX-EXEM-CD BY +31.00 GIVING ALLOWANCE.
     MULTIPLY ST-CURR-EARNED BY +.10 GIVING YRLY-ADJ-GROSS.
     IF +20.00 IS LESS THAN YRLY-ADJ-GROSS MOVE +20.00 TO
     YRLY-ADJ-GROSS.
     SUBTRACT YRLY-ADJ-GROSS FROM ST-CURR-EARNED GIVING
     YRLY-GROSS.
     IF ALLOWANCE GREATER YRLY-GROSS GO TO END-ECOAST-TAXES.
     SUBTRACT ALLOWANCE FROM YRLY-GROSS GIVING TAXABLE.
     IF TAXABLE IS NOT GREATER THAN +38.00 GO TO MD-1.
     IF TAXABLE IS NOT GREATER THAN +76.00 GO TO MD-2.
     IF TAXABLE IS NOT GREATER THAN +115.00 GO TO MD-3.
     SUBTRACT 115.00 FROM TAXABLE.
     MULTIPLY TAXABLE BY +.06 GIVING STATAX-1 ROUNDED.
     ADD +4.15, STATAX-1 GIVING STATE-TAXES.
     GO TO END-ECOAST-TAXES.
MD-1.
     MULTIPLY TAXABLE BY +.024 GIVING STATE-TAXES ROUNDED.
     GO TO END-ECOAST-TAXES.
MD-2.
     SUBTRACT +38.00 FROM TAXABLE.
     MULTIPLY TAXABLE BY +.036 GIVING STATAX-1 ROUNDED.
     ADD +.92, STATAX-1 GIVING STATE-TAXES.
     GO TO END-ECOAST-TAXES.
MD-3.
     SUBTRACT +76.00 FROM TAXABLE.
     MULTIPLY TAXABLE BY +.048 GIVING STATAX-1 ROUNDED.
     ADD +2.31, STATAX-1 GIVING STATE-TAXES.
     GO TO END-ECOAST-TAXES.
OHIO.
     IF DEP-ALLOW IS GREATER THAN 06
         MOVE 06 TO DEP-ALLOW.
     COMPUTE YRLY-ADJ-GROSS ROUNDED =
         (ST-CURR-EARNED * 26) - (+500.00 * DEP-ALLOW)
     IF YRLY-ADJ-GROSS GREATER THAN +15000.00
         GO TO OHIO-2.
     IF YRLY-ADJ-GROSS GREATER THAN +10000.00
         COMPUTE STATE-TAXES ROUNDED =
             ((YRLY-ADJ-GROSS - +10000.00) * .02 + +75.00)
                 / +26.00
         GO TO OHIO-1.
     IF YRLY-ADJ-GROSS GREATER THAN +5000.00
         COMPUTE STATE-TAXES ROUNDED =
             ((YRLY-ADJ-GROSS - +5000.00) * .01 + +25.00) / +26.00
         GO TO OHIO-1.
     COMPUTE STATE-TAXES ROUNDED =
         (YRLY-ADJ-GROSS * .005) / +26.00.
OHIO-1.
     MOVE +00000.00 TO ST-CURR-EARNED.
     MOVE +00000.00 TO YRLY-ADJ-GROSS.
     GO TO 330010.
OHIO-2.
     IF YRLY-ADJ-GROSS GREATER THAN +40000.00
         COMPUTE STATE-TAXES ROUNDED =
             ((YRLY-ADJ-GROSS - +40000.00) * .035 + +900.00)
                 / +26.00
         GO TO OHIO-1.
     IF YRLY-ADJ-GROSS GREATER THAN +20000.00
         COMPUTE STATE-TAXES ROUNDED =
             ((YRLY-ADJ-GROSS - +20000.00) * .03 + +300.00)
                 / +26.00
         GO TO OHIO-1.
     COMPUTE STATE-TAXES ROUNDED =
         ((YRLY-ADJ-GROSS - +15000.00) * .025 + +175.00) / +26.00
         GO TO OHIO-1.
NEW-YORK.
     MOVE 1 TO NY-CTR.
     IF ST-CURR-EARNED IS LESS THAN 275.00 SUBTRACT 13.50
          FROM ST-CURR-EARNED GO TO NY-A.
     IF ST-CURR-EARNED IS GREATER THAN 550.00 SUBTRACT 52.00
          FROM ST-CURR-EARNED GO TO NY-A.
     MULTIPLY ST-CURR-EARNED BY .14 GIVING ALLOWANCE.
     SUBTRACT 25.00 FROM ALLOWANCE.
     SUBTRACT ALLOWANCE FROM ST-CURR-EARNED.
NY-A.
     MULTIPLY MSTR-ST-TAX-EXEM-CD BY 25.00 GIVING ALLOWANCE.
     IF ALLOWANCE > ST-CURR-EARNED GO TO NY-ZERO.
     SUBTRACT ALLOWANCE FROM ST-CURR-EARNED GIVING STATAX-1.
     IF STATAX-1 < NY-WAGE (NY-CTR) GO TO NY-ZERO.

NY-1.
     ADD 1 TO NY-CTR.
     IF STATAX-1 < NY-WAGE (NY-CTR) GO TO NY-2.
     IF NY-CTR > 13 GO TO NY-3.
     GO TO NY-1.

NY-2.
     SUBTRACT 1 FROM NY-CTR.

NY-3.
     MOVE NY-WAGE (NY-CTR) TO STATAX-2.
     MOVE NY-ST-TAX (NY-CTR) TO STATAX-3.
     MOVE NY-PCAMT (NY-CTR) TO TAX-PC.
     COMPUTE STATE-TAXES ROUNDED =
       ((STATAX-1 - STATAX-2) * TAX-PC) + STATAX-3.
     GO TO END-ECOAST-TAXES.

NY-ZERO.
     MOVE 000.00 TO STATE-TAXES.
     GO TO END-ECOAST-TAXES.

SOUTH-CAROLINA.
     MULTIPLY MSTR-ST-TAX-EXEM-CD BY +3.84 GIVING ALLOWANCE.
     MULTIPLY ST-CURR-EARNED BY +.10 GIVING YRLY-ADJ-GROSS.
     IF MSTR-STATE-TAX-CODE = "K" GO TO SC-JOINT.
     IF YRLY-ADJ-GROSS > +19.20
     MOVE +19.20 TO YRLY-ADJ-GROSS.
     GO TO SC-COMMON.

SC-JOINT.
     IF YRLY-ADJ-GROSS > +38.40
       MOVE +38.40 TO YRLY-ADJ-GROSS.

SC-COMMON.
     COMPUTE TAXABLE = ST-CURR-EARNED -     ALLOWANCE
       -     YRLY-ADJ-GROSS.
     IF TAXABLE IS GREATER THAN +76.92 GO TO SC-1.
     MULTIPLY TAXABLE BY +.02 GIVING STATE-TAXES ROUNDED.
     GO TO END-ECOAST-TAXES.

SC-1.
     COMPUTE STATE-TAXES ROUNDED = (TAXABLE * +.000065 + +.0158)
       * TAXABLE.
     GO TO END-ECOAST-TAXES.


NORTH-CAROLINA.
     IF ST-CURR-EARNED > +620.00 GO TO NC-LUMP.
     COMPUTE ALLOWANCE = DEP-ALLOW * +3.84.
     MULTIPLY ST-CURR-EARNED BY +.10 GIVING YRLY-ADJ-GROSS.
     IF YRLY-ADJ-GROSS > +19.20
       MOVE +19.20 TO YRLY-ADJ-GROSS.
     COMPUTE TAXABLE = ST-CURR-EARNED -
       (ALLOWANCE + YRLY-ADJ-GROSS).
     COMPUTE STATE-TAXES ROUNDED =
       ((TAXABLE * +.00005194) + +.028117) * TAXABLE.
     GO TO END-ECOAST-TAXES.

NC-LUMP.
     SUBTRACT +619.00 FROM ST-CURR-EARNED.
     MULTIPLY ST-CURR-EARNED BY +.07 GIVING STATE-TAXES ROUNDED.
     MOVE 01 TO TAXER.

NC-SEARCH.
     IF MSTR-ST-TAX-EXEM-CD = EX-EM (TAXER) GO TO NC-ADD.
     IF TAXER LESS THAN 34 ADD 01 TO TAXER GO TO NC-SEARCH.
     ADD +12.00 TO STATE-TAXES.
     GO TO END-ECOAST-TAXES.

NC-ADD.
     ADD EX-AMT (TAXER) TO STATE-TAXES.
     GO TO END-ECOAST-TAXES.
328200.
     IF WRITE-CASH-AWARD OR CD10-TAX-ADJ
         MULTIPLY CURR-EARNED BY .03
             GIVING STATE-TAXES ROUNDED
         GO TO 330030.
     MOVE +00000.00 TO HRLY-RATE-WORK.
     IF MARRIED-MSTR GO TO 328210.
     MOVE -00038.46 TO HRLY-RATE-WORK.
     GO TO 328220.
328210.
     IF MSTR-TAX-CODE GREATER THAN 1
         MOVE -00076.92 TO HRLY-RATE-WORK
         ELSE      MOVE -00038.46 TO HRLY-RATE-WORK.
328220.
     ADD CURR-EARNED TO HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE GO TO 328230.
328225.
     MOVE +00000.00 TO HRLY-RATE-WORK.
     GO TO 328290.
328230.
     IF HRLY-RATE-WORK NOT GREATER THAN +00001.00
         GO TO 328225.
     IF MARRIED-MSTR
         MOVE 10 TO SUBS-1
         MOVE 11 TO SUBS-2
         MOVE 11 TO SUBS-3

         GO TO 328240.
     MOVE 01 TO SUBS-1, SUBS-2, SUBS-3.
328240.
     IF HRLY-RATE-WORK NOT GREATER THAN CALIF-WAGES (SUBS-1)
         SUBTRACT +01.00 FROM HRLY-RATE-WORK.
328250.
     SUBTRACT CALIF-WAGES (SUBS-1) FROM HRLY-RATE-WORK.
     IF HRLY-RATE-WORK POSITIVE
         GO TO 328270.
     ADD CALIF-WAGES (SUBS-1) TO HRLY-RATE-WORK.
328260.
     MULTIPLY CALIF-EXCESS-PERCENT (SUBS-3) BY HRLY-RATE-WORK
         ROUNDED.
     ADD CALIF-TAX (SUBS-2) TO HRLY-RATE-WORK.
     GO TO 328280.
328270.
     ADD 1 TO SUBS-1, SUBS-2, SUBS-3.
     IF SUBS-3 EQUAL TO 10  OR 20
         GO TO 328260.
     GO TO 328250.
328280.
     IF MSTR-TAX-CODE ZERO GO TO 328290.
     IF MSTR-TAX-CODE GREATER THAN 10
         MOVE 10 TO SUBS-4
         ELSE      MOVE MSTR-TAX-CODE TO SUBS-4.
     IF MARRIED-MSTR ADD 10 TO SUBS-4.
     SUBTRACT CALIF-CREDIT (SUBS-4) FROM HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE GO TO 328225.
328290.
     MOVE HRLY-RATE-WORK TO STATE-TAXES.
     GO TO 330010.
330010.
     IF STATE-TAXES NEGATIVE MOVE ZEROS TO STATE-TAXES.
330020.
     IF MSTR-ADDL-ST-TAX EQUALS ZEROS OR SPACES GO TO 330030.
     ADD MSTR-ADDL-ST-TAX TO STATE-TAXES.
330030.
     IF STATE-ADJUSTMENT
         GO TO 330140.
330040.
     SUBTRACT STATE-TAXES FROM NET-PAY,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         ADD HRLY-RATE-WORK TO STATE-TAXES,
         ALTER 198140 TO PROCEED TO 330040,
             GO TO 268100.
         MOVE HRLY-RATE-WORK TO NET-PAY.
         ADD STATE-TAXES TO MSTR-ST-QTRLY-TAX.
         ADD STATE-TAXES TO MSTR-YTD-STATE-TAX.
             GO TO 332120.
330140.
     ADD ADJ-STATE TO STATE-TAXES.
     IF STATE-TAXES ZERO,
         GO TO 332120.
     IF STATE-TAXES POSITIVE,
         GO TO 330040.
     ALTER 198140 TO PROCEED TO 330040.
     MOVE STATE-TAXES TO MSG7-AMT.
         GO TO 284210.

     NOTE *******************************************************
          *                                                     *
          *  UNION DUES DEDUCTION ROUTINE                       *
          *                                                     *
          *******************************************************.

332120.
     IF WRITE-CASH-AWARD,
         GO TO 338170.
     IF WK1-SUBJECT ZERO,
         GO TO 336112.
332170.
     IF MSTR-UNION EQUAL TO SPACE GO TO 336190.
     SET AKEY TO 1.
     SEARCH UNION-CON VARYING AKEY  AT END GO TO 334100
         WHEN MSTR-UNION EQUAL TO UNION-CODE (AKEY)
         MOVE UNION-DUE (AKEY) TO UNION-DUES.

334100.
     IF PAYOFF-LWOP  MOVE +000.00 TO UNION-DUES.
     IF UNION-ADJUSTMENT,
         GO TO 336030.
334130.
     IF UNION-DUES GREATER THAN NET-PAY
         MOVE ZEROS TO UNION-DUES GO TO 336190.
     SUBTRACT UNION-DUES FROM NET-PAY,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         ADD HRLY-RATE-WORK TO UNION-DUES,
         ALTER 198140 TO PROCEED TO 334130,
             GO TO 268100.
         MOVE HRLY-RATE-WORK TO NET-PAY.
         ADD UNION-DUES TO MSTR-YTD-UNION.
             GO TO 336190.
336030.
     ADD ADJ-UNION TO UNION-DUES.
     IF UNION-DUES ZERO,
         GO TO 336190.
     IF UNION-DUES POSITIVE,
         GO TO 334130.
     ALTER 198140 TO PROCEED TO 334130.
     MOVE UNION-DUES TO MSG7-AMT.
         GO TO 284210.
336112.
     IF NOT FICA-MSTR,
         GO TO 336190.
     GO TO 336190.

     NOTE *******************************************************
          *                                                     *
          *  CHARITABLE CONTRIBUTION DEDUCTION ROUTINE          *
          *                                                     *
          *******************************************************.

336190.
     IF DECEASED-PAYOFF,
         GO TO 338170.
     MOVE MSTR-CHARITABLE TO CHARITY-CON.
     IF PAYOFF-LWOP  MOVE +000.00 TO CHARITY-CON.
     IF CHARITY-ADJ,
         GO TO 337000.
     IF CHARITY-CON ZERO GO TO 338120.
336195.
     SUBTRACT CHARITY-CON FROM NET-PAY
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         MOVE ZEROS TO CHARITY-CON
         GO TO 338120.
     MOVE HRLY-RATE-WORK TO NET-PAY.
     ADD CHARITY-CON TO MSTR-YTD-CHARITY.
     GO TO 338120.
337000.
     ADD ADJ-CHARITY TO CHARITY-CON.
     IF CHARITY-CON ZERO GO TO 338120.
     IF CHARITY-CON POSITIVE GO TO 336195.
     ALTER 198140 TO PROCEED TO 336195.
     MOVE CHARITY-CON TO MSG7-AMT.
     GO TO 284210.

     NOTE *******************************************************
          *                                                     *
          *  SAVINGS ALLOTMENT 1 AND 2 DEDUCTION ROUTINE        *
          *                                                     *
          *******************************************************.

338120.
     MOVE MSTR-ALLOT1-DED TO ALLOT1-WORK.
     MOVE MSTR-ALLOT2-DED TO ALLOT2-WORK.
     IF PAYOFF-LWOP MOVE +000 TO ALLOT1-WORK ALLOT2-WORK.
     IF ALLOT1-ADJ,
     GO TO 338150.
     IF ALLOT2-ADJ,
        GO TO 338150.
     IF ALLOT1-WORK ZERO AND ALLOT2-WORK ZERO GO TO 338170.
     ADD ALLOT1-WORK ALLOT2-WORK GIVING ALLOT-DED.
338125.
     SUBTRACT ALLOT-DED FROM NET-PAY,
         GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE,
         MOVE +00000 TO ALLOT-DED,
         GO TO 338170.
     MOVE HRLY-RATE-WORK TO NET-PAY.
     ADD ALLOT1-WORK TO MSTR-YTD-ALLOT1-DED.
     ADD ALLOT2-WORK TO MSTR-YTD-ALLOT2-DED.

     GO TO 338170.

338150.
     IF ALLOT1-ADJ ADD ADJ-TO-ALLOT1 TO ALLOT1-WORK.
     IF ALLOT2-ADJ ADD ADJ-TO-ALLOT2 TO ALLOT2-WORK.
     ADD ALLOT1-WORK ALLOT2-WORK GIVING ALLOT-DED.
     IF ALLOT-DED ZERO GO TO 338170.
     IF ALLOT-DED POSITIVE GO TO 338125.
     ALTER 198140 TO PROCEED TO 338125.
     MOVE ALLOT-DED TO MSG7-AMT.
     GO TO 284210.

     NOTE *******************************************************
          *                                                     *
          *  PREPARATION OF PAYROLL SMOOTH ROLL                 *
          *                                                     *
          *******************************************************.

338170.
     IF SR-LINE-COUNT NOT ZERO,
         GO TO 346060.

SRNOTE1.
     NOTE *******************************************************
          *                                                     *
          *  PREPARE SMOOTH ROLL HEADING LINES                  *
          *                                                     *
          *******************************************************.

340170.
     MOVE ALL SPACES TO SMOOTH-ROLL-REC.
     WRITE SMOOTH-ROLL-REC BEFORE ADVANCING NEXT-PAGE.
342010.
     MOVE DEPT-NAME TO SR-DEPT.
     MOVE WB-MONTH TO SR-FROM-MO.
     MOVE WB-DAY TO SR-FROM-DAY.
     MOVE WE-MONTH TO SR-TO-MO.
     MOVE WE-DAY TO SR-TO-DAY.
     MOVE "-" TO SR-DASH1, SR-DASH2.
     MOVE DISBURSING-CODE TO SR-DO-SYMBOL.
     WRITE SMOOTH-ROLL-REC BEFORE ADVANCING 2 LINES.
     MOVE SPACES TO SMOOTH-ROLL-REC.
     ADD 002 TO SR-LINE-COUNT.
342110.
     MOVE ACTY-NAME-LOC TO SR-LOCATION.
     MOVE "CPR" TO SR-CPR-KON.
     MOVE ROLL-NO TO SR-ROLL-NO.
     MOVE "YEAR" TO SR-YEAR-KON.
     MOVE WE-YEAR TO SR-PERIOD-YEAR.
     MOVE MINOR-ACTIVITY TO SR-ACTY-CODE.
     MOVE MINOR-CONTROL TO SR-CNTL-GRP.
     MOVE 01 TO SUBS-4.
342200.
     IF MINOR-ACTIVITY EQUAL TO SR-ACT-CODE (SUBS-4),
         MOVE SR-LOCATION-HDR (SUBS-4) TO SR-ACTIVITY,
             GO TO 342250.
     IF SUBS-4 GREATER THAN 25 GO TO 342250.
     ADD 01 TO SUBS-4, GO TO 342200.
342250.
     MOVE 01 TO SUBS-4.
     IF ANNUM-MSTR MOVE "GRADED" TO SR-UG-LITERAL
         ELSE MOVE "UNGRADED" TO SR-UG-LITERAL.
     MOVE "PAGE NO. " TO SR-PAGE-KON.
     ADD 00001 TO SR-PAGE-COUNT.
     MOVE SR-PAGE-COUNT TO SR-PAGE-NO.
     WRITE SMOOTH-ROLL-REC BEFORE ADVANCING 3 LINES.
     ADD 03 TO SR-LINE-COUNT.
     MOVE SPACES TO SMOOTH-ROLL-REC.
344140.
     MOVE "ADD'L" TO SR-ADDL-KON.
     WRITE SMOOTH-ROLL-REC BEFORE ADVANCING 1 LINES.
     ADD 01 TO SR-LINE-COUNT.
344150.
     MOVE "F TAX" TO SR-ADDL-KON.
     WRITE SMOOTH-ROLL-REC BEFORE ADVANCING 3 LINES.
     MOVE "ADD'L" TO SR-ADDL-KON.
     WRITE SMOOTH-ROLL-REC BEFORE ADVANCING 1 LINES.
     MOVE "S TAX" TO SR-ADDL-KON.
     WRITE SMOOTH-ROLL-REC BEFORE ADVANCING 2 LINES.
     ADD 06 TO SR-LINE-COUNT.
     MOVE SPACES TO SMOOTH-ROLL-REC.
34415E.
     EXIT.
344160.
         GO TO 346060.

     NOTE *******************************************************
          *                                                     *
          *  PREPARE SMOOTH ROLL DETAIL PRINT LINE 1            *
          *      PRINT EARNINGS AND VARIABLE DEDUCTIONS         *
          *                                                     *
          *******************************************************.

346060.
     ADD +1 TO PT-EMP-CTR.
     ADD +1 TO CG-EMP-CTR.
     ADD +1 TO AT-EMP-CTR.
     ADD +1 TO PGT-EMP-CTR.
     MOVE MSTR-NAME TO SR-NAME.
     MOVE MSTR-BANK-DEP-CODE TO SR-BANK-CODE.
     MOVE MSTR-CLOCK-NO TO SR-CLOCK-NO.
     IF NOT WRITE-CASH-AWARD,
         ADD MSTR-HOURLY-RATE TO PT-RATE,
         ADD MSTR-HOURLY-RATE TO CG-RATE.
         ADD MSTR-HOURLY-RATE TO AT-RATE.
         ADD MSTR-HOURLY-RATE TO PGT-RATE.
     MOVE MSTR-HOURLY-RATE TO SR-HOURLY-RATE.
     IF WRITE-TAX-LEVY,
         WRITE SMOOTH-ROLL-REC BEFORE ADVANCING 1 LINES,
           MOVE SPACES TO SMOOTH-ROLL-REC,
             ADD 001 TO SR-LINE-COUNT,
                 GO TO 356140.
     IF ADJ-REG-HRS NOT ZERO,
         ADD ADJ-REG-HRS TO REG-HRS-WK1,
         MOVE +000.00 TO ADJ-REG-HRS.
     MOVE REG-HRS-WK1 TO SR-REG-HOURS.
     ADD REG-HRS-WK1 TO PT-REG-HRS.
     ADD REG-HRS-WK1 TO CG-REG-HRS.
     ADD REG-HRS-WK1 TO AT-REG-HRS.
     ADD REG-HRS-WK1 TO PGT-REG-HRS.
     ADD REG-HRS-WK1 TO BASIC-HOURS.
     IF REG-MONEY NOT ZERO,
         ADD REG-MONEY TO PT-REG-PAY,
         ADD REG-MONEY TO CG-REG-PAY,
         ADD REG-MONEY TO AT-REG-PAY,
         ADD REG-MONEY TO PGT-REG-PAY,
         MOVE REG-MONEY TO SR-REG-PAY.
     IF ADJ-OT-HOURS NOT ZERO,
         ADD ADJ-OT-HOURS TO OT-HRS-WK1,
         MOVE +000.00 TO ADJ-OT-HOURS.
     IF DIEM-MSTR,
         GO TO 352072.
     IF GS-GRADED-MSTR,
         GO TO 352090.
352072.
     ADD OT-HRS-WK2 TO OT-HRS-WK1.
352090.
     ADD OT-HRS-WK1 TO PT-OT-HRS.
     ADD OT-HRS-WK1 TO CG-OT-HRS.
     ADD OT-HRS-WK1 TO AT-OT-HRS.
     ADD OT-HRS-WK1 TO PGT-OT-HRS.
     ADD OT-HRS-WK1 TO OVERTIME-HOURS.
     MOVE OT-HRS-WK1 TO SR-OT-HOURS.
     IF OT-MONEY NOT ZERO,
         ADD OT-MONEY TO PT-OT-PAY,
         ADD OT-MONEY TO CG-OT-PAY,
         ADD OT-MONEY TO AT-OT-PAY,
         ADD OT-MONEY TO PGT-OT-PAY,
         MOVE OT-MONEY TO SR-OT-MONEY.
     IF MSTR-FF-CODE EQUAL TO "1" OR "2" OR "6"
         MOVE MSTR-FF-CODE TO SR-EXC-CODE
         GO TO 352095.
     MOVE MSTR-OTHER-PAY-CODE TO SR-EXC-CODE.
352095.
     IF OTHER-HOURS NOT ZERO,
         ADD OTHER-HOURS TO PT-OTH-HRS,
         ADD OTHER-HOURS TO CG-OTH-HRS,
         ADD OTHER-HOURS TO AT-OTH-HRS,
         ADD OTHER-HOURS TO PGT-OTH-HRS,
         ADD OTHER-HOURS TO BASIC-HOURS,
         MOVE OTHER-HOURS TO SR-OTHER-HOURS.
     IF OTHER-MONEY NOT ZERO,
         ADD OTHER-MONEY TO PT-OTH-PAY,
         ADD OTHER-MONEY TO CG-OTH-PAY,
         ADD OTHER-MONEY TO AT-OTH-PAY,
         ADD OTHER-MONEY TO PGT-OTH-PAY,
         MOVE OTHER-MONEY TO SR-OTHER-MONEY.
     IF RETIRE-FICA ZERO,
             GO TO 356030.
         IF FICA-MSTR,
             ADD RETIRE-FICA TO PT-FICA,
             ADD RETIRE-FICA TO CG-FICA,
             ADD RETIRE-FICA TO AT-FICA,
             ADD RETIRE-FICA TO PGT-FICA,
             MOVE RETIRE-FICA TO SR-FICA,
                 GO TO 356030.
             ADD RETIRE-FICA TO PT-CSRA.
             ADD RETIRE-FICA TO CG-CSRA.
             ADD RETIRE-FICA TO AT-CSRA.
             ADD RETIRE-FICA TO PGT-CSRA.
             MOVE RETIRE-FICA TO SR-CSRA.
356030.
     IF NOT WRITE-CASH-AWARD,
         MOVE MSTR-MARRIED-CODE TO SR-FED-MAR-CODE,
         MOVE MSTR-TAX-CODE TO SR-TAX-CODE.
     IF MSTR-ADDED-TAX NOT ZERO,
         MOVE MSTR-ADDED-TAX TO SR-ADDED-TAX.
     IF FED-TAXES NOT ZERO,
         ADD FED-TAXES TO PT-FED-TAX,
         ADD FED-TAXES TO CG-FED-TAX,
         ADD FED-TAXES TO AT-FED-TAX,
         ADD FED-TAXES TO PGT-FED-TAX,
         MOVE FED-TAXES TO SR-FED-TAX.
     IF STATE-TAXES NOT ZERO,
         MOVE MSTR-ST-TAX-EXEM-CD TO SR-STATE-EXC
         MOVE MSTR-STATE-TAX-CODE TO SR-STATE-TAX-CODE
         ADD STATE-TAXES TO PT-ST-TAX,
     ADD STATE-TAXES TO CG-ST-TAX,
         ADD STATE-TAXES TO AT-ST-TAX,
     ADD STATE-TAXES TO PGT-ST-TAX,
         MOVE STATE-TAXES TO SR-STATE-TAX.
     IF WRITE-CASH-AWARD MOVE "CASH AWARD" TO SR-FILLER.
     WRITE SMOOTH-ROLL-REC BEFORE ADVANCING 1 LINES.
     MOVE SPACES TO SMOOTH-ROLL-REC.

     ADD 001 TO SR-LINE-COUNT.
     ADD 00001 TO SR-OUT.

     NOTE *******************************************************
          *                                                     *
          *  PREPARE SMOOTH ROLL DETAIL PRINT LINE 2            *
          *      PRINT FIXED DEDUCTIONS AND SAVINGS             *
          *                                                     *
          *******************************************************.

356140.
     MOVE MSTR-BADGE TO SR-BADGE.
     MOVE MSTR-ACTY TO SR-PFX-ACTY.
     MOVE MSTR-CONT-GRP TO SR-PFX-CTL-GP.
     IF ADJ-TO-NET-PAY, ADD NET-PAY-ADJ    TO NET-PAY.
     IF NET-PAY ZERO GO TO 358100.
     IF TAX-LEVY,
         GO TO 364200.
356190.
     IF DECEASED-PAYOFF,
         ADD NET-PAY TO OTHER-DED,
         MOVE NET-PAY TO HRLY-RATE-WORK,
         MOVE +00000.00 TO NET-PAY.
     IF NOT PAID-BY-VOUCHER GO TO 358100.
     SUBTRACT VOUCHER-PAID FROM NET-PAY GIVING HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NEGATIVE
         MOVE HRLY-RATE-WORK TO MSG10-AMT
         MOVE MESSAGE10 TO ERR-EXPLAIN
         ADD NET-PAY TO OTHER-DED, MSTR-YTD-OTH-DED
         MOVE +00000.00 TO NET-PAY
         ALTER 198140 TO PROCEED TO 358190
         GO TO 228200.
     MOVE HRLY-RATE-WORK TO NET-PAY.
         ADD VOUCHER-PAID TO OTHER-DED, MSTR-YTD-OTH-DED.
358100.
     IF NET-PAY ZERO  MOVE "NO PAY" TO SR-DEPOSIT
         GO TO 358190.
     IF WRITE-CASH-AWARD OR WRITE-TAX-LEVY GO TO 358110.
     IF MSTR-BANK-DEP-CODE EQUAL TO ZEROS OR SPACES GO TO 358110.
     IF NOT COMPOSIT-CHECKS GO TO 358110.
     MOVE "DEPOSIT" TO SR-DEPOSIT.
     GO TO 358140.
358110.
     ADD 1 TO CHECK-COUNTER.
     MOVE BEGIN-CHECK-NO TO SR-CHECK-NO.
358140.
     ADD NET-PAY TO PT-NET-PAY.
     ADD NET-PAY TO CG-NET-PAY.
     ADD NET-PAY TO AT-NET-PAY.
     ADD NET-PAY TO PGT-NET-PAY,
     ADD NET-PAY TO MSTR-YTD-NET-PAY.
     MOVE NET-PAY TO SR-NET-PAY.
358190.
     IF WRITE-TAX-LEVY,
         MOVE "TAX LEIN" TO SR2-FILLER
         GO TO 362162.
     IF MSTR-HLTH-CODE NOT ZERO,
         MOVE MSTR-HLTH-CODE TO SR-HLTH-CODE.
     IF HLTH-INS-DED NOT ZERO,
         ADD HLTH-INS-DED TO PT-HEALTH,
         ADD HLTH-INS-DED TO CG-HEALTH,
         ADD HLTH-INS-DED TO AT-HEALTH,
         ADD HLTH-INS-DED TO PGT-HEALTH,
         MOVE HLTH-INS-DED TO SR-HLTH-DED.
     IF LIFE-INS-DED NOT ZERO,
         ADD LIFE-INS-DED TO PT-REG-LIFE,
         ADD LIFE-INS-DED TO CG-REG-LIFE,
         ADD LIFE-INS-DED TO AT-REG-LIFE,
         ADD LIFE-INS-DED TO PGT-REG-LIFE,
         MOVE LIFE-INS-DED TO SR-LIFE-INS-DED.
     IF LIFE-OPT-DED ZERO,
         GO TO 360250.
     ADD LIFE-OPT-DED TO PT-OPT-INS.
     ADD LIFE-OPT-DED TO CG-OPT-INS.
     ADD LIFE-OPT-DED TO AT-OPT-INS.
     ADD LIFE-OPT-DED TO PGT-OPT-INS.
     MOVE LIFE-OPT-DED TO SR-LIFE-OPT-DED.
     IF MSTR-LIFE-OPT-CODE EQUALS "A",
         ADD LIFE-OPT-DED TO PT-AADD,
         ADD LIFE-OPT-DED TO CG-AADD,
         ADD LIFE-OPT-DED TO PGT-AADD,
         ADD LIFE-OPT-DED TO AT-AADD,
             GO TO 360250.
     IF MSTR-LIFE-OPT-CODE EQUALS "B",
         ADD LIFE-OPT-DED TO PT-BADD,
         ADD LIFE-OPT-DED TO CG-BADD,
         ADD LIFE-OPT-DED TO AT-BADD,
         ADD LIFE-OPT-DED TO PGT-BADD,
             GO TO 360250.
     IF MSTR-LIFE-OPT-CODE EQUALS "C",
         ADD LIFE-OPT-DED TO PT-CADD,
         ADD LIFE-OPT-DED TO CG-CADD,
         ADD LIFE-OPT-DED TO AT-CADD,
         ADD LIFE-OPT-DED TO PGT-CADD,
             GO TO 360250.
     IF MSTR-LIFE-OPT-CODE EQUALS "D",
         ADD LIFE-OPT-DED TO PT-DADD,
         ADD LIFE-OPT-DED TO CG-DADD,
         ADD LIFE-OPT-DED TO AT-DADD,
         ADD LIFE-OPT-DED TO PGT-DADD,
             GO TO 360250.
     IF MSTR-LIFE-OPT-CODE EQUALS "E",
         ADD LIFE-OPT-DED TO PT-EADD,
         ADD LIFE-OPT-DED TO CG-EADD,
         ADD LIFE-OPT-DED TO AT-EADD,
         ADD LIFE-OPT-DED TO PGT-EADD,
             GO TO 360250.
     IF MSTR-LIFE-OPT-CODE EQUALS "F",
         ADD LIFE-OPT-DED TO PT-FADD,
         ADD LIFE-OPT-DED TO CG-FADD,
         ADD LIFE-OPT-DED TO AT-FADD,
         ADD LIFE-OPT-DED TO PGT-FADD,
             GO TO 360250.
     ADD LIFE-OPT-DED TO PT-GADD.
     ADD LIFE-OPT-DED TO CG-GADD.
     ADD LIFE-OPT-DED TO AT-GADD.
     ADD LIFE-OPT-DED TO PGT-GADD.
360250.
     IF UNION-DUES NOT ZERO,
         ADD UNION-DUES TO PT-UNION,
         ADD UNION-DUES TO CG-UNION,
         ADD UNION-DUES TO AT-UNION,
         ADD UNION-DUES TO PGT-UNION,
         MOVE MSTR-UNION TO SR-UNION-CODE,
         MOVE UNION-DUES TO SR-UNION-DED.
     IF CHARITY-CON IS GREATER THAN +111.00,
         SUBTRACT +111.00 FROM CHARITY-CON.
     IF CHARITY-CON NOT ZERO,
         ADD CHARITY-CON TO PT-CONTRIB,
         ADD CHARITY-CON TO CG-CONTRIB,
         ADD CHARITY-CON TO AT-CONTRIB,
         ADD CHARITY-CON TO PGT-CONTRIB,
         MOVE MSTR-CHARITY-CODE TO SR-CHARITY-CODE,
         MOVE CHARITY-CON TO SR-CHARITY-DED.
     IF OTHER-DED NOT ZERO,
         ADD OTHER-DED TO PT-OTHER,
         ADD OTHER-DED TO CG-OTHER,
         ADD OTHER-DED TO AT-OTHER,
         ADD OTHER-DED TO PGT-OTHER,
         MOVE OTHER-DED TO SR-OTHER-DED.
     IF BOND-DED NOT ZERO,
         ADD BOND-DED TO PT-BOND,
         ADD BOND-DED TO CG-BOND,
         ADD BOND-DED TO AT-BOND,
         ADD BOND-DED TO PGT-BOND,
         MOVE BOND-DED TO SR-BOND-DED.
     IF ALLOT-DED NOT ZERO,
         ADD ALLOT-DED TO PT-ALLOT,
         ADD ALLOT-DED TO CG-ALLOT,
         ADD ALLOT-DED TO AT-ALLOT,
         ADD ALLOT-DED TO PGT-ALLOT,
         MOVE MSTR-ALLOT1-CODE TO SR-BANK-CODE1,
     MOVE ALLOT1-WORK TO SR-BANK-ALLOT-DED1
         MOVE MSTR-ALLOT2-CODE TO SR-BANK-CODE2,
     MOVE ALLOT2-WORK TO SR-BANK-ALLOT-DED2.
     IF MSTR-ADDL-ST-TAX NOT ZERO
         MOVE MSTR-ADDL-ST-TAX TO SR-ADDED-ST-TAX.
362162.
     WRITE SMOOTH-ROLL-REC BEFORE ADVANCING 2 LINES.
     ADD 002 TO SR-LINE-COUNT.
     MOVE SPACES TO SMOOTH-ROLL-REC.
     GO TO 366170.

     NOTE *******************************************************
          *                                                     *
          *  WRITE PAYROLL SMOOTH ROLL                          *
          *                                                     *
          *******************************************************.

364040.
     WRITE SMOOTH-ROLL-REC AFTER ADVANCING NUMBER-OF LINES.
         MOVE SPACES TO SMOOTH-ROLL-REC.

364070.
     GO TO 366170.

     NOTE *******************************************************
          *                                                     *
          *  TAX LEVY DEDUCTION ROUTINE                         *
          *      WRITE SEPARATE CHECK FOR TAX LEVY IF NOT       *
          *          GREATER THAN NET PAY                       *
          *      WRITE NOTIFICATION MESSAGE FOR TAX LEVY        *
          *          EXCEEDING NET PAY                          *
          *                                                     *
          *******************************************************.

364200.
     IF DECEASED-PAYOFF, OR PAID-BY-VOUCHER,
         GO TO 366045.
     SUBTRACT TAX-LEVY-DED FROM NET-PAY.
     IF NET-PAY POSITIVE,
         GO TO 356190.
     ADD TAX-LEVY-DED TO NET-PAY.
366045.
     MOVE +00000.00 TO TAX-LEVY-DED.
     MOVE "TAX LEVY EXCEEDS NET PAY, ONE CHECK" TO ERR-EXPLAIN.
     ALTER 198140 TO PROCEED TO 356190.
         GO TO 228200.

     NOTE *******************************************************
          *                                                     *
          *  JUST WROTE SMOOTH ROLL DETAIL LINE                 *
          *      TEST FOR PAGE OVERFLOW                         *
          *                                                     *
          *******************************************************.

366170.
     IF SR-LINE-COUNT IS LESS THAN 086,
         GO TO 382030.
     ALTER 372090 TO PROCEED TO 382030.

     NOTE *******************************************************
          *                                                     *
          *  WRITE SMOOTH ROLL PAGE AND ACTIVITY TOTAL LINES    *
          *                                                     *
          *******************************************************.

368080.
     MOVE 01 TO SUBS-1.
368100.
     IF SR-LINE-COUNT IS EQUAL TO 086, MOVE 03 TO NUMBER-OF,
         GO TO 368170.
     SUBTRACT SR-LINE-COUNT FROM 089 GIVING NUMBER-OF.
368170.
     MOVE RT-EMP-CTR (SUBS-1) TO SR-EMP-COUNT.
     MOVE RT-RATE (SUBS-1) TO SR-TOT-RATE.
     MOVE RT-NET-PAY (SUBS-1) TO SR-TOT-NET.
     MOVE RT-REG-HRS (SUBS-1) TO SR-TOT-REG-HR.
     MOVE RT-REG-PAY (SUBS-1) TO SR-TOT-REG.
     MOVE RT-OT-HRS (SUBS-1) TO SR-TOT-OT-HR.
     MOVE RT-OT-PAY (SUBS-1) TO SR-TOT-OT.
     MOVE RT-OTH-HRS (SUBS-1) TO SR-TOT-OTHER-HR.
     MOVE RT-OTH-PAY (SUBS-1) TO SR-TOT-OTHER.
     MOVE RT-CSRA (SUBS-1) TO SR-TOT-CSRA.
     MOVE RT-FICA (SUBS-1) TO SR-TOT-FICA.
     MOVE RT-FED-TAX (SUBS-1) TO SR-TOT-FED-TAX.
     ALTER 364070 TO PROCEED TO 368240.
     GO TO 364040.
368240.
     ALTER 364070 TO PROCEED TO 372090.
     MOVE RT-ST-TAX (SUBS-1) TO SR-TOT-STATE-TAX.
     MOVE RT-HEALTH (SUBS-1) TO SR-TOT-HLTH-DED.
     MOVE RT-REG-LIFE (SUBS-1) TO SR-TOT-LIFE-INS.
     MOVE RT-AADD (SUBS-1) TO SR-TOT-OPTA.
     MOVE RT-CADD (SUBS-1) TO SR-TOT-OPTC.
     MOVE RT-EADD (SUBS-1) TO SR-TOT-OPTE.
     MOVE RT-GADD (SUBS-1) TO SR-TOT-OPTG.
     MOVE RT-UNION (SUBS-1) TO SR-TOT-UNION-DED.
     MOVE RT-CONTRIB (SUBS-1) TO SR-TOT-CHARITY.
     MOVE RT-OTHER (SUBS-1) TO SR-TOT-OTHER-DED.
     MOVE RT-BOND (SUBS-1) TO SR-TOT-BOND-DED.
     MOVE RT-ALLOT (SUBS-1) TO SR-TOT-ALLOT.
     WRITE SMOOTH-ROLL-REC AFTER ADVANCING 2 LINES.
     MOVE SPACES TO SMOOTH-ROLL-REC.
     MOVE RT-BADD (SUBS-1) TO SR-TOT-OPTB.
     MOVE RT-DADD (SUBS-1) TO SR-TOT-OPTD.
     MOVE RT-FADD (SUBS-1) TO SR-TOT-OPTF.
     MOVE RT-OPT-INS (SUBS-1) TO SR-TOT-OPT-INS.
     IF RT-OPT-INS (SUBS-1) NOT ZERO MOVE "*" TO SR-AST.
     MOVE ZEROS TO REDEF-PAGE-ACTIVITY-TOTS (SUBS-1).
     MOVE 000 TO SR-LINE-COUNT.
     WRITE SMOOTH-ROLL-REC AFTER ADVANCING 1 LINES.
     MOVE SPACES TO SMOOTH-ROLL-REC.
     IF SR-PAGE-SW = 1 AND SUBS-1 = 3
       MOVE ZEROS TO SR-PAGE-COUNT.
372090.
     GO TO 382030.
372110.

     PERFORM 340170 THRU 34415E.
     ADD 1 TO SUBS-1.
     ALTER 372090 TO PROCEED TO 372117,
              GO TO 368100.
372117.
     IF MSTR-ACTY EQUAL TO MINOR-ACTIVITY GO TO 374010.
372128.
     IF MSTR-ACTY EQUAL TO CODE-1 GO TO 374010.
     IF MSTR-ACTY EQUAL TO CODE-2 GO TO 374010.
     IF MSTR-ACTY EQUAL TO CODE-3 GO TO 374010.
     IF MSTR-ACTY EQUAL TO CODE-4 GO TO 374010.
     PERFORM 340170 THRU 34415E.
     ADD 01 TO SUBS-1.
     MOVE 1 TO ACTY-CHG.
     ALTER 372090 TO PROCEED TO 374010.
         GO TO 368100.

374010.
     IF SR-PAGE-SW = 1 NEXT SENTENCE ELSE
       MOVE ZEROS TO SR-PAGE-COUNT.
     MOVE SPACES TO SMOOTH-ROLL-REC.
     MOVE 000 TO SR-LINE-COUNT.
     MOVE 01 TO SUBS-4.
     MOVE 01 TO SUBS-1.
     MOVE 45 TO EX-LINE-COUNT.
     PERFORM 114190.
     ALTER 198140 TO PROCEED TO 380090.
     GO TO 378110.

376000.
     ADD 1 TO CLPAGE.
     MOVE CLPAGE TO CONTR-PAGE.
     MOVE WEEK-END-DATE TO CONTR-DATE.
     WRITE CONTROL-REC FROM CONTR-HEADER AFTER NEXT-PAGE.
     MOVE ALL SPACES TO CONTROL-REC.
     WRITE CONTROL-REC AFTER 2 LINES.

378110.
     MOVE  SAVE-HOLD-CONTROLS TO CNTL-GROUP.
378170.
     MOVE "GRP" TO CNTL-GRP-KON.
     IF SUBS-1 = 01 OR 04 OR 09
          MOVE CNTRL-TOTS (SUBS-1) TO CNTL-COUNT
               ELSE
             MOVE CNTRL-TOTS (SUBS-1) TO CNTL-MONEY.
380050.
     MOVE +0000000.00 TO CNTRL-TOTS (SUBS-1).
     MOVE CNTRL-DESC (SUBS-1) TO CNTL-MESSAGE.
     MOVE "1" TO SW31.
         ADD +1 TO CONTROL-REC-OUT.
             MOVE "CONTROL RECORD" TO CON-MSG-PRINT.
             GO TO 198050.
380090.
     IF SUBS-1 NOT EQUAL TO 10
         ADD 1 TO SUBS-1,
             GO TO 378110.
380100.
     MOVE DTL-IN-GRP TO CNTL-MSG-DTL.
     MOVE DET-CNTL-MSG TO CONTROL-REC.
     WRITE CONTROL-REC AFTER ADVANCING 2 LINES.
     MOVE SPACES TO CONTROL-REC.
     MOVE ZEROS TO DTL-IN-GRP.
     IF NOT END-OF-JOB PERFORM 376000 GO TO 114190.
     MOVE EXC-OUT TO EXC-END-TOTALS.
          MOVE "END OF PAYROLL EXCEPTION LISTING",
             TO FINAL-EXPLAIN.
         MOVE "TOTAL EXCEPTIONS PROCESSED"  TO EXC-EXPLAIN.
     WRITE PAY-EXCEPT-LIST-REC AFTER ADVANCING 6 LINES.
     MOVE SPACES TO PAY-EXCEPT-LIST-REC.
         GO TO 410100.

     NOTE *******************************************************
          *                                                     *
          *  PREPARE PAYROLL EARNINGS WORKTAPE ROUTINE          *
          *                                                     *
          *******************************************************.

382030.
     MOVE MSTR-OUT-SEQ TO WT-SEQUENCE.
     MOVE MSTR-COST-WORK-CNTR TO WT-COST-WORK-CNTR.
     MOVE MSTR-NAME TO WT-NAME.
     MOVE MSTR-RETIRE-CODE TO WT-RETIRE-CODE.
     MOVE MSTR-MARRIED-CODE TO WT-MARRIED-CODE.
     IF MSTR-UNION NOT ZERO,
         MOVE MSTR-UNION TO WT-UNION-CODE.
         MOVE ROLL-NO TO WT-ROLL.
384010.
     IF NET-PAY ZERO GO TO 384015.
     IF WRITE-CASH-AWARD,
         OR WRITE-TAX-LEVY,
             GO TO 384110.
384015.
     IF MSTR-BANK-DEP-CODE EQUAL TO ZERO OR SPACES
         GO TO 384110.
     MOVE MSTR-BANK-DEP-CODE TO WT-BANK-DEP-CODE.
     MOVE MSTR-BANK-DEP-NO  TO WT-BANK-DEP-NO.
     IF NOT COMPOSIT-CHECKS GO TO 384110.
384046.
     MOVE +00000000 TO WT-CHECK-NO.
     GO TO 384114.
384110.
     IF NET-PAY ZERO GO TO 384046.
     MOVE BEGIN-CHECK-NO TO WT-CHECK-NO.
     IF BEGIN-CHECK-NO2 IS EQUAL TO ZEROS  GO TO 384112.
     IF BEGIN-CHECK-NO2 IS NOT EQUAL TO BEGIN-CHECK-NO,
         GO TO 384112.
     MOVE BEGIN-CHECK-NO3 TO BEGIN-CHECK-NO.
     MOVE BEGIN-CHECK-NO4 TO BEGIN-CHECK-NO2.
     GO TO 384114.
384112.
     ADD 1 TO BEGIN-CHECK-NO.
384114.
     IF ALLOT-DED NOT ZERO,
         MOVE MSTR-ALLOT1-CODE TO WT-ALLOT1-CODE,
         MOVE MSTR-ALLOT1-DEP-NO TO WT-ALLOT1-DEP-NO,
         MOVE MSTR-ALLOT2-CODE TO WT-ALLOT2-CODE,
         MOVE MSTR-ALLOT2-DEP-NO TO WT-ALLOT2-DEP-NO.
384130.
     MOVE CHECK-COUNT TO WT-CHECK-CNTR.
         ADD 1 TO CHECK-COUNT.
     MOVE NET-PAY TO WT-NET-PAY.
     MOVE MSTR-HOURLY-RATE TO WT-HOURLY-RATE.
     IF WRITE-TAX-LEVY,
     MOVE ZEROS TO WT-TAX-LEVY-ZEROS, WT-MONEY-HOURS-ZEROS,
         WT-MONEY-HRS-ZEROS WT-FED-TAX GO TO 386172.
     MOVE REG-HRS-WK1 TO WT-REG-HOURS.
     MOVE REG-MONEY TO WT-REG-PAY.
     IF RETRO-OVERTIME
         SUBTRACT HOLD-RETRO-OTPAY FROM OT-MONEY
         SUBTRACT HOLD-RETRO-OTHRS FROM OT-HRS-WK1.
     MOVE OT-HRS-WK1 TO WT-OT-HOURS.
     MOVE OT-MONEY TO WT-OT-PAY.
     IF RETRO-OVERTIME
         ADD HOLD-RETRO-OTPAY TO OT-MONEY
         ADD HOLD-RETRO-OTHRS TO OT-HRS-WK1.
     IF MSTR-ACTY EQUAL TO CODE-1 OR CODE-2 OR CODE-3 OR CODE-4
         SUBTRACT CAT-B-HOURS FROM OTHER-HOURS.
     MOVE OTHER-HOURS TO WT-OTHER-HOURS.
     MOVE OTHER-MONEY TO WT-OTHER-PAY.
     MOVE CAT-A-MONEY TO WT-CATA-MONEY.
     MOVE CAT-A-HOURS TO WT-CATA-HOURS.
     MOVE CAT-B-MONEY TO WT-CATB-MONEY.
     MOVE CAT-B-HOURS TO WT-CATB-HOURS.
     MOVE CAT-C-MONEY TO WT-CATC-MONEY.
     MOVE CAT-C-HOURS TO WT-CATC-HOURS.
     MOVE CAT-H-MONEY TO WT-CATH-MONEY.
     MOVE CAT-J-MONEY TO WT-CATJ-MONEY.
     MOVE CAT-J-HOURS TO WT-CATJ-HOURS.
     MOVE CAT-K-MONEY TO WT-CATK-MONEY.
     MOVE CAT-L-MONEY TO WT-CATL-MONEY.
     MOVE CAT-M-MONEY TO WT-CATM-MONEY.
     MOVE CAT-M-HOURS TO WT-CATM-HOURS.
     MOVE CAT-N-MONEY TO WT-CATN-MONEY.
     MOVE CAT-N-HOURS TO WT-CATN-HOURS.
     EXAMINE WT-NEG-OT-RE REPLACING ALL SPACES BY ZEROS.
     EXAMINE WT-RETRO-OTPAY-RE REPLACING ALL SPACES BY ZEROS.
     EXAMINE WT-RETRO-OTHRS-RE REPLACING ALL SPACES BY ZEROS.
     IF FICA-MSTR,
         MOVE WK1-SUBJECT TO WT-SUB-FICA,
             GO TO 386052.
         MOVE +0000.00 TO WT-SUB-FICA.
386052.
     MOVE RETIRE-FICA TO WT-FICA-CSRA.
     IF WRITE-CASH-AWARD,
         MOVE +00 TO WT-FED-TAX-CODE,
             GO TO 386082.
         MOVE MSTR-TAX-CODE TO WT-FED-TAX-CODE.
386082.
     MOVE FED-TAXES TO WT-FED-TAX.
     MOVE STATE-TAXES TO WT-STATE-TAX.
     MOVE MSTR-HLTH-CODE TO WT-HLTH-CODE.
     MOVE HLTH-INS-DED TO WT-HLTH-DED.
     MOVE HLTH-INS-CON TO WT-HLTH-CONTRIB.
     MOVE LIFE-INS-DED TO WT-LIFE-INS-DED.
     MOVE LIFE-OPT-DED TO WT-LIFE-OPT-DED.
     MOVE UNION-DUES TO WT-UNION-DED.
     MOVE MSTR-CHARITY-CODE TO WT-CHARITY-CODE.
     MOVE CHARITY-CON TO WT-CHARITY-DED.
     MOVE OTHER-DED TO WT-OTHER-DED.
     MOVE BOND-DED TO WT-BOND-DED.
     MOVE MSTR-CLOCK-NO TO WT-CLOCK-NO.
     MOVE MSTR-LIFE-OPT-CODE TO WT-LIFE-OPT-CD.
     IF ALLOT-DED ZERO,
         MOVE +000 TO WT-ALLOT1-DED, WT-ALLOT2-DED,
             GO TO 386172.
     IF ALLOT1-WORK ZERO MOVE +000 TO WT-ALLOT1-DED GO TO 386167.
     MOVE ALLOT1-WORK TO WT-ALLOT1-DED.
386167.
     IF ALLOT2-WORK ZERO
         MOVE +000 TO WT-ALLOT2-DED,
             GO TO 386172.
         MOVE ALLOT2-WORK TO WT-ALLOT2-DED.
386172.
     MOVE MSTR-OTHER-PAY-CODE TO WT-OTHER-PAY-CODE.
     MOVE PART-TIME-CODE      TO WT-WORK-SCHED.
     MOVE MSTR-FF-CODE        TO WT-FF-CODE.
     IF WRITE-CASH-AWARD MOVE "ZZ" TO WT-PAY-EXCEP-CODE.
     IF WORK-OTH-PAY-CODE EQUAL TO "F",
             MOVE "F" TO WT-OTHER-PAY-CODE.
     MOVE WEEK-END-DATE TO WT-WE-DATE.
     MOVE MSTR-STATE-TAX-CODE TO WT-STATE-TAX-CODE.
     MOVE MSTR-SS-NO TO WT-SS-NO.
     MOVE MSTR-OCC-CD TO WT-OCC-CD.
     WRITE PAYROLL-WORK-REC.
         ADD +1 TO WT-OUT.
         MOVE SPACES TO PAYROLL-WORK-REC.
     IF TAX-LEVY-DED NOT ZERO,
         SUBTRACT NET-PAY FROM REG-MONEY,
         MOVE TAX-LEVY-DED TO NET-PAY,
         MOVE "1" TO SW37,
         MOVE +00000.00 TO TAX-LEVY-DED,
         MOVE SPACE TO SW15,
             GO TO 338170.

CFOOT1.
     NOTE *******************************************************
          *                                                     *
          *  CROSSFOOT CURRENT MONEY                            *
          *      WRITE NOTIFICATION MESSAGE IF CURRENT MONEY    *
          *          DOES NOT CROSSFOOT TO ZERO                 *
          *                                                     *
          *******************************************************.
387000.

     ADD REG-MONEY, OT-MONEY, OTHER-MONEY,
         GIVING HRLY-RATE-WORK.
     SUBTRACT NET-PAY,
              RETIRE-FICA,
              FED-TAXES,
              STATE-TAXES,
              HLTH-INS-DED,
              LIFE-INS-DED,
              LIFE-OPT-DED,
              UNION-DUES,
              CHARITY-CON,
              OTHER-DED,
              BOND-DED,
              ALLOT-DED, FROM HRLY-RATE-WORK.
     IF HRLY-RATE-WORK NOT ZERO,
         MOVE HRLY-RATE-WORK TO MSG9-AMT,
         MOVE MESSAGE9 TO ERR-EXPLAIN,
         ALTER 198140 TO PROCEED TO 392010,
             GO TO 228200.

     NOTE *******************************************************
          *                                                     *
          *  ZERO OUT ALL CURRENT PAYROLL TOTALS                *
          *      TEST FOR ADDITIONAL CASH AWARD CHECKS          *
          *      TURN OFF ALL PROGRAM SWITCHES                  *
          *                                                     *
          *******************************************************.

392010.
     MOVE ZEROS TO PAYROLL-WORK-AREAS.
     MOVE SPACES TO WT-PAY-EXC-HOLD, WORK-OTH-PAY-CODE.
     IF CASH-AWARD,
         MOVE SPACE TO SW30, SW18,
         MOVE "1" TO SW36,
         ADD DTL-AMOUNT TO OTHER-MONEY,
             GO TO 116140.
     MOVE SPACE TO SW4, SW6, SW7, SW8, SW9, SW10, SW11, SW12,
         SW13, SW14, SW15, SW16, SW17, SW18, SW19, SW20, SW21,
         SW22, SW23, SW24, SW25, SW26, SW27, SW28, SW29, SW30,
         SW31, SW32, SW33, SW34, SW35, SW36, SW37.
     MOVE SPACE TO SW40, SW41, SW42, SW43, SW44, SW45, SW46,
         SW47 SW48 SW49 SW50 SW51 SW52 SW53 SW54 SW55 SW56.
     MOVE SPACE TO SW57.

EXCNOTE1.
     NOTE *******************************************************
          *                                                     *
          *  PREPARE PAYROLL EXCEPTION LISTING                  *
          *      LIST ALL EXCEPTION PAY CODES WITH DESCRIPTION  *
          *                                                     *
          *******************************************************.

393000.

     IF NOT PAY-EXCEPT,
         GO TO 406100.
     MOVE SPACE TO SW5.
     IF EX-LINE-COUNT LESS THAN 45, GO TO 400040.

     NOTE *******************************************************
          *                                                     *
          *  PREPARE EXCEPTION LIST HEADING LINE                *
          *                                                     *
          *******************************************************.

396050.
     MOVE +000 TO EX-LINE-COUNT.
     MOVE 01 TO SUBS-4.
396100.
     IF MINOR-ACTIVITY EQUAL TO SR-ACT-CODE (SUBS-4)
        MOVE SR-LOCATION-HDR (SUBS-4) TO EXC-ACTIVITY,
             GO TO 398012.
     IF SUBS-4 GREATER THAN 25 GO TO 398012.
     ADD 01 TO SUBS-4, GO TO 396100.
398012.
     MOVE 01 TO SUBS-4.
398080.
     ADD 1 TO EXCPAGE.
     MOVE EXCPAGE TO EXC-PG-NO.
     MOVE "PAGE" TO EXPGCON.
     IF SAVE-GORU EQUAL TO "G" OR "0" OR " "
         MOVE "GRADED" TO EXC-AORD
         ELSE MOVE "UNGRADED" TO EXC-AORD.
     MOVE "PAYROLL EXCEPTION LISTING" TO EXC-LIST-TITLE.
     MOVE "ROLL" TO EXC-ROLL-KON.
     MOVE ROLL-NO TO EXC-ROLL.
     MOVE WE-MONTH TO EXC-WE-MO.
     MOVE WE-DAY TO EXC-WE-DAY.
     MOVE WE-YEAR TO EXC-WE-YR.
     MOVE "/" TO EXC-SLASH1, EXC-SLASH2.
     WRITE EXCEPT-LIST-HEADING AFTER ADVANCING NEXT-PAGE.
     MOVE SPACES TO PAY-EXCEPT-LIST-REC.
     WRITE PAY-EXCEPT-LIST-REC BEFORE ADVANCING 2 LINES.
     MOVE 02 TO EX-LINE-COUNT.

     NOTE *******************************************************
          *                                                     *
          *  PREPARE EXCEPTION LIST DETAIL PRINT LINES          *
          *                                                     *
          *******************************************************.

400040.
     ADD 1 TO EX-LINE-COUNT.
     MOVE MSTR-ACTY     TO EXC-ACTY-PRINT.
     MOVE MSTR-CONT-GRP TO EXC-CTL-GRP-PRINT.
     MOVE "BADGE NO" TO EXC-BADGE-KON.
     MOVE MSTR-BADGE TO EXC-BADGE.
     MOVE "," TO EXC-COMMA-KON.
     MOVE MSTR-NAME TO EXC-NAME.
     ALTER 400150 TO PROCEED TO 400170.
400100.
     ADD 1 TO EX-LINE-COUNT.
400120.
     WRITE PAY-EXCEPT-LIST-REC AFTER ADVANCING 1 LINES.
         MOVE SPACES TO PAY-EXCEPT-LIST-REC.
400150.
     GO TO 400170.
400170.
     MOVE 01 TO SUBS-1.
     ALTER 400150 TO PROCEED TO 402060.
400200.
     IF EXC-LIST-TOT (SUBS-1) ZERO,
         GO TO 402060.
     IF EX-LINE-COUNT GREATER THAN 45,
         GO TO 396050.
     MOVE PAY-EXC-CODE (SUBS-1) TO EXC-CODE.
     MOVE PAY-EXC-DESC (SUBS-1) TO EXC-EXPLAIN.
     MOVE EXC-LIST-TOT (SUBS-1) TO EXC-HRS-AMT.
     MOVE +00000.00 TO EXC-LIST-TOT (SUBS-1).
     ADD +1 TO EXC-OUT.
         GO TO 400100.
402060.
     IF SUBS-1 LESS THAN 48
         ADD 1 TO SUBS-1,
             GO TO 400200.

     MOVE SPACES TO PAY-EXCEPT-LIST-REC.
     WRITE PAY-EXCEPT-LIST-REC AFTER ADVANCING 1 LINES.
     ADD 01 TO EX-LINE-COUNT.

     NOTE *******************************************************
          *                                                     *
          *  WRITE PAYROLL/PERSONNEL MASTER RECORD              *
          *      ALL CURRENT PAYROLL EARNINGS AND DEDUCTIONS    *
          *          HAVE BEEN UPDATED IN MASTER                *
          *                                                     *
          *******************************************************.

406100.
     IF ACTIVE-MSTR,
         ADD +1 TO ACTIVE-OUT.
     WRITE PERS-MSTR-OUT-REC.
         ADD +1 TO MSTR-OUT.
         GO TO 108090.

     NOTE *******************************************************
          *                                                     *
          *  PAYROLL DETAIL END OF FILE                         *
          *      TEST FOR PAYROLL MASTER END OF FILE            *
          *                                                     *
          *******************************************************.

408010.
     IF EOF-MASTER,
         GO TO 408180.
     MOVE "1" TO SW3.
         GO TO 120110.

     NOTE *******************************************************
          *                                                     *
          *  PAYROLL MASTER END OF FILE                         *
          *      TEST FOR PAYROLL DETAIL END OF FILE            *
          *                                                     *
          *******************************************************.

408140.
     IF NOT EOF-DETAIL,
         MOVE "1" TO SW2,
             GO TO 196140.
408180.
     PERFORM 368080 THRU 368240.
     MOVE 02 TO SUBS-1.
     MOVE "1" TO SW38.
     PERFORM 340170 THRU 34415E.
     ALTER 372090 TO PROCEED TO 372110.
     MOVE HIGH-VALUES TO MINOR-ACTIVITY.
     GO TO 368100.

     NOTE *******************************************************
          *                                                     *
          *  END OF JOB                                         *
          *      WRITE EOJ RECORD COUNTS                        *
          *      CLOSE ALL INPUT/OUTPUT FILES                   *
          *                                                     *
          *******************************************************.

410100.
     MOVE 01 TO SUBS-1.
410120.
     MOVE EOJ-DESC (SUBS-1) TO EOJ-MSG-DESC.
     MOVE EOJ-TOTALS (SUBS-1) TO EOJ-MSG-TOT.
     DISPLAY EOJ-MSG.
     IF SUBS-1 LESS THAN 10,
         ADD 1 TO SUBS-1,
             GO TO 410120.

420000.
     MOVE ALL SPACES TO SMOOTH-ROLL-REC.
     WRITE SMOOTH-ROLL-REC BEFORE ADVANCING NEXT-PAGE.
     MOVE 04 TO SUBS-1.
     MOVE SPACES TO MINOR-ACTIVITY, MINOR-CONTROL.
     PERFORM 340170 THRU 34415E.
     ALTER 372090 TO PROCEED TO 421000.
     GO TO 368100.
421000.
     EXIT.
CLOSE1.
     NOTE *******************************************************
          *                                                     *
          *  CLOSE ALL INPUT/OUTPUT FILES                       *
          *                                                     *
          *******************************************************.
430000.

     CLOSE PERS-MSTR-IN-FILE WITH LOCK.
     CLOSE PAYROLL-DETAIL-FILE WITH LOCK.
     CLOSE PERS-MSTR-OUT-FILE WITH LOCK.
     CLOSE SMOOTH-ROLL-FILE WITH LOCK.
     CLOSE PAYROLL-WORK-FILE WITH LOCK.
     CLOSE CONTROL-ERROR-FILE WITH LOCK.
     CLOSE PAY-EXCEPT-LIST-FILE WITH LOCK.
         STOP RUN.
480000.
     DISPLAY "XXXXXXXXXX DETAIL IN  " DTL-SEQ.
     DISPLAY "XXXXXXXXXX DETAIL HOLD" SEQ-PAY-DTL.
     STOP "XXXXXXXXXX HALT 0002".
     GO TO 480000.
490000.
     DISPLAY "XXXXXXXXXX PARAM CARD MISSING".
     STOP "XXXXXXXXXX HALT 0003".
     GO TO 490000.
PATCHS.
     GO TO PATCHS.
   x@u–