IDENTIFICATION DIVISION.
PROGRAM-ID. MIRB-1.
AUTHOR. F D WROBLEWSKI  MERCHANTS MUTUAL INS CO BUFFALO.
REMARKS. MERCHANTS MUTUAL INS CO BUFFALO NEW YORK.
        5 TAPES FOR THE BUREAU, LOG 2 BUREAU
        TAPE WILL ALSO BE INPUT TO A SORT
        FOR TABLOS.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. H-200.
OBJECT-COMPUTER. DECSYSTEM-10.
SPECIAL-NAMES. CHANNEL (1) IS HEAD-OF-FORM.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT DO-FILE, ASSIGN TO DSK,RECORDING MODE ASCII.
    SELECT TAPE-FILE, ASSIGN TO DSK,RECORDING MODE ASCII.
    SELECT FILE-56, ASSIGN TO DSK, RECORDING MODE ASCII.
    SELECT FILE-7, ASSIGN TO DSK,RECORDING MODE ASCII.
    SELECT FILE-19,  ASSIGN TO DSK, RECORDING MODE ASCII.
    SELECT FILE-71,  ASSIGN TO DSK, RECORDING MODE ASCII.
    SELECT PRINT-FILE, ASSIGN TO DSK, RECORDING MODE ASCII.
DATA DIVISION.
FILE SECTION.
FD  DO-FILE,VALUE OF IDENTIFICATION IS "LOSS  DAT".
01  DO-REC.
    02  FILLER PICTURE X(8).
    02  D-CLAIM.
        03  D-CL-HI PICTURE 9.
        03  D-CL-LO PICTURE 9(6).
    02  D-AGT  PICTURE 99.
    02  FILLER PICTURE XX.
    02  D-ISS-MO PICTURE 99.
    02  D-ISS-YR.
        03  ISS-YR-HI PICTURE 9.
        03  ISS-YR-LO PICTURE 9.
    02  D-ACC-MO-YR.
        03  D-ACC-MO PICTURE 99.
        03  D-ACC-YR-HI PICTURE 9.
        03  D-ACC-YR-LO PICTURE 9.
    02  D-COV.
        03  FILLER PICTURE 9.
        03  D-COV-LO PICTURE 9.
    02  D-WIND PICTURE 9.
    02  D-CL-CNT PICTURE X.
    02  D-COL2930.
        03  D-ACC-CNT PICTURE X.
        03  D-LIMIT PICTURE X.
    02  D-CLASS1.
        03  D-CL-1-2 PICTURE 99.
        03  FILLER PICTURE 99.
    02  D-CLASS2 REDEFINES D-CLASS1.
        03  FILLER PICTURE 9.
        03  D-CL-2-3 PICTURE 99.
        03  FILLER PICTURE 9.
    02  D-ST PICTURE 99.
    02  D-CITY.
        03  D-CITY1 PICTURE 99.
        03  D-SYM PICTURE 9.
    02  D-LA PICTURE 9.
    02  D-AGE PICTURE 99.
    02  D-AGE1 REDEFINES D-AGE.
        03  FILLER PICTURE 9.
        03  D-LOAGE PICTURE 9.
    02  D-TERR PICTURE 99.
    02  FILLER PICTURE X(11).
    02  D-INDEM PICTURE IS S9(5)V99.
    02  D-EXP PICTURE S999.
    02  D-DISP-MO.
        03  FILLER PICTURE IS 9.
        03  D-DISP-LO PICTURE 9.
    02  FILLER PICTURE 9.
    02  D-DISP-YR PICTURE 9.
    02  FILLER PICTURE XX.
    02  D-POL PICTURE 9(6).
    02  FILLER PICTURE X(11).
    02  D-CNP PICTURE 9.
    02  D-ADD PICTURE 9.
    02  FILLER PICTURE X(7).
FD  TAPE-FILE, VALUE OF IDENTIFICATION IS "LOSSPDDAT".
01  TAPE-REC.
    02  T-CONO PICTURE 9999.
    02  T-KIND PICTURE 9.
    02  T-ACCT-MO PICTURE X.
    02  T-ACCT-YR PICTURE 9.
    02  T-LINE PICTURE 99.
    02  FILLER PICTURE XX.
    02  T-EFF-YR PICTURE 9.
    02  FILLER PICTURE XXX.
    02  T-STATE PICTURE 99.
    02  T-TERRM.
        03  FILLER PICTURE X.
        03  T-TERR PICTURE XX.
    02  T-CLASS-2 PICTURE 9999.
    02  T-CLASS PICTURE 99.
    02  T-LIMITS PICTURE X.
    02  FILLER PICTURE X(10).
    02  T-TYPE PICTURE 9.
    02  T-TRANS PICTURE 9.
    02  T-ACC-MOYR PICTURE 9999.
    02  T-AMOUNT PICTURE S9(5)V99.
    02  FILLER PICTURE X.
    02  T-NO-CL PICTURE S9.
    02  FILLER PICTURE X(14).
    02  T-AGE PICTURE XX.
    02  T-POLNUM PICTURE X(6).
    02  T-NUMBER PICTURE X(6).
FD  PRINT-FILE
    LABEL RECORDS ARE OMITTED
01  PRINT-REC PICTURE X(75).
FD  FILE-56,VALUE OF IDENTIFICATION IS "GLPDLSDAT".
01  56-REC.
    02  56-CONST PICTURE 9(7).
    02  56-CL-FILL PICTURE 999.
    02  56-CLAIM PICTURE 9(7).
    02  FILLER PICTURE XX.
    02  56-CLASS PICTURE 9999.
    02  56-STATE PICTURE 99.
    02  FILLER PICTURE X.
    02  56-TERR PICTURE 99.
    02  56-ACCMOYR PICTURE 9999.
    02  56-COV PICTURE 9.
    02  56-TRANS PICTURE 9.
    02  56-CR PICTURE X.
    02  56-CLCNT PICTURE 9.
    02  56-COST PICTURE 9(6)V99.
    02  56-EXP1  REDEFINES 56-COST.
        03  FILLER PICTURE 999.
        03  56-EXP PICTURE 999.
        03  FILLER PICTURE V99.
    02  56-ANAL PICTURE 9.
    02  56-LINE PICTURE 99.
    02  56-ISSMO PICTURE 99.
    02  56-ISSYR PICTURE 9.
    02  56-CLASS2 PICTURE X.
    02  56-SYM PICTURE 9.
    02  FILLER PICTURE X(28).
FD  FILE-7,VALUE OF IDENTIFICATION IS "GLSDETDAT".
01  7-REC.
    02  7-CONST PICTURE 9(7).
    02  7-CL-FILL PICTURE 9.
    02  7-CLAIM PICTURE 9(7).
    02  FILLER PICTURE X(10).
    02  7-CLASS PICTURE 99.
    02  7-STATE PICTURE 99.
    02  7-TERR PICTURE 99.
    02  7-TRANS PICTURE 9.
    02  FILLER PICTURE X(7).
    02  7-CR PICTURE X.
    02  7-ACCYR PICTURE 9.
    02  7-CLCNT PICTURE 9.
    02  7-COST PICTURE 9(5)V99.
    02  7-LINE PICTURE 999.
    02  FILLER PICTURE X(28).
FD  FILE-19,VALUE OF IDENTIFICATION IS "BURDETDAT".
01  19-REC.
    02  19-CONST PICTURE 9(7).
    02  19-CL-FILL PICTURE 9.
    02  19-CLAIM PICTURE 9(7).
    02  FILLER PICTURE X(6).
    02  19-FORMA PICTURE 9.
    02  19-FORMB PICTURE 9.
    02  FILLER PICTURE XXXX.
    02  19-STATE PICTURE 99.
    02  19-TERR PICTURE 99.
    02  19-TRANS PICTURE 9.
    02  FILLER PICTURE X(7).
    02  19-CR PICTURE X.
    02  19-ACCYR PICTURE 9.
    02  19-CLCNT PICTURE 9.
    02  19-COST PICTURE 9(5)V99.
    02  19-LINE PICTURE 999.
    02  FILLER PICTURE X(28).
FD  FILE-71,VALUE OF IDENTIFICATION IS "MPPDLSDAT".
01  71-REC.
    02  71-TYPE1 PICTURE 9.
    02  71-CALYR PICTURE 9.
    02  71-CO PICTURE 9999.
    02  71-ST PICTURE 99.
    02  71-TERR PICTURE 99.
    02  71-TRANS PICTURE 9.
    02  71-COL2930 PICTURE 99.
    02  71-CLASS PICTURE 9999.
    02  71-LOAGE PICTURE 9.
    02  FILLER PICTURE X.
    02  71-TYPE2 PICTURE 9.
    02  FILLER PICTURE X(15).
    02  71-COST PICTURE 9(8)V99.
    02  71-CR PICTURE X.
    02  FILLER PICTURE XXXXX.
    02  71-CL PICTURE 9.
    02  71-CR2 PICTURE X.
    02  FILLER PICTURE X(6).
    02  71-QTR PICTURE 9.
    02  71-ACCYR-HI PICTURE 9.
    02  71-ACCYR-LO PICTURE 9.
    02  71-ZERO PICTURE 999.
    02  71-CLAIM PICTURE 9(7).
    02  FILLER PICTURE X.
    02  71-ACCMO PICTURE 99.
    02  71-ISSMO PICTURE 99.
    02  71-ISSYR PICTURE 9.
    02  71-CODE PICTURE 99.
WORKING-STORAGE SECTION.
77  FILL1 PICTURE IS X(22) VALUE "   02  010304     R01 ".
77  FILL2 PICTURE X(24) VALUE "0080001000109SS 1 E    R".
77  FILL3 PICTURE IS X(9) VALUE "      8  ".
77  FILL4 PICTURE IS X(28) VALUE SPACES.
77  FILL5 PICTURE IS X(12) VALUE "000802001602".
77  FILL6 PICTURE IS X(48) VALUE SPACES.
77  FILL7 PICTURE IS X(20) VALUE "LOSSESPAIDLOSSESPAID".
77  FILL8 PICTURE IS X(9) VALUE SPACES.
77  FILL9 PICTURE IS X(9) VALUE "TABLOS00B".
01  MM-HEAD.
    02  FILLER PICTURE X(23) VALUE SPACES.
    02  FILLER PICTURE X(30) VALUE IS
        "MERCHANTS MUTUAL INSURANCE CO.".
    02  FILLER PICTURE X(22) VALUE SPACES.
01  NH-HEAD.
    02  FILLER PICTURE X(22) VALUE SPACES.
    02  FILLER PICTURE X(31) VALUE IS
        "NEW HAMPSHIRE INSURANCE COMPANY".
    02  FILLER PICTURE X(22) VALUE SPACES.
01  56-HEAD.
    02  FILLER PICTURE X(25) VALUE
        "        GENERAL LIABILITY".
    02  FILLER PICTURE X(25) VALUE
        " PAID LOSSES AND ALLOCATE".
    02  FILLER PICTURE X(25) VALUE
        "D CLAIM EXPENSE          ".
01  7-HEAD.
    02  FILLER PICTURE X(20) VALUE SPACES.
    02  FILLER PICTURE X(34) VALUE IS
        "GLASS INSURANCE EXPERIENCE FOR THE".
    02  FILLER PICTURE X(21) VALUE SPACES.
01  19-HEAD.
    02  FILLER PICTURE X(18) VALUE SPACES.
    02  FILLER PICTURE X(37) VALUE IS
        "BURGLARY INSURANCE EXPERIENCE FOR THE".
    02  FILLER PICTURE X(20) VALUE SPACES.
01  71-HEAD.
    02  FILLER PICTURE X(18) VALUE SPACES.
    02  FILLER PICTURE X(38) VALUE
        "SPECIAL MULTI PERIL EXPERIENCE FOR THE".
    02  FILLER PICTURE X(19) VALUE SPACES.
01  QTR-HEAD.
    02  FILLER PICTURE X(29) VALUE SPACES.
    02  QTR-NO PICTURE XXX VALUE IS SPACES.
    02  FILLER PICTURE X(12) VALUE " QUARTER 197".
    02  QTR-YR PICTURE 9.
    02  FILLER PICTURE X(30) VALUE SPACES.
01  56-LINE1.
    02  FILLER PICTURE X(34) VALUE SPACES.
    02  FILLER PICTURE X(5) VALUE "CLAIM".
    02  FILLER PICTURE X(25) VALUE IS
        "         LOSSES PAID     ".
    02  FILLER PICTURE X(11) VALUE "CARD       ".
01  56-LINE2.
    02  FILLER PICTURE X(25) VALUE
        "      CO.NO.    COV      ".
    02  FILLER PICTURE X(25) VALUE
        "ST       COUNT           ".
    02  FILLER PICTURE X(25) VALUE
        "   COST       COUNT      ".
01  7-19-LINE1.
    02  FILLER PICTURE X(29) VALUE SPACES.
    02  FILLER PICTURE X(15) VALUE IS
        "CLAIM          ".
    02  FILLER PICTURE X(11) VALUE
        "LOSSES PAID".
    02  FILLER PICTURE X(20) VALUE IS
        "       CARD         ".
01  7-19-LINE2.
    02  FILLER PICTURE X(25) VALUE
        "        CO.NO.     ST    ".
    02  FILLER PICTURE X(25) VALUE
        "    COUNT               C".
    02  FILLER PICTURE X(25) VALUE
        "OST        COUNT         ".
01  SW-1 PICTURE 9.
01  SW-2 PICTURE 9.
01  SW-A PICTURE 9.
01  SW-B PICTURE 9.
01  SW-C PICTURE 9.
01  DETAIL-56.
    02  FILLER PICTURE X(7) VALUE SPACES.
    02  D56-CONO PICTURE 9999.
    02  FILLER PICTURE X(7) VALUE SPACES.
    02  D56-COV PICTURE 9.
    02  FILLER PICTURE X(6) VALUE SPACES.
    02  D56-ST PICTURE 99.
    02  FILLER PICTURE X(6) VALUE SPACES.
    02  D56-CLCNT PICTURE ZZ,ZZZCR.
    02  FILLER PICTURE XXXX VALUE SPACES.
    02  D56-COST PICTURE Z,ZZZ,ZZZ.ZZCR.
    02  FILLER PICTURE XXXX VALUE SPACES.
    02  D56-CDCNT PICTURE ZZ,ZZZ.
    02  FILLER PICTURE X(6) VALUE SPACES.
01  DETAIL-7-19.
    02  FILLER PICTURE X(8) VALUE SPACES.
    02  D719-CONO PICTURE 9999.
    02  FILLER PICTURE X(7) VALUE SPACES.
    02  D719-ST PICTURE 99.
    02  FILLER PICTURE X(7) VALUE SPACES.
    02  D719-CLCNT PICTURE ZZ,ZZZCR.
    02  FILLER PICTURE X(5) VALUE SPACES.
    02  D719-COST PICTURE Z,ZZZ,ZZZ.ZZCR.
    02  FILLER PICTURE X(5) VALUE SPACES.
    02  D719-CDCNT PICTURE ZZ,ZZZ.
    02  FILLER PICTURE X(9) VALUE SPACES.
01  CON-FILE.
    02  FILLER PICTURE X VALUE IS SPACES.
    02  ST-CONO PICTURE IS XXXX.
    02  FILLER PICTURE IS X VALUE IS ":".
01  CD-COUNT12 PICTURE 9(5).
01  CD-COUNT56 PICTURE 9(5).
01  CD-COUNT7 PICTURE 9(5).
01  CD-COUNT19 PICTURE 9(5).
01  CD-COUNT71 PICTURE 9(5).
01  NOTHING PICTURE IS 9 VALUE IS ZERO.
01  ACCUMX.
    02  HI-YR PICTURE 9.
    02  LO-YR PICTURE 9.
    02  MONTH PICTURE 99.
01  ACCUM1 REDEFINES ACCUMX PICTURE IS S9999.
01  CON-CARD.
    02  CON-FILL.
        03  CON-CONO PICTURE 9999.
        03  CON-MO.
        04  CON-MOHI PICTURE 9.
        04  CON-MOLO PICTURE 9.
        03  CON-YR PICTURE 9.
    02  CON-NOTPS PICTURE 99.
    02  CON-FLAG PICTURE X.
    02  FILLER PICTURE X(70).
01  ST-1.
    02  FILLER PICTURE X(42) VALUE IS
        "060708091013181920212829313234373839444547".
01  ST-1A REDEFINES ST-1.
    02  ST-TAB PICTURE 99 OCCURS 21 TIMES.
01  SUB PICTURE 9.
01  SUB-ST PICTURE 99.
01  A-56.
    02  56-A OCCURS 3 TIMES.
        03  A-CL56 PICTURE S9(5) OCCURS 21 TIMES.
        03  A-COST56 PICTURE S9(7)V99 OCCURS 21 TIMES.
        03  A-CD56 PICTURE 9(5) OCCURS 21 TIMES.
01  A-7.
    02  A-CL7 PICTURE S9(5) OCCURS 21 TIMES.
    02  A-COST7 PICTURE S9(7)V99 OCCURS 21 TIMES.
    02  A-CD7 PICTURE 9(5) OCCURS 21 TIMES.
01  A-19.
    02  A-CL19 PICTURE S9(5) OCCURS 21 TIMES.
    02  A-COST19 PICTURE S9(7)V99 OCCURS 21 TIMES.
    02  A-CD19 PICTURE 9(5) OCCURS 21 TIMES.
01  A-71.
    02  A-CL71 PICTURE S9(5) OCCURS 21 TIMES.
    02  A-COST71 PICTURE S9(7)V99 OCCURS 21 TIMES.
    02  A-CD71 PICTURE 9(5) OCCURS 21 TIMES.
01  TOT-56.
    02  TOT-CL56 PICTURE S9(5) OCCURS 3 TIMES.
    02  TOT-COST56 PICTURE S9(7)V99 OCCURS 3 TIMES.
    02  TOT-CD56 PICTURE 9(5) OCCURS 3 TIMES.
01  TOT-7.
    02  TOT-CL7 PICTURE S9(5).
    02  TOT-COST7 PICTURE S9(7)V99.
    02  TOT-CD7 PICTURE 9(5).
01  TOT-19.
    02  TOT-CL19 PICTURE S9(5).
    02  TOT-COST19 PICTURE S9(7)V99.
    02  TOT-CD19 PICTURE 9(5).
01  TOT-71.
    02  TOT-CL71 PICTURE S9(5).
    02  TOT-COST71 PICTURE S9(7)V99.
    02  TOT-CD71 PICTURE 9(5).
PROCEDURE DIVISION.
DECLARATIVES.
A SECTION. USE AFTER STANDARD BEGINNING LABEL
        PROCEDURE ON TAPE-FILE, FILE-56, FILE-7, FILE-19,
        FILE-71.
A-PARA.
    MOVE SPACES TO *BLOCK-COUNT.
    MOVE CON-FILE TO *FILE-NO.
    MOVE SPACES TO *DATE-WRITTEN *PURGE-DATE
        *LABEL-EXCESS.
B SECTION. USE AFTER STANDARD ENDING LABEL
        PROCEDURE ON TAPE-FILE.
B-PARA.
    MOVE CD-COUNT12 TO *BLOCK-COUNT.
C SECTION. USE AFTER STANDARD ENDING LABEL
        PROCEDURE ON FILE-56.
C-PARA.
    MOVE CD-COUNT56 TO *BLOCK-COUNT.
D SECTION. USE AFTER STANDARD ENDING LABEL
        PROCEDURE ON FILE-7.
D-PARA.
    MOVE CD-COUNT7 TO *BLOCK-COUNT.
E SECTION. USE AFTER STANDARD ENDING LABEL
        PROCEDURE ON FILE-19.
E-PARA.
    MOVE CD-COUNT19 TO *BLOCK-COUNT.
F SECTION. USE AFTER STANDARD ENDING LABEL
        PROCEDURE ON FILE-71.
F-PARA.
    MOVE CD-COUNT71 TO *BLOCK-COUNT.
END DECLARATIVES.
G SECTION.
LETS-GO.
    IF *HALT-NAME IS EQUAL TO "SORTIT" GO TO SORT-IT.
START-1.
    ACCEPT CON-CARD.
    IF CON-FLAG IS NOT EQUAL TO "*" DISPLAY
        " CK CONST CARD " STOP 0101 GO TO START-1.
    MOVE CON-CONO TO ST-CONO.
    OPEN OUTPUT PRINT-FILE, TAPE-FILE, FILE-56, FILE-7, FILE-19.
    OPEN OUTPUT FILE-71.
OPEN-IP.
    OPEN INPUT DO-FILE.
R-1.
    READ DO-FILE AT END GO TO CK-NO-TPS.
    IF D-COV IS EQUAL TO 01 OR 02 GO TO CK-12ST.
    IF D-COV IS EQUAL TO 05 OR 06 GO TO START56.
    IF D-COV IS EQUAL TO 07 GO TO START7.
    IF D-COV IS EQUAL TO 19 GO TO START19.
    IF D-COV IS EQUAL TO 71 GO TO START71.
    GO TO R-1.
CK-12ST.
    IF D-ST IS EQUAL TO 20 GO TO R-1.
    MOVE SPACES TO TAPE-REC.
    MOVE CON-CONO TO T-CONO.
    MOVE 2 TO T-KIND.
    MOVE D-DISP-YR TO T-ACCT-YR.
    MOVE CON-MOLO TO T-ACCT-MO.
    IF CON-MO IS EQUAL TO 12 MOVE "?" TO T-ACCT-MO.
    MOVE 41 TO T-LINE.
    IF D-AGT IS NOT EQUAL TO 90 GO TO CONT-12.
    MOVE D-ISS-MO TO MONTH.
    MOVE ISS-YR-LO TO LO-YR.
    MOVE ISS-YR-HI TO HI-YR.
    SUBTRACT 6107 FROM ACCUM1.
    IF ACCUM1 IS NEGATIVE GO TO CONT-12.
    MOVE 49 TO T-LINE.
CONT-12.
    MOVE ISS-YR-LO TO T-EFF-YR.
    MOVE D-ST TO T-STATE.
    MOVE SPACES TO T-TERRM.
    MOVE D-CITY1 TO T-TERR.
    MOVE D-TERR TO T-CLASS.
    MOVE D-CLASS1 TO T-CLASS-2.
    MOVE D-LIMIT TO T-LIMITS.
    IF D-COV-LO IS EQUAL TO 2 MOVE 3 TO T-TYPE GO TO MV-M012.
    IF D-LA IS EQUAL TO 7 MOVE 4 TO T-TYPE GO TO MV-M012.
    IF D-LA IS EQUAL TO 4 MOVE 5 TO T-TYPE GO TO MV-M012.
    IF D-LA IS EQUAL TO 5 MOVE 2 TO T-TYPE GO TO MV-M012.
    IF D-LA IS EQUAL TO 9 MOVE 9 TO T-TYPE ELSE MOVE 1
        TO T-TYPE.
MV-M012.
    MOVE D-ACC-MO-YR TO T-ACC-MOYR.
    MOVE 4 TO T-TRANS.
    MOVE D-CL-CNT TO T-NO-CL THRU "\".
    MOVE D-CL-LO TO T-NUMBER.
    MOVE D-POL TO T-POLNUM.
    MOVE D-AGE TO T-AGE.
    IF 1 IS NOT EQUAL TO D-ADD AND D-CNP ADD NOTHING
        TO D-INDEM MOVE D-INDEM TO T-AMOUNT ADD 1
        TO CD-COUNT12 WRITE TAPE-REC.
    IF D-EXP IS NOT EQUAL TO SPACES MOVE SPACE TO T-NO-CL
        ADD NOTHING TO D-EXP MOVE D-EXP TO T-AMOUNT
        ADD 1 TO CD-COUNT12 MOVE 6 TO T-TRANS
        WRITE TAPE-REC.
    GO TO R-1.
START56.
    MOVE SPACES TO 56-REC.
    MOVE CON-FILL TO 56-CONST.
    MOVE ZEROS TO 56-CL-FILL.
    MOVE D-CLAIM TO 56-CLAIM.
    MOVE D-CLASS1 TO 56-CLASS.
    MOVE D-ST TO 56-STATE.
    MOVE D-CITY1 TO 56-TERR.
    MOVE D-ACC-MO-YR TO 56-ACCMOYR.
    IF D-COV IS EQUAL TO 06 MOVE 3 TO 56-COV MOVE D-LA
        TO 56-ANAL GO TO NEXT-CK56.
    IF D-LA IS EQUAL TO 5 MOVE 2 TO 56-COV ELSE MOVE 1
        TO 56-COV.
NEXT-CK56.
    MOVE 11 TO 56-LINE.
    MOVE D-ISS-MO TO 56-ISSMO.
    MOVE ISS-YR-LO TO 56-ISSYR.
    MOVE D-LIMIT TO 56-CLASS2.
    MOVE D-SYM TO 56-SYM.
    MOVE D-CL-CNT TO 56-CLCNT THRU "\".
    MOVE 4 TO 56-TRANS.
    IF 1 IS EQUAL TO D-ADD OR D-CNP GO TO CK-EXP56.
    IF D-INDEM IS NEGATIVE MOVE ":" TO 56-CR.
    ADD 1 TO CD-COUNT56.
    MOVE D-INDEM TO 56-COST. MOVE SPACES TO 56-COST THRU "^".
    MOVE 1 TO SW-1. WRITE 56-REC.
CK-EXP56.
    IF D-EXP IS EQUAL TO SPACES GO TO CAL-56.
    MOVE SPACE TO 56-CLCNT.
    MOVE 6 TO 56-TRANS.
    ADD 1 TO CD-COUNT56.
    MOVE 1 TO SW-2.
    MOVE SPACE TO 56-CR.
    IF D-EXP IS NEGATIVE MOVE ":" TO 56-CR.
    MOVE D-EXP TO 56-COST. MOVE SPACES TO 56-COST THRU "^".
    WRITE 56-REC.
CAL-56.
    IF SW-1 IS NOT EQUAL TO 1 GO TO CK-SW2.
    MOVE 0 TO SW-1. MOVE 56-COV TO SUB.
    MOVE 00 TO SUB-ST.
SUB-ADD1.
    ADD 01 TO SUB-ST.
    IF D-ST IS NOT EQUAL TO ST-TAB (SUB-ST) GO TO SUB-ADD1.
    ADD 1 TO A-CD56 (SUB, SUB-ST).
    MOVE D-INDEM TO D-CL-CNT THRU "^".
    ADD D-CL-CNT TO A-CL56 (SUB, SUB-ST).
    ADD D-INDEM TO A-COST56 (SUB, SUB-ST).
    ADD 1 TO TOT-CD56 (SUB).
    ADD D-CL-CNT TO TOT-CL56 (SUB).
    ADD D-INDEM TO TOT-COST56 (SUB).
CK-SW2.
    IF SW-2 IS NOT EQUAL TO 1 GO TO R-1.
    MOVE 0 TO SW-2. MOVE 56-COV TO SUB.
    MOVE 00 TO SUB-ST.
ADD-SUB2.
    ADD 1 TO SUB-ST.
    IF D-ST IS NOT EQUAL TO ST-TAB (SUB-ST) GO TO ADD-SUB2.
    ADD 1 TO A-CD56 (SUB, SUB-ST).
    ADD D-EXP TO A-COST56 (SUB, SUB-ST).
    ADD 1 TO TOT-CD56 (SUB).
    ADD D-EXP TO TOT-COST56 (SUB).
    GO TO R-1.
START7.
    IF 1 IS EQUAL TO D-ADD OR D-CNP GO TO R-1.
    MOVE SPACES TO 7-REC.
    MOVE CON-FILL TO 7-CONST.
    MOVE 0 TO 7-CL-FILL.
    MOVE D-CLAIM TO 7-CLAIM.
    MOVE D-CL-1-2 TO 7-CLASS.
    MOVE D-ST TO 7-STATE.
    MOVE D-CITY1  TO 7-TERR.
    MOVE 9 TO 7-TRANS.
    MOVE " 59" TO 7-LINE.
    MOVE D-ACC-YR-LO TO 7-ACCYR.
    MOVE D-CL-CNT TO 7-CLCNT THRU "\".
    IF D-INDEM IS NEGATIVE MOVE ":" TO 7-CR.
    ADD 1 TO CD-COUNT7.
    MOVE D-INDEM TO 7-COST. MOVE SPACES TO 7-COST THRU "^".
    WRITE 7-REC.
    MOVE 00 TO SUB-ST.
SUB-ADD7.
    ADD 01 TO SUB-ST.
    IF D-ST IS NOT EQUAL TO ST-TAB (SUB-ST) GO TO SUB-ADD7.
    ADD 1 TO A-CD7 (SUB-ST).
    MOVE D-INDEM TO D-CL-CNT THRU "^".
    ADD D-INDEM TO A-COST7 (SUB-ST).
    ADD D-CL-CNT TO A-CL7 (SUB-ST).
    ADD D-CL-CNT TO TOT-CL7.
    ADD D-INDEM TO TOT-COST7.
    ADD 1 TO TOT-C    GO TO R-1.
START19.
    IF 1 IS EQUAL TO D-ADD OR D-CNP GO TO R-1.
    MOVE SPACES TO 19-REC.
    MOVE CON-FILL TO 19-CONST.
    MOVE 0 TO 19-CL-FILL.
    MOVE D-CLAIM TO 19-CLAIM.
    MOVE D-ACC-CNT TO 19-FORMA.
    MOVE D-LIMIT TO 19-FORMB.
    MOVE D-ST TO 19-STATE.
    MOVE D-CITY1 TO 19-TERR.
    MOVE 9 TO 19-TRANS.
    IF D-INDEM IS NEGATIVE MOVE ":" TO 19-CR.
    MOVE D-ACC-YR-LO TO 19-ACCYR.
    MOVE D-CL-CNT TO 19-CLCNT THRU "\".
    MOVE D-INDEM TO 19-COST. MOVE SPACES TO 19-COST THRU "^".
    MOVE "199" TO 19-LINE.
    ADD 1 TO CD-COUNT19. WRITE 19-REC.
    MOVE 00 TO SUB-ST.
SUB-ADD19.
    ADD 01 TO SUB-ST.
    IF D-ST IS NOT EQUAL TO ST-TAB (SUB-ST) GO TO SUB-ADD19.
    ADD 1 TO A-CD19 (SUB-ST).
    MOVE D-INDEM TO D-CL-CNT THRU "^".
    ADD D-INDEM TO A-COST19 (SUB-ST).
    ADD D-CL-CNT TO A-CL19 (SUB-ST).
    ADD D-CL-CNT TO TOT-CL19.
    ADD D-INDEM TO TOT-COST19.
    ADD 1 TO TOT-CD19.
    GO TO R-1.
START71.
    IF D-ST IS EQUAL TO 29 GO TO R-1.
    IF D-CNP IS EQUAL TO 1 AND D-EXP IS EQUAL TO SPACES
        GO TO R-1.
    IF (D-ADD IS EQUAL TO 1) AND (D-COL2930 IS NOT EQUAL TO 67
        AND 68) GO TO R-1.
    MOVE SPACES TO 71-REC.
    MOVE ZEROS TO 71-ZERO.
    MOVE 9 TO 71-TYPE1.
    MOVE CON-YR TO 71-CALYR.
    MOVE CON-CONO TO 71-CO.
    MOVE D-ST TO 71-ST.
    MOVE D-CITY1 TO 71-TERR.
    MOVE D-COL2930 TO 71-COL2930.
    MOVE D-CLASS1 TO 71-CLASS.
    MOVE D-LOAGE TO 71-LOAGE.
    MOVE 1 TO 71-TYPE2.
    MOVE ZEROS TO 71-CODE.
    IF D-WIND IS EQUAL TO 9 MOVE 69 TO 71-CODE.
    IF D-WIND IS EQUAL TO 1 MOVE 80 TO 71-CODE.
    MOVE ISS-YR-LO TO 71-ISSYR.
    MOVE D-ISS-MO TO 71-ISSMO.
    MOVE D-ACC-MO TO 71-ACCMO.
    MOVE D-CLAIM TO 71-CLAIM.
    MOVE D-ACC-YR-HI TO 71-ACCYR-HI.
    MOVE D-ACC-YR-LO TO 71-ACCYR-LO.
    IF CON-MO IS EQUAL TO 03 MOVE 1 TO 71-QTR.
    IF CON-MO IS EQUAL TO 06 MOVE 2 TO 71-QTR.
    IF CON-MO IS EQUAL TO 09 MOVE 3 TO 71-QTR.
    IF CON-MO IS EQUAL TO 12 MOVE 4 TO 71-QTR.
    MOVE D-CL-CNT TO 71-CL THRU "\".
    MOVE 2 TO 71-TRANS.
    IF 1 IS EQUAL TO D-ADD OR D-CNP GO TO CK-EXP71.
    IF D-INDEM IS NEGATIVE MOVE ":" TO 71-CR, 71-CR2.
    ADD 1 TO CD-COUNT71.
    MOVE D-INDEM TO 71-COST. MOVE SPACES TO 71-COST
        THRU "^".
    MOVE 1 TO SW-1.
    WRITE 71-REC.
CK-EXP71.
    IF D-EXP IS EQUAL TO SPACES GO TO CAL-71.
    IF D-COL2930 IS NOT EQUAL TO 67 AND 68 GO TO CAL-71.
    MOVE SPACES TO 71-CL.
    MOVE 6 TO 71-TRANS.
    ADD 1 TO CD-COUNT71.
    MOVE 1 TO SW-2.
    MOVE SPACES TO 71-CR, 71-CR2.
    IF D-EXP IS NEGATIVE MOVE ":" TO 71-CR, 71-CR2.
    MOVE D-EXP TO 71-COST. MOVE SPACES TO 71-COST
        THRU "^".
    WRITE 71-REC.
CAL-71.
    IF SW-1 IS NOT EQUAL TO 1 GO TO CK-SW271.
    MOVE 0 TO SW-1.
    MOVE 00 TO SUB-ST.
SUB-ADD71.
    ADD 01 TO SUB-ST.
    IF D-ST IS NOT EQUAL TO ST-TAB (SUB-ST) GO TO SUB-ADD71.
    ADD 1 TO A-CD71 (SUB-ST).
    MOVE D-INDEM TO D-CL-CNT THRU "^".
    ADD D-INDEM TO A-COST71 (SUB-ST).
    ADD D-CL-CNT TO A-CL71 (SUB-ST).
    ADD D-CL-CNT TO TOT-CL71.
    ADD D-INDEM TO TOT-COST71.
    ADD 1 TO TOT-CD71.
CK-SW271.
    IF SW-2 IS NOT EQUAL TO 1 GO TO R-1.
    MOVE 0 TO SW-2.
    MOVE 00 TO SUB-ST.
ADD-SUB71.
    ADD 01 TO SUB-ST.
    IF D-ST IS NOT EQUAL TO ST-TAB (SUB-ST) GO TO ADD-SUB71.
    ADD 1 TO A-CD71 (SUB-ST).
    ADD D-EXP TO A-COST71 (SUB-ST).
    ADD 1 TO TOT-CD71.
    ADD D-EXP TO TOT-COST71.
    GO TO R-1.
CK-NO-TPS.
    CLOSE DO-FILE.
    SUBTRACT 01 FROM CON-NOTPS.
    IF CON-NOTPS IS NOT EQUAL TO 00 DISPLAY
        " MOUNT NEXT D/O TAPE HIT RUN ****** "
        STOP 0101 GO TO OPEN-IP.
    CLOSE TAPE-FILE, FILE-56, FILE-7, FILE-19.
    CLOSE FILE-71.
    DISPLAY "  ". DISPLAY "  ".
    DISPLAY " REMOVE LOG 1 SAVE, MOUNT WORK ***".
    DISPLAY " REMOVE LOG 3 SAVE, LABEL COV 5, 6 MOUNT WORK".
    DISPLAY " REMOVE LOG 4 SAVE, LABEL COV 7,  MOUNT WORK".
    DISPLAY " REMOVE LOG 5 SAVE, LABEL COV 19  ".
    DISPLAY " REMOVE LOG 6 SAVE, LABEL COV 71  ".
    DISPLAY " LOG 2 WILL SORT, ** SAVE UNSORTED LOG 2 **".
    DISPLAY " HIT RUN  4 RPTS WILL PRINT,THEN LOG 2 WILL SORT".
    STOP 0202.
PRINT-HEADING.
    MOVE SPACES TO PRINT-REC. WRITE PRINT-REC BEFORE
        ADVANCING HEAD-OF-FORM.
    IF CON-CONO IS EQUAL TO 6095 WRITE PRINT-REC FROM
        NH-HEAD BEFORE ADVANCING 2 LINES.
    IF CON-CONO IS EQUAL TO 5779 WRITE PRINT-REC FROM
        MM-HEAD BEFORE ADVANCING 2 LINES.
    IF SW-A IS EQUAL TO 1 GO TO CK-SWB.
    WRITE PRINT-REC FROM 56-HEAD BEFORE ADVANCING 2 LINES.
    GO TO PRINT-QTR.
CK-SWB.
    IF SW-B IS EQUAL TO 1 GO TO CK-SWC.
    MOVE 1 TO SW-B.
    WRITE PRINT-REC FROM 7-HEAD BEFORE ADVANCING 2 LINES.
    GO TO PRINT-QTR.
CK-SWC.
    IF SW-C IS EQUAL TO 1 GO TO CK-SWD.
    MOVE 1 TO SW-C.
    WRITE PRINT-REC FROM 19-HEAD BEFORE ADVANCING 2 LINES.
    GO TO PRINT-QTR.
CK-SWD.
    WRITE PRINT-REC FROM 71-HEAD BEFORE ADVANCING 2 LINES.
PRINT-QTR.
    MOVE CON-YR TO QTR-YR.
    IF CON-MO IS EQUAL TO 03 MOVE "1ST" TO QTR-NO.
    IF CON-MO IS EQUAL TO 06 MOVE "2ND" TO QTR-NO.
    IF CON-MO IS EQUAL TO 09 MOVE "3RD" TO QTR-NO.
    IF CON-MO IS EQUAL TO 12 MOVE "4TH" TO QTR-NO.
    WRITE PRINT-REC FROM QTR-HEAD BEFORE ADVANCING 3 LINES.
    IF SW-A IS EQUAL TO 1 GO TO HEAD-719.
    MOVE 1 TO SW-A.
    WRITE PRINT-REC FROM 56-LINE1.
    WRITE PRINT-REC FROM 56-LINE2 BEFORE ADVANCING 2 LINES.
    GO TO END-HEADING.
HEAD-719.
    WRITE PRINT-REC FROM 7-19-LINE1.
    WRITE PRINT-REC FROM 7-19-LINE2 BEFORE ADVANCING 2 LINES.
END-HEADING. EXIT.
PRINT56.
    MOVE 00 TO SUB-ST.
    MOVE 1 TO SUB.
TRY-56.
    ADD 1 TO SUB-ST.
    IF SUB-ST IS EQUAL TO 22 GO TO PRINT-TOTAL-56.
    IF A-CL56 (SUB, SUB-ST) IS NOT EQUAL TO ZEROS GO TO
        PRINT-LINE-56.
    IF A-COST56 (SUB, SUB-ST) IS NOT EQUAL TO ZEROS GO TO
        PRINT-LINE-56.
    IF A-CD56 (SUB, SUB-ST) IS NOT EQUAL TO ZEROS GO TO
        PRINT-LINE-56.
    GO TO TRY-56.
PRINT-LINE-56.
    MOVE SPACES TO DETAIL-56.
    MOVE CON-CONO TO D56-CONO.
    MOVE SUB TO D56-COV.
    MOVE ST-TAB (SUB-ST) TO D56-ST.
    MOVE A-CL56 (SUB, SUB-ST) TO D56-CLCNT.
    MOVE A-COST56 (SUB, SUB-ST) TO D56-COST.
    MOVE A-CD56 (SUB, SUB-ST) TO D56-CDCNT.
    WRITE PRINT-REC FROM DETAIL-56.
    GO TO TRY-56.
PRINT-TOTAL-56.
    MOVE SPACES TO DETAIL-56.
    WRITE PRINT-REC FROM DETAIL-56 BEFORE ADVANCING 2 LINES.
    MOVE TOT-CL56 (SUB) TO D56-CLCNT.
    MOVE TOT-COST56 (SUB) TO D56-COST.
    MOVE TOT-CD56 (SUB) TO D56-CDCNT.
    WRITE PRINT-REC FROM DETAIL-56 BEFORE ADVANCING 3 LINES.
    IF SUB IS EQUAL TO 3 GO TO PRINT7.
    ADD 1 TO SUB. MOVE 00 TO SUB-ST. GO TO TRY-56.
PRINT7.
    PERFORM PRINT-HEADING THRU END-HEADING.
    MOVE 00 TO SUB-ST.
TRY-7.
    ADD 1 TO SUB-ST.
    IF SUB-ST IS EQUAL TO 22 GO TO PRINT-TOTAL-7.
    IF A-CL7 (SUB-ST) IS NOT EQUAL TO ZEROS GO TO
        PRINT-LINE-7.
    IF A-COST7 (SUB-ST) IS NOT EQUAL TO ZEROS GO TO
        PRINT-LINE-7.
    IF A-CD7 (SUB-ST) IS NOT EQUAL TO ZEROS GO TO
        PRINT-LINE-7.
    GO TO TRY-7.
PRINT-LINE-7.
    MOVE SPACES TO DETAIL-7-19.
    MOVE CON-CONO TO D719-CONO.
    MOVE ST-TAB (SUB-ST) TO D719-ST.
    MOVE A-CL7 (SUB-ST) TO D719-CLCNT.
    MOVE A-COST7 (SUB-ST) TO D719-COST.
    MOVE A-CD7 (SUB-ST) TO D719-CDCNT.
    WRITE PRINT-REC FROM DETAIL-7-19.
    GO TO TRY-7.
PRINT-TOTAL-7.
    MOVE SPACES TO DETAIL-7-19.
    WRITE PRINT-REC FROM DETAIL-7-19 BEFORE
    ADVANCING 2 LINES.
    MOVE TOT-CL7 TO D719-CLCNT.
    MOVE TOT-COST7 TO D719-COST.
    MOVE TOT-CD7 TO D719-CDCNT.
    WRITE PRINT-REC FROM DETAIL-7-19 BEFORE
        ADVANCING HEAD-OF-FORM.
PRINT19.
    PERFORM PRINT-HEADING THRU END-HEADING.
    MOVE 00 TO SUB-ST.
TRY-19.
    ADD 1 TO SUB-ST.
    IF SUB-ST IS EQUAL TO 22 GO TO PRINT-TOTAL-19.
    IF A-CL19 (SUB-ST) IS NOT EQUAL TO ZEROS GO TO
        PRINT-LINE-19.
    IF A-COST19 (SUB-ST) IS NOT EQUAL TO ZEROS GO TO
        PRINT-LINE-19.
    IF A-CD19 (SUB-ST) IS NOT EQUAL TO ZEROS GO TO
        PRINT-LINE-19.
    GO TO TRY-19.
PRINT-LINE-19.
    MOVE SPACES TO DETAIL-7-19.
    MOVE CON-CONO TO D719-CONO.
    MOVE ST-TAB (SUB-ST) TO D719-ST.
    MOVE A-CL19 (SUB-ST) TO D719-CLCNT.
    MOVE A-COST19 (SUB-ST) TO D719-COST.
    MOVE A-CD19 (SUB-ST) TO D719-CDCNT.
    WRITE PRINT-REC FROM DETAIL-7-19.
    GO TO TRY-19.
PRINT-TOTAL-19.
    MOVE SPACES TO DETAIL-7-19.
    WRITE PRINT-REC FROM DETAIL-7-19 BEFORE
        ADVANCING 2 LINES.
    MOVE TOT-CL19 TO D719-CLCNT.
    MOVE TOT-COST19 TO D719-COST.
    MOVE TOT-CD19 TO D719-CDCNT.
    WRITE PRINT-REC FROM DETAIL-7-19 BEFORE
        ADVANCING HEAD-OF-FORM.
PRINT-71.
    PERFORM PRINT-HEADING THRU END-HEADING.
    MOVE 00 TO SUB-ST.
TRY-71.
    ADD 1 TO SUB-ST.
    IF SUB-ST IS EQUAL TO 22 GO TO PRINT-TOTAL-71.
    IF A-CL71 (SUB-ST) IS NOT EQUAL TO ZEROS GO TO
        PRINT-LINE-71.
    IF A-COST71 (SUB-ST) IS NOT EQUAL TO ZEROS GO TO
        PRINT-LINE-71.
    IF A-CD71 (SUB-ST) IS NOT EQUAL TO ZEROS GO TO
        PRINT-LINE-71.
    GO TO TRY-71.
PRINT-LINE-71.
    MOVE SPACES TO DETAIL-7-19.
    MOVE CON-CONO TO D719-CONO.
    MOVE ST-TAB (SUB-ST) TO D719-ST.
    MOVE A-CL71 (SUB-ST) TO D719-CLCNT.
    MOVE A-COST71 (SUB-ST) TO D719-COST.
    MOVE A-CD71 (SUB-ST) TO D719-CDCNT.
    WRITE PRINT-REC FROM DETAIL-7-19.
    GO TO TRY-71.
PRINT-TOTAL-71.
    MOVE SPACES TO DETAIL-7-19.
    WRITE PRINT-REC FROM DETAIL-7-19 BEFORE
    ADVANCING 2 LINES.
    MOVE TOT-CL71 TO D719-CLCNT.
    MOVE TOT-COST71 TO D719-COST.
    MOVE TOT-CD71 TO D719-CDCNT.
    WRITE PRINT-REC FROM DETAIL-7-19 BEFORE
    ADVANCING HEAD-OF-FORM.
    CLOSE PRINT-FILE.
    DISPLAY " HEY   DID YOU MOUNT WORK TAPES ON 1,3,4, ".
    DISPLAY " ***IF SO HIT RUN*** ".
    DISPLAY " ** DONT FORGET TO SAVE UNSORTED LOG 2**".
    DISPLAY " AFTER PRE SORT, LABEL IT COV 1, 2 **".
    STOP 0303.
SORT-IT.
    MOVE "/SORTF" TO *PROGRAM.
    MOVE 01 TO *SEGMENT.
    STOP RUN.
END COBOL
    a (c