 IDENTIFICATION DIVISION.
 PROGRAM-ID.     ODS100.
 AUTHOR.         DAVID PHILPOTT.
 INSTALLATION.   OPTICAL DATA SYSTEMS.
 DATE-WRITTEN.   SEPTEMBER 1972.
 DATE-COMPILED.
 REMARKS.    PROCESSES CREDIT CARD DATA FILES
             ASSIGNING CHANNEL ALGORITHM BASED ON ACCOUNT NUMBERS
             FOR SORTING OF OUTPUT DATA SET
             BY ALGORITHMS DERIVED, BY EDITED ACCOUNT NUMBERS.
 
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SOURCE-COMPUTER. DECSYSTEM-10.
 OBJECT-COMPUTER. DECSYSTEM-10.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
     SELECT  DINERS-CLUB ASSIGN TO DSK RECORDING MODE IS ASCII.
     SELECT  CARTE-BLANCHE ASSIGN TO DSK RECORDING MODE IS ASCII.
     SELECT  INTER-BANK ASSIGN TO DSK RECORDING MODE IS ASCII.
     SELECT  CARD-FILE   ASSIGN TO DSK RECORDING MODE IS ASCII.
     SELECT MERGE-FILE     ASSIGN TO DSK RECORDING MODE IS ASCII.
     SELECT REPORT-FILE    ASSIGN TO DSK RECORDING MODE IS ASCII.
 DATA DIVISION.
 FILE SECTION.
 FD  DINERS-CLUB
         LABEL RECORDS ARE OMITTED
         RECORD CONTAINS 49 CHARACTERS
         BLOCK CONTAINS 0 RECORDS
         DATA RECORD IS DC-REC.
 01  DC-REC.
     05  D-ACCT.
         10  D-1ST-10.
             15  D-1ST-9                 PICTURE X(9).
             15 D-10TH                   PICTURE X.
         10 D-LST-2                      PICTURE XX.
     05  D-CHECK                         PICTURE X.
     05  FILLER                          PICTURE XX.
     05  D-STAT                          PICTURE X.
     05  FILLER                          PICTURE X(31).
     05  D-ALPHA-CODE                    PICTURE X.
     05  D-REC-CODE                      PICTURE X.
 FD  CARTE-BLANCHE
         VALUE OF ID IS "CARTEBDAT"
         LABEL RECORDS ARE STANDARD
         RECORD CONTAINS 36 CHARACTERS
         BLOCK  CONTAINS 0  RECORDS
         DATA RECORD IS CB-REC.
 01  CB-REC.
     05  C-CTL-REC.
         10  C-CTL-NO.
             15  C-LIT                   PICTURE XXX.
             15  FILLER                  PICTURE X(6).
         10  FILLER                      PIC X(27).
     05  C-ACCT-REC  REDEFINES C-CTL-REC.
         10  C-ACCT-AREA OCCURS 3 TIMES.
             15  C-ACCT                  PIC X(10).
             15  C-LS-CD                 PIC X.
             15  FILLER                  PIC X.
 FD  INTER-BANK
     VALUE OF ID IS "OPTDATDAT"
         LABEL RECORDS ARE STANDARD
         RECORD CONTAINS 80 CHARACTERS
         BLOCK CONTAINS 0 RECORDS
         DATA RECORD IS IB-REC.
 01  IB-REC                              PICTURE X(80).
 FD  CARD-FILE
         VALUE OF ID IS "CARDINDAT"
         LABEL RECORDS ARE STANDARD
         RECORD CONTAINS 80 CHARACTERS
         BLOCK  CONTAINS 0  RECORDS
         DATA RECORD IS ADD-REC.
 01  ADD-REC.
     05  A-REC.
         10  A-CARD-NO                   PICTURE XX.
         10  A-ACCT                      PICTURE X(12).
         10  FILLER  REDEFINES A-ACCT.
           12 A-SHT-ACCT.
             15  A-CTRL  PICTURE XX.
             15 FILLER                   PICTURE X(7).
           12 A-BLANK-CK                 PICTURE X(3).
         10  A-GREY-CODE                 PICTURE X.
         10  A-ACCT-RJ                   PICTURE X(12).
     05  FILLER                          PICTURE X(53).
 FD  REPORT-FILE
     VALUE OF ID IS "REPORTDAT"
         LABEL RECORDS ARE STANDARD
         RECORD CONTAINS 133 CHARACTERS
         BLOCK  CONTAINS 0   RECORDS
         DATA RECORD IS RPT-LINE.
 01  RPT-LINE                            PICTURE X(133).
 FD  MERGE-FILE
     VALUE OF ID IS "MERGE1DAT"
         LABEL RECORDS ARE STANDARD
         RECORD CONTAINS 24 CHARACTERS
         BLOCK CONTAINS  0  RECORDS
         DATA RECORD IS MERGE-REC.
 01  MERGE-REC.
     05  M-CARD-NO                       PICTURE XX.
     05  M-ACCT-LJ                       PICTURE X(21).
     05  M-GREY-CODE                     PICTURE X.
 
 WORKING-STORAGE SECTION.
 77  SP      COMPUTATIONAL   VALUE ZERO  PICTURE S99.
 77  C       COMPUTATIONAL   VALUE ZERO  PICTURE S9.
 77  ACARD-NR    PICTURE XX.
 77  CHARS           COMPUTATIONAL       PICTURE S99.
 77  SHIFT-INDEX     COMPUTATIONAL       PICTURE S99.
 
 01  COUNTERS.
     05  COUNT-AREA  USAGE IS COMP.
         10  IN-CNT      VALUE ZERO      PICTURE S9(7).
         10  ERR-CNT     VALUE ZERO      PICTURE S9(5).
         10  DUP-CNT     VALUE ZERO      PICTURE S9(5).
         10  PG-CNT      VALUE ZERO      PICTURE S9(5).
         10  LN-CNT      VALUE +060      PICTURE S999.
         10  OUTPUT-CNT  VALUE ZERO      PICTURE S9(9).
         10  OUTPUT-TOT  VALUE ZERO      PICTURE S9(9).
 
 01  PRINTER-AREAS.
     05  RPT-HEAD.
         10  FILLER  PICTURE X(45)   VALUE  ' REPORT ODS010'.
         10  FILLER  PICTURE X(14)   VALUE   'LOAD LIST FOR '.
         10  H-FILE  PICTURE X(16).
         10  FILLER  VALUE SPACES        PICTURE X(30).
         10  FILLER  PICTURE X(5)    VALUE   'DATE '.
         10  H-DATE  PICTURE X(8).
         10  FILLER  PICTURE X(10)   VALUE   '     PAGE '.
         10  H-PAGE  PICTURE ZZZZ9.
 
     05  SUB-HEAD.
         10  FILLER  PICTURE XXX     VALUE SPACES.
         10  FILLER  PICTURE X(26)   VALUE ' G/C ACCOUNT/NO'.
         10  FILLER  PICTURE X(26)   VALUE ' G/C ACCOUNT/NO'.
         10  FILLER  PICTURE X(26)   VALUE ' G/C ACCOUNT/NO'.
         10  FILLER  PICTURE X(26)   VALUE ' G/C ACCOUNT/NO'.
         10  FILLER  PICTURE X(26)   VALUE ' G/C ACCOUNT/NO'.
 
     05  DTL-LN.
         10  FILLER  PICTURE XXX     VALUE SPACES.
         10  R-ACCT-AREA OCCURS 5 TIMES.
             15  L-GREY-CODE  PICTURE X.
             15  FILLER  PICTURE X.
             15  L-CARD      PICTURE XX.
             15  L-ACCT      PICTURE X(21).
             15  FILLER PICTURE X.
 
 
 01  HOLD-AREAS.
     05  H-CARD-NO                       PICTURE XX.
     05  H-GREY-CODE      PICTURE X.
     05  H-ACCT.
         10  H-1ST-10.
             15  H-1ST-9     PICTURE X(9).
             15  H-10TH      PICTURE X.
         10  H-LAST-11.
             15  FILLER                  PICTURE XX.
             15  H-DIGIT-13              PICTURE X.
             15  FILLER                  PICTURE X(8).
     05  FILLER REDEFINES H-ACCT.
         10  FILLER                      PICTURE X(9).
         10  H-LAST-12                   PICTURE X(12).
 01  HOLD-REC                            PICTURE X(24).
 01  IB-AREAS.
           10 IB-ACCT-AREA OCCURS 3 TIMES.
               15 IB-REGION              PICTURE X.
               15 IB-ICANO               PICTURE XXXX.
               15 IB-ACCT                PICTURE X(21).
               15 FILLER                 PICTURE X.
 01  IB-TEMP-TST                         PICTURE X(21).
 01  IB-TEMP.
  02  FILLER                             PICTURE X.
  02  IBT-20.
   03  FILLER                            PICTURE X.
   03  IBT-19.
    04  FILLER                           PICTURE X.
    04  IBT-18.
     05  FILLER                          PICTURE X.
     05  IBT-17.
      06  FILLER                         PICTURE X.
      06  IBT-16.
       07  FILLER                        PICTURE X.
       07  IBT-15.
        08  FILLER                       PICTURE X.
        08  IBT-14.
         09  FILLER                      PICTURE X.
         09  IBT-13.
          10  FILLER                      PICTURE X.
          10  IBT-12.
           11  FILLER                     PICTURE X.
           11  IBT-11.
            12  FILLER                    PICTURE X.
            12  IBT-10.
             13  FILLER                   PICTURE X.
             13  IBT-9.
              14  FILLER                  PICTURE X.
              14  IBT-8.
               15  FILLER                 PICTURE X.
               15  IBT-7.
                16  FILLER                PICTURE X.
                16  IBT-6.
                 17  FILLER               PICTURE X.
                 17  IBT-5.
                  18  FILLER              PICTURE X.
                  18  IBT-4.
                   19  FILLER             PICTURE X.
                   19  IBT-3.
                    20  FILLER            PICTURE X.
                    20  IBT-2.
                     21  FILLER           PICTURE X.
                     21  IBT-1           PICTURE X.
 
 PROCEDURE DIVISION.
 BEGIN.
     MOVE TODAY   TO  H-DATE.
     MOVE SPACES TO DTL-LN.
     MOVE ZEROS TO HOLD-REC.
     OPEN OUTPUT REPORT-FILE  MERGE-FILE.
     GO TO 500-OPEN6.
 
 005-OPEN1.
     OPEN INPUT DINERS-CLUB
         OUTPUT REPORT-FILE  MERGE-FILE.
     MOVE 'DINERS CLUB'  TO  H-FILE.
 
     MOVE 32 TO H-CARD-NO.
 010-READ1.
     READ DINERS-CLUB    AT END  GO TO 090-CLOSE1.
     IF D-ACCT = ALL '9' GO TO 090-CLOSE1.
     ADD 1   TO  IN-CNT.
     IF D-REC-CODE = '1' OR '2' OR '4'
              IF D-1ST-9 IS NUMERIC
                   MOVE D-1ST-9 TO H-1ST-9
                   MOVE SPACES TO H-LAST-12
                   GO TO DC-COMMON
              ELSE  GO TO ERR2.
     IF D-REC-CODE = '3',
              IF D-1ST-10 IS NUMERIC
                   MOVE D-1ST-10 TO H-1ST-10
                   MOVE SPACES TO H-LAST-11
                   GO TO DC-COMMON
              ELSE  GO TO ERR2.
     DISPLAY DC-REC ' INVALID REC CODE'.
     GO TO 010-READ1.
 ERR2.
         ADD 1 TO ERR-CNT
         DISPLAY DC-REC ' INVALID ACCT NO'.
     GO TO 010-READ1.
 DC-COMMON.
     IF D-STAT = SPACE OR '4' OR '6' OR '8',
         IF D-ALPHA-CODE = 'A'
             MOVE '3' TO H-GREY-CODE
         ELSE
         MOVE '8'  TO H-GREY-CODE
     ELSE
     IF D-STAT = '1' OR '2' OR '3' OR '5'
         MOVE '9' TO H-GREY-CODE
     ELSE DISPLAY DC-REC ' INVALID GREY CODE - SET TO 0'
         MOVE '8'  TO H-GREY-CODE.
     PERFORM 900-APPLY-ALGORITHM THRU 920-EXIT.
     GO TO 010-READ1.
 
 090-CLOSE1.
     IF SP NOT = ZERO
         PERFORM 915-WRITE.
     DISPLAY 'DINERS CLUB INPUT    ' IN-CNT.
     DISPLAY 'DINERS CLUB ERRORS   ' ERR-CNT.
     DISPLAY 'DINERS CLUB DUPES    ' DUP-CNT.
     DISPLAY 'DINERS CLUB OUTPUT   ' OUTPUT-CNT.
     ADD OUTPUT-CNT TO OUTPUT-TOT.
     MOVE ZERO TO IN-CNT, ERR-CNT, OUTPUT-CNT, DUP-CNT.
     CLOSE DINERS-CLUB.
 
 100-OPEN2.
     OPEN INPUT CARTE-BLANCHE.
     MOVE 'CARTE BLANCHE'    TO H-FILE.
     MOVE +060   TO  LN-CNT.
     MOVE 27 TO H-CARD-NO.
 
  110-READ2.
     READ CARTE-BLANCHE  AT END GO TO 190-CLOSE2.
     IF C-LIT = 'CTL' AND IN-CNT = ZERO, GO TO 110-READ2.
     IF C-LIT = 'CTL'                    GO TO 190-CLOSE2.
     MOVE 1  TO C.
  120-ACCT-CK.
     IF C-ACCT (C) = SPACES
             GO TO 190-CLOSE2.
     ADD 1   TO IN-CNT.
     MOVE C-ACCT (C) TO H-1ST-10
     MOVE SPACES TO H-LAST-11.
     IF C-LS-CD (C) = '*', MOVE '9' TO H-GREY-CODE,
     ELSE
     IF C-LS-CD (C) = ' ', MOVE '8' TO H-GREY-CODE,
     ELSE
     IF C-LS-CD (C) = '/', MOVE '3' TO H-GREY-CODE,
     ELSE
         DISPLAY C-ACCT-AREA (C) ' INVALID GREY CODE - SET TO 0',
         MOVE '8'  TO H-GREY-CODE.
     IF C-ACCT (C) IS NUMERIC
         PERFORM 900-APPLY-ALGORITHM THRU 920-EXIT
     ELSE
         ADD 1 TO ERR-CNT
         DISPLAY C-ACCT-AREA (C) ' INVALID ACCT NO'.
  180-RTN.
     IF C LESS THAN 3    ADD 1 TO C      GO TO 120-ACCT-CK.
     GO TO 110-READ2.
 
 190-CLOSE2.
     IF SP NOT = ZERO
         PERFORM 915-WRITE.
     DISPLAY 'CARTE BLANCHE INPUT '  IN-CNT.
     DISPLAY 'CARTE BLANCHE ERRORS'  ERR-CNT.
     DISPLAY 'CARTE BLANCHE DUPES  ' DUP-CNT.
     DISPLAY 'CARTE BLANCHE OUTPUT'  OUTPUT-CNT.
     ADD OUTPUT-CNT TO OUTPUT-TOT.
     MOVE ZERO TO IN-CNT, ERR-CNT, OUTPUT-CNT, DUP-CNT.
     CLOSE CARTE-BLANCHE.
 
 200-OPEN3.
     OPEN INPUT CARD-FILE.
     MOVE 'ADDITIONS'           TO H-FILE.
     MOVE +060   TO LN-CNT.
 
 210-READ3.
     READ CARD-FILE      AT END GO TO 290-CLOSE3.
     IF A-CARD-NO = '* '
         MOVE A-CTRL TO ACARD-NR
         GO TO 210-READ3.
     ADD 1   TO IN-CNT.
     MOVE A-ACCT TO H-ACCT.
     MOVE ACARD-NR TO H-CARD-NO.
     MOVE A-GREY-CODE TO H-GREY-CODE.
     IF ACARD-NR = '82'
         MOVE A-GREY-CODE TO H-DIGIT-13
         MOVE '8' TO H-GREY-CODE.
     IF ACARD-NR = '32'
         MOVE '3' TO H-GREY-CODE.
     IF A-ACCT IS NUMERIC
         IF A-GREY-CODE IS NUMERIC
             PERFORM 900-APPLY-ALGORITHM THRU 920-EXIT
                 GO TO 210-READ3.
     IF A-BLANK-CK = '   '
              IF A-SHT-ACCT IS NUMERIC
                       PERFORM 900-APPLY-ALGORITHM THRU 920-EXIT
                     GO TO 210-READ3.
         ADD 1 TO ERR-CNT
         DISPLAY A-REC  ' INVALID ACCT NO'.
     GO TO 210-READ3.
 
 290-CLOSE3.
     IF SP NOT = ZERO    PERFORM 915-WRITE.
     DISPLAY 'CARD FILE INPUT      ' IN-CNT.
     DISPLAY 'CARD FILE ERRORS     ' ERR-CNT.
     DISPLAY 'DUPLICATE CARDS      ' DUP-CNT.
     DISPLAY 'CARD FILE OUTPUT     ' OUTPUT-CNT.
     ADD OUTPUT-CNT TO OUTPUT-TOT.
     MOVE ZERO TO IN-CNT, ERR-CNT, OUTPUT-CNT, DUP-CNT.
     CLOSE CARD-FILE.
 500-OPEN6.
     OPEN INPUT INTER-BANK.
     MOVE 'INTER BANK' TO H-FILE.
     MOVE +060 TO LN-CNT.
     MOVE 62 TO H-CARD-NO.
 510-READ6.
     READ INTER-BANK   AT END GO TO 590-CLOSE6.
     MOVE IB-REC TO IB-AREAS.
     MOVE 1 TO C.
 IB-REMOVE.
     IF IB-ACCT (C) = SPACES  GO TO 590-CLOSE6.
     ADD 1 TO IN-CNT.
     EXAMINE IB-ACCT (C) TALLYING ALL ' '.
     COMPUTE CHARS = 21 - TALLY.
     IF TALLY = ZERO
         GO TO 510-PROCESS.
     MOVE IB-ACCT (C) TO IB-TEMP.
 IB-ROUTINE.
     EXAMINE IB-TEMP TALLYING UNTIL FIRST ' '.
     IF TALLY = CHARS  GO TO 510-PROCESS.
     COMPUTE SHIFT-INDEX = 20 - TALLY.
     GO TO IBS1, IBS2, IBS3, IBS4, IBS5, IBS6, IBS7, IBS8,
     IBS9, IBS10, IBS11, IBS12, IBS13, IBS14, IBS15, IBS16,
     IBS17, IBS18, IBS19, IBS20 DEPENDING ON SHIFT-INDEX.
 IBS1.   MOVE IBT-1 TO IBT-2.
         GO TO IB-ROUTINE.
 IBS2.   MOVE IBT-2 TO IBT-3.
         GO TO IB-ROUTINE.
 IBS3.   MOVE IBT-3 TO IBT-4.
         GO TO IB-ROUTINE.
 IBS4.   MOVE IBT-4 TO IBT-5.
         GO TO IB-ROUTINE.
 IBS5.   MOVE IBT-5 TO IBT-6.
         GO TO IB-ROUTINE.
 IBS6.   MOVE IBT-6 TO IBT-7.
         GO TO IB-ROUTINE.
 IBS7.   MOVE IBT-7 TO IBT-8.
         GO TO IB-ROUTINE.
 IBS8.   MOVE IBT-8 TO IBT-9.
         GO TO IB-ROUTINE.
 IBS9.   MOVE IBT-9 TO IBT-10.
         GO TO IB-ROUTINE.
 IBS10.  MOVE IBT-10 TO IBT-11.
         GO TO IB-ROUTINE.
 IBS11.  MOVE IBT-11 TO IBT-12.
         GO TO IB-ROUTINE.
 IBS12.  MOVE IBT-12 TO IBT-13.
         GO TO IB-ROUTINE.
 IBS13.  MOVE IBT-13 TO IBT-14.
         GO TO IB-ROUTINE.
 IBS14.  MOVE IBT-14 TO IBT-15.
         GO TO IB-ROUTINE.
 IBS15.  MOVE IBT-15 TO IBT-16.
         GO TO IB-ROUTINE.
 IBS16.  MOVE IBT-16 TO IBT-17.
         GO TO IB-ROUTINE.
 IBS17.  MOVE IBT-17 TO IBT-18.
         GO TO IB-ROUTINE.
 IBS18.  MOVE IBT-18 TO IBT-19.
         GO TO IB-ROUTINE.
 IBS19.  MOVE IBT-19 TO IBT-20.
         GO TO IB-ROUTINE.
 IBS20.  MOVE IBT-20 TO IB-TEMP.
         GO TO IB-ROUTINE.
 510-PROCESS.
     GO TO X1, X2, X3, X4, X5, X6, X7, X8, X9, X10, X11, X12, X13,
     X14, X15, X16, X17, X18, X19, X20, X21 DEPENDING ON CHARS.
 X1. MOVE ZEROS TO IBT-20.
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-20
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X2. MOVE ZEROS TO IBT-19
 IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-19
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X3. MOVE ZEROS TO IBT-18
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-18
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X4. MOVE ZEROS TO IBT-17
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-17
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X5. MOVE ZEROS TO IBT-16
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-16
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X6. MOVE ZEROS TO IBT-15
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-15
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X7. MOVE ZEROS TO IBT-14
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-14
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X8. MOVE ZEROS TO IBT-13
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-13
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X9. MOVE ZEROS TO IBT-12
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-12
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X10. MOVE ZEROS TO IBT-11
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-11
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X11. MOVE ZEROS TO IBT-10
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-10
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X12. MOVE ZEROS TO IBT-9
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-9
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X13. MOVE ZEROS TO IBT-8
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-8
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X14. MOVE ZEROS TO IBT-7
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-7
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X15. MOVE ZEROS TO IBT-6
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-6
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X16. MOVE ZEROS TO IBT-5
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-5
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X17. MOVE ZEROS TO IBT-4
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-4
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X18. MOVE ZEROS TO IBT-3
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-3
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X19. MOVE ZEROS TO IBT-2
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-2
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X20. MOVE ZEROS TO IBT-1
     IF IB-TEMP IS NUMERIC
         MOVE 'AAAAAAAAAAAAAAAAAAAA' TO IBT-1
         GO TO PRFRM-WRITE.
     GO TO ERR1.
 X21.
     IF IB-TEMP IS NUMERIC
         GO FRM-WRITE.
     GO TO ERR1.
 PRFRM-WRITE.
     MOVE IB-TEMP TO H-ACCT.
     MOVE '8' TO H-GREY-CODE.
     PERFORM 900-APPLY-ALGORITHM THRU 920-EXIT.
     GO TO 580-RTN.
 ERR1.
     ADD 1 TO ERR-CNT.
     DISPLAY IB-ACCT (C) 'INVALID ACCT NO'.
 580-RTN.
     IF C LESS THAN 3  ADD 1 TO C   GO TO IB-REMOVE.
     GO TO 510-READ6.
 590-CLOSE6.
     IF SP NOT = ZERO
         PERFORM 915-WRITE.
     DISPLAY 'INTER BANK INPUT     '  IN-CNT.
     DISPLAY 'INTER BANK ERRORS    '  ERR-CNT.
     DISPLAY 'INTER-BANK DUPES     ' DUP-CNT.
     DISPLAY 'INTER BANK OUTPUT   '  OUTPUT-CNT.
     ADD OUTPUT-CNT TO OUTPUT-TOT.
     MOVE ZERO TO IN-CNT, ERR-CNT, OUTPUT-CNT, DUP-CNT.
     CLOSE INTER-BANK.
 END-OF-JOB.
     CLOSE MERGE-FILE REPORT-FILE.
     DISPLAY 'TOTAL OUTPUT RECORDS ' OUTPUT-TOT.
     STOP RUN.
 
 900-APPLY-ALGORITHM.
     IF HOLD-AREAS = HOLD-REC,
         ADD 1 TO DUP-CNT,
         GO TO 920-EXIT.
     MOVE HOLD-AREAS TO HOLD-REC.
     MOVE H-CARD-NO TO M-CARD-NO.
     MOVE H-ACCT TO M-ACCT-LJ.
     MOVE H-GREY-CODE TO M-GREY-CODE.
     WRITE MERGE-REC.
     ADD 1 TO OUTPUT-CNT.
     ADD 1 TO SP.
     MOVE H-CARD-NO TO L-CARD (SP).
     MOVE H-ACCT TO L-ACCT (SP).
     MOVE H-GREY-CODE TO L-GREY-CODE (SP).
     IF SP IS LESS THAN 5, GO TO 920-EXIT.
     IF LN-CNT NOT GREATER THAN +056 GO TO 915-WRITE.
     ADD 1   TO PG-CNT.
     MOVE PG-CNT TO H-PAGE.
     WRITE RPT-LINE FROM RPT-HEAD    AFTER ADVANCING   0 LINES.
     WRITE RPT-LINE FROM SUB-HEAD    AFTER ADVANCING   2 LINES.
     WRITE RPT-LINE FROM DTL-LN      AFTER ADVANCING   2 LINES.
     MOVE SPACES TO DTL-LN.
     MOVE ZERO TO SP.
     MOVE +004   TO LN-CNT.
     GO TO 920-EXIT.
 
 915-WRITE.
     WRITE RPT-LINE FROM DTL-LN      AFTER ADVANCING   1 LINES.
     MOVE SPACES TO DTL-LN.
     ADD +001    TO LN-CNT.
     MOVE ZERO   TO SP.
 
 920-EXIT.
     EXIT.
    K@ï