IDENTIFICATION DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.
START.
        DISPLAY 'IN MAIN PGM.' UPON CONSOLE.
BEGIN.
        COPY LIB1.
EOJ.
        STOP RUN.
