IDENTIFICATION  DIVISION.
PROGRAM-ID.  'T3010'.
AUTHOR.  CAGNEY FRANCE, S L OPTNER AND ASSOCIATES INC.
INSTALLATION.  DATA SERVICE BUREAU, DEPT. OF TRAFFIC, CITY OF L.A.
DATE-WRITTEN.  AUGUST 1969.
REMARKS. PROGRAM ACCEPTS ALL WEEKLY PHASE 2 TRAFFIC CARD INPUT,
     BASIC EDITING IS DONE, THE FOLLOWING FILES ARE CREATED -
     WEEKLY ERROR (DISK) AND VALID WEEKLY INPUT (DISK).
ENVIRONMENT  DIVISION.
CONFIGURATION  SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
INPUT-OUTPUT  SECTION.
FILE-CONTROL.
     SELECT CARDIN ASSIGN DSK,
      RECORDING MODE IS ASCII.
     SELECT DISKOP ASSIGN DSK,
      RECORDING MODE IS ASCII.
     SELECT ERROP  ASSIGN DSK,
      RECORDING MODE IS ASCII.
     SELECT ISFILE ASSIGN DSK,
      RECORDING MODE IS ASCII
     RESERVE NO ALTERNATE AREA
     ACCESS MODE IS INDEXED
     SYMBOLIC KEY IS IS-FILE-KEY RECORD KEY IS IS-KEY.
I-O-CONTROL.
DATA  DIVISION.
FILE  SECTION.
FD   CARDIN
         VALUE OF IDENTIFICATION IS "TOUT3ADAT"
     BLOCK CONTAINS 40 RECORDS
     RECORD CONTAINS  80 CHARACTERS
     LABEL RECORDS ARE STANDARD.
01   CARD-REC.
     03  FILLER                      PICTURE  X(78).
     03  CARD-CODE                   PICTURE  XX.
01   CARD-21.
     03  21-REQ                      PICTURE  X(4).
     03  21-IS-CODE                  PICTURE  X(10).
     03  21-IS-C REDEFINES 21-IS-CODE.
         05  IS-C-1                  PICTURE X(05).
         05  IS-C-2                  PICTURE X(05).
     03  21-LOC1                     PICTURE  X.
     03  21-LOC2                     PICTURE  X.
     03  21-LOC3                     PICTURE  X.
     03  21-DATE                     PICTURE  X(6).
     03  21-DOW                      PICTURE  X.
     03  21-PHYS                     PICTURE  X(9).
     03  21-P-D REDEFINES 21-PHYS.
         05  PD-TYPE                 PICTURE  X.
         05  PD-BAL                  PICTURE  X(8).
     03  21-DIST                     PICTURE  XX.
     03  FILLER                      PICTURE  X(45).
01   CARD-22.
     03  22-REQ                      PICTURE  X(4).
     03  22-DIR                      PICTURE  X.
     03  22-TIME-HR                  PICTURE  XX.
     03  22-TIM-HR REDEFINES 22-TIME-HR  PICTURE  99.
     03  22-TIME-AP                  PICTURE  X.
      03  22-COUNTS                   PICTURE  X(64).
     03  FILLER REDEFINES 22-COUNTS.
         05  22-COUNT    OCCURS 16 TIMES   PICTURE X(4).
     03  FILLER                      PICTURE       X(8).
01   CARD-30-34.
     03 30-34-REQ                    PICTURE XXX.
     03 30-34-IS-CODE                PICTURE X(10).
     03 30-34-REQUESTER              PICTURE X(15).
     03 30-34-DATE                   PICTURE X(12).
     03 FILLER                       PICTURE X(40).
01   CARD-35-36.
     03 35-36-REQ                    PICTURE XXX.
     03 CAT-PARA             PICTURE X(42).
     03 CATEGORY REDEFINES CAT-PARA OCCURS 14 TIMES
                             PICTURE XXX.
     03 CAT-LIMIT                    PICTURE XX.
     03 35-36-REQUESTER              PICTURE X(11).
     03 35-36-DATE                   PICTURE X(12).
     03 35-36-TIME                   PICTURE X(8).
     03 FILLER                       PICTURE XX.
01   CARD-14.
     03 14-IS-CODE-OLD               PICTURE X(10).
     03 14-IS-CODE-NEW               PICTURE X(10).
     03 14-NAME-1                    PICTURE X(29).
     03 14-NAME-2                    PICTURE X(29).
     03 FILLER                       PICTURE XX.
01   CARD-15.
     03 15-IS-CODE                   PICTURE X(10).
     03 15-NAME-1                    PICTURE X(30).
     03 15-NAME-2                    PICTURE X(30).
     03 15-CLASS-CODE                PICTURE X.
     03 15-LEGS                      PICTURE X.
     03 15-CODE                      PICTURE X.
     03 15-MAINT-AREA                PICTURE XXXX.
     03 15-TR-DIST                   PICTURE X.
     03 FILLER                       PICTURE XX.
01   CARD-25.
     03 25-IS-CODE                   PICTURE X(10).
     03 25-DATE                      PICTURE X(6).
     03 25-DOW                       PICTURE X.
     03 25-LOC                       PICTURE XXX.
     03 25-DIST                      PICTURE XX.
     03 25-AM-PEAK                   PICTURE X(14).
     03 25-PM-PEAK                   PICTURE X(14).
     03 25-T-6-HR                    PICTURE X(10).
     03 25-ADJ-FACTOR                PICTURE XXX.
     03 FILLER                       PICTURE X(17).
01   CARD-27.
     03 27-IS-CODE                   PICTURE X(10).
     03 27-DATE                      PICTURE X(6).
     03 27-LOC                       PICTURE XXX.
     03 27-TYPE                      PICTURE X.
     03 27-ACTION                    PICTURE X.
     03 FILLER                       PICTURE X(59).
01   CARD-31-32-33.
     03 31-REQ                       PICTURE XXX.
     03 31-IS-CODE                   PICTURE X(10).
     03 31-LAST-IS-CODE              PICTURE X(5).
     03 31-CODE                      PICTURE X.
     03 31-REQUESTER                 PICTURE X(15).
     03 31-DATE                      PICTURE X(12).
     03 FILLER                       PICTURE X(34).
01   CARD-28.
     03 28-NO                PICTURE X(5).
     03 28-29-N1 REDEFINES 28-NO.
        05 28-29-JURIS       PICTURE X(01).
        05 28-29-NO          PICTURE X(04).
     03 28-29-N2 REDEFINES 28-29-N1.
        05 FILLER            PICTURE X(04).
        05 28-29-NO-5        PICTURE X(01).
     03 28-AST               PICTURE X.
     03 28-C                 PICTURE X.
     03 28-A                 PICTURE X.
     03 28-J                 PICTURE X.
     03 28-K                 PICTURE X.
     03 28-L1                PICTURE X.
     03 28-L2                PICTURE X.
     03 28-M                 PICTURE X.
     03 FILLER               PICTURE XXX.
     03 28-DATE              PICTURE X(6).
     03 28-S-DIST            PICTURE X(5).
     03 28-SEG-VOL           PICTURE X(6).
     03 FILLER               PICTURE X(47).
01   CARD-29.
     03 29-NO                PICTURE X(5).
     03 29-S-DIST            PICTURE X(5).
     03 29-S-VOL             PICTURE X(6).
     03 29-SEG-CLASS.
     05 29-C                 PICTURE X.
     05 29-A                 PICTURE X.
     05 29-J                 PICTURE X.
     05 29-K                 PICTURE X.
     05 29-L1                PICTURE X.
     05 29-L2                PICTURE X.
     05 29-M                 PICTURE X.
     05 FILLER               PICTURE XXX.
     03 29-DATE              PICTURE X(6).
     03 29-ROUTE             PICTURE X(5).
     03 29-X-1               PICTURE X(5).
     03 29-X-2               PICTURE X(5).
     03 29-STRAF             PICTURE XXX.
     03 FILLER               PICTURE X(30).
FD   DISKOP
         VALUE OF IDENTIFICATION IS "DKOP3CDAT"
     RECORD CONTAINS 100 CHARACTERS
     BLOCK CONTAINS 72 RECORDS
     LABEL RECORDS ARE STANDARD
     DATA RECORD IS DISK-REC.
01   DISK-REC.
     03  DISK-1-80                   PICTURE  X(80).
     03  DISK-81-100                 PICTURE  X(20).
     03  END-21 REDEFINES DISK-81-100.
         05  21-KEY                  PICTURE  X(4).
         05  21-NO                   PICTURE  X(4).
         05  21-SEQ                  PICTURE  X.
         05  21-BAL                  PICTURE  X(11).
     03  END-22 REDEFINES END-21.
         05  22-KEY                  PICTURE  X(4).
         05  22-NO                   PICTURE  X(4).
         05  22-SEQ                  PICTURE  X.
         05  22-DIRTN                PICTURE  X.
         05  22-TIME                 PICTURE  99.
         05  22-BAL                  PICTURE  X(8).
FD   ERROP
         VALUE OF IDENTIFICATION IS "EROP3CDAT"
     RECORD CONTAINS 100 CHARACTERS
     BLOCK CONTAINS 72 RECORDS
     LABEL RECORDS ARE STANDARD
     DATA RECORD IS ERROR-REC.
01   ERROR-REC.
     03 ER-1-80                      PICTURE  X(80).
     03 ER-CODE1                     PICTURE  XX.
     03 ER-COL1                      PICTURE  XX.
     03 ER-CODE2                     PICTURE XX.
     03 ER-COL2                      PICTURE  XX.
     03 ER-CODE3                     PICTURE XX.
     03 ER-COL3                      PICTURE  XX.
     03 FILLER                       PICTURE X(6).
     03 ERROR-CODE                   PICTURE XX.
FD   ISFILE
         VALUE OF IDENTIFICATION IS "INTSRTIDX"
     RECORD CONTAINS 300 CHARACTERS
     BLOCK CONTAINS   10 RECORDS
     LABEL RECORDS ARE STANDARD


     DATA RECORD IS IS-REC.
01   IS-REC.
     03  FILLER                      PICTURE  X.
     03  IS-KEY                      PICTURE  X(10).
     03 FILLER                       PICTURE X(289).
WORKING-STORAGE  SECTION.
77   FILLER-1        PICTURE X(2000) VALUE SPACES.
77   FILLER-2        PICTURE X(2000) VALUE SPACES.
77   FILLER-3        PICTURE X(2000) VALUE SPACES.
77   FILLER-4        PICTURE X(2000) VALUE SPACES.
77   ERR-CODE                        PICTURE  99.
77   DATE-ERR-SW                     PICTURE  9      VALUE 0.
77   ERR-COL                         PICTURE  99.
77   INDEX-1     COMPUTATIONAL       PICTURE  S99    VALUE 01.
77   INDEX-2     COMPUTATIONAL       PICTURE  S99    VALUE 01.
77   COUNT-HOLD                      PICTURE  9(4).
77   IS-H                            PICTURE X(5).
77   ER-S                            PICTURE 9 VALUE ZERO.
77   S                               PICTURE 9 VALUE ZERO.
77   E                               PICTURE 9 VALUE ZERO.
77   C                               PICTURE 99.
77   NE-SW                           PICTURE 9 VALUE ZERO.
77   SW-SW                           PICTURE 9 VALUE ZERO.
77   VOL-FLUSH-SW                    PICTURE X(01).
01   IS-FILE-KEY.
     03  IS-ST-1                     PICTURE  X(5).
     03  IS-ST-2                     PICTURE  X(5).
01   DATE-WORK.
     03  DW-MO                       PICTURE  XX.
     03  DW-DA                       PICTURE  XX.
     03  DW-YR                       PICTURE  XX.
01   CH-2            PICTURE XX.
01   FILLER REDEFINES CH-2.
     03 FILLER       PICTURE X.
     03 CH-2A        PICTURE X.
01   COMPUTERS-DATE.

     03 DATE.
        05 MO                        PICTURE 99 VALUE 05.
        05 FILLER                PICTURE X(01).
        05 DA                        PICTURE 99 VALUE 15.
        05 FILLER                PICTURE X(01).
        05 YR                        PICTURE 99 VALUE 73.
     03 FILLER                       PICTURE X(7).
01   WORK-TIME.
     03 FROM-TIME                    PICTURE XXXX.
     03 TO-TIME                      PICTURE XXXX.
01   T-WORK.
     03 TIME-H                       PICTURE XX.
     03 TIME-M                       PICTURE XX.
01     IS-TEST                       PICTURE X(10).
01     IS-TESTX REDEFINES IS-TEST.
        03 FILLER                    PICTURE X(9).
        03 IS-TEST-1                 PICTURE X.
01   LOC-WORK.
     03 LOC-W1                       PICTURE X.
     03 LOC-W2                       PICTURE X.
     03 LOC-W3                       PICTURE X.
01   CARD-CODE-HOLD.
     03 FILLER                       PICTURE XX VALUE ZEROES.
     03 CODE-HOLD                    PICTURE XX.
01   REQ-TEST                        PICTURE XXX.
01   REQ-TESTX REDEFINES REQ-TEST.
     03 FILLER                       PICTURE XX.
     03 REQ-TEST-1                   PICTURE X.
01   WORK-DAT.
     03 FROM-DATE                    PICTURE X(6).
     03 TO-DATE                      PICTURE X(6).
01   CAT-HOLD                        PICTURE XXX.
01   CAT-HOLDX REDEFINES CAT-HOLD.
     03 FILLER                       PICTURE XX.
     03 CAT-1                        PICTURE X.
01   PEAK-WORK.
     03 AM-NE.
        05 NE-HR.
           07 NE-HR-1                PICTURE XX.
           07 NE-HR-2                PICTURE X.
        05 NE-VOL                    PICTURE XXXX.
        05 NE-VOLX REDEFINES NE-VOL.
           07 FILLER                 PICTURE XXX.
           07 NE-VOL-1               PICTURE X.
     03 AM-SW.
        05 SW-HR.
           07 SW-HR-1                PICTURE XX.
           07 SW-HR-2                PICTURE X.
        05 SW-VOL                    PICTURE XXXX.
        05 SW-VOLX REDEFINES SW-VOL.
           07 FILLER                 PICTURE XXX.
           07 SW-VOL-1               PICTURE X.
01   6-HR-TOT.
     03 6-HR-NE                      PICTURE X(5).
     03 6-HR-NEX REDEFINES 6-HR-NE.
        05 FILLER                    PICTURE XXXX.
        05 6-HR-NE-1                 PICTURE X.
     03 6-HR-SW                      PICTURE X(5).
01   INPUT-COUNT.
        03 ACC-14    PICTURE 9999 VALUE ZEROES.
        03 ACC-15    PICTURE 9999 VALUE ZEROES.
        03 ACC-21    PICTURE 9999 VALUE ZEROES.
        03 ACC-22    PICTURE 9999 VALUE ZEROES.
        03 ACC-25    PICTURE 9999 VALUE ZEROES.
        03 ACC-27    PICTURE 9999 VALUE ZEROES.
        03 ACC-28    PICTURE 9999 VALUE ZEROES.
        03 ACC-29    PICTURE 9999 VALUE ZEROES.
        03 ACC-30    PICTURE 9999 VALUE ZEROES.
        03 ACC-31    PICTURE 9999 VALUE ZEROES.
        03 ACC-32    PICTURE 9999 VALUE ZEROES.
        03 ACC-33    PICTURE 9999 VALUE ZEROES.
        03 ACC-34    PICTURE 9999 VALUE ZEROES.
        03 ACC-35    PICTURE 9999 VALUE ZEROES.
        03 ACC-36    PICTURE 9999 VALUE ZEROES.
        03 ACC-XX    PICTURE 9999 VALUE ZEROES.
01   SE-TEST                 PICTURE X(5).
01   SE-TESTX REDEFINES SE-TEST.
     03 FILLER               PICTURE XXXX.
     03 SE-TEST-1            PICTURE X.
01   SE-T                    PICTURE X(6).
01   SE-TX REDEFINES SE-T.
     03 FILLER               PICTURE X(5).
     03 SE-T-1               PICTURE X.
PROCEDURE  DIVISION.
START.
     OPEN INPUT  CARDIN
                 ISFILE
          OUTPUT DISKOP
                 ERROP.
READ-CARD.
     MOVE SPACES TO ERROR-REC MOVE ZERO TO S E.
     READ CARDIN RECORD AT END GO TO END-OF-JOB.
     IF CARD-CODE IS EQUAL TO 21 GO TO ROUT-21.
     IF CARD-CODE IS EQUAL TO 22 GO TO ROUT-22.
     IF CARD-CODE = '14' MOVE '14' TO CODE-HOLD
     ADD 1 TO ACC-14
         PERFORM EDIT-RTN-14 THRU EDIT-RTN-14-X, GO TO READ-CARD.
     IF CARD-CODE = '15' MOVE '15' TO CODE-HOLD
     ADD 1 TO ACC-15
         PERFORM EDIT-RTN-15 THRU EDIT-RTN-15-X, GO TO READ-CARD.
     IF CARD-CODE = '25' MOVE '25' TO CODE-HOLD
         PERFORM EDIT-RTN-25 THRU EDIT-RTN-25-X, GO TO READ-CARD.
     IF CARD-CODE = '27' MOVE '27' TO CODE-HOLD
         PERFORM EDIT-RTN-27 THRU EDIT-RTN-27-X, GO TO READ-CARD.
     IF CARD-CODE = '28' MOVE '28' TO CODE-HOLD
         ADD 1 TO ACC-28
         PERFORM EDIT-RTN-28 THRU EDIT-RTN-28-X, GO TO READ-CARD.
     IF CARD-CODE = '29' MOVE '29' TO CODE-HOLD
         ADD 1 TO ACC-29
         PERFORM EDIT-RTN-29 THRU EDIT-RTN-29-X, GO TO READ-CARD.
     IF CARD-CODE = '30' MOVE '30' TO CODE-HOLD
     ADD 1 TO ACC-30
         PERFORM EDIT-RTN-30 THRU EDIT-RTN-30-X, GO TO READ-CARD.
     IF CARD-CODE = '31' MOVE '31' TO CODE-HOLD
     ADD 1 TO ACC-31
         PERFORM EDIT-RTN-31 THRU EDIT-RTN-31-X, GO TO READ-CARD.
     IF CARD-CODE = '32' MOVE '32' TO CODE-HOLD
     ADD 1 TO ACC-32
         PERFORM EDIT-RTN-32 THRU EDIT-RTN-32-X, GO TO READ-CARD.
     IF CARD-CODE = '33' MOVE '33' TO CODE-HOLD
     ADD 1 TO ACC-33
         PERFORM EDIT-RTN-33 THRU EDIT-RTN-33-X, GO TO READ-CARD.
     IF CARD-CODE = '34' MOVE '34' TO CODE-HOLD
     ADD 1 TO ACC-34
         PERFORM EDIT-RTN-34 THRU EDIT-RTN-34-X, GO TO READ-CARD.
     IF CARD-CODE = '35' MOVE '35' TO CODE-HOLD
     ADD 1 TO ACC-35
         PERFORM EDIT-RTN-35 THRU EDIT-RTN-35-X, GO TO READ-CARD.
     IF CARD-CODE = '36' MOVE '36' TO CODE-HOLD
     ADD 1 TO ACC-36
         PERFORM EDIT-RTN-36 THRU EDIT-RTN-36-X, GO TO READ-CARD.
     PERFORM CARD-CODE-ERROR THRU CARD-CODE-ERROR-X
     ADD 1 TO ACC-XX
         GO TO READ-CARD.
ROUT-21.
     MOVE ZERO TO VOL-FLUSH-SW.
     IF 21-REQ IS NOT NUMERIC, MOVE 01 TO ERR-CODE, MOVE 01 TO
             ERR-COL, PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.


     IF IS-C-1 IS GREATER THAN IS-C-2, MOVE IS-C-2 TO IS-ST-1,
             MOVE IS-C-1 TO IS-ST-2, ELSE MOVE 21-IS-CODE
             TO IS-FILE-KEY.
             READ ISFILE RECORD INVALID KEY PERFORM ERR-02.
R-21-A.
     IF 21-LOC1  IS LESS THAN 1 OR 21-LOC1  IS GREATER THAN 6,
             MOVE 03 TO ERR-CODE, MOVE 15 TO ERR-COL,
             PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF 21-LOC2  IS NOT EQUAL TO 2 AND 21-LOC2 IS NOT EQUAL TO 8
            AND 21-LOC2  IS NOT EQUAL TO  0, MOVE 03 TO ERR-CODE,
             MOVE 16 TO ERR-COL,
             PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF 21-LOC3  IS LESS THAN 0 OR 21-LOC3 IS GREATER THAN 5,
             MOVE 03 TO ERR-CODE, MOVE 17 TO ERR-COL,
             PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     MOVE 21-DATE TO DATE-WORK, PERFORM COMMON-DATE-EDIT, IF
             DATE-ERR-SW IS EQUAL TO 1, MOVE 0 TO DATE-ERR-SW,
             MOVE 04 TO ERR-CODE, MOVE 18 TO ERR-COL,
             PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF 21-DOW IS LESS THAN 1 OR 21-DOW IS GREATER THAN  7, MOVE
             07 TO ERR-CODE,  MOVE 24 TO ERR-COL,
             PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF PD-BAL IS NOT NUMERIC MOVE 08 TO ERR-CODE,
             MOVE 26 TO ERR-COL, PERFORM OUTPUT-ERROR-ROUTINE
             THRU OP-EXIT.
     IF 21-DIST IS NOT ALPHABETIC MOVE 14 TO ERR-CODE,
             MOVE 34 TO ERR-COL, PERFORM OUTPUT-ERROR-ROUTINE
             THRU OP-EXIT.
     IF ER-1-80 IS EQUAL TO CARD-REC AND ER-CODE1 IS NOT EQUAL TO
             SPACES, PERFORM I-C-2 THRU OP-EXIT, GO TO READ-CARD.
     IF ER-1-80 IS EQUAL TO CARD-REC GO TO READ-CARD.
             GO TO GEN-21.
ERR-02.
     MOVE 02 TO ERR-CODE, MOVE 05 TO ERR-COL, PERFORM
             OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
GEN-21.
     IF VOL-FLUSH-SW = 1 GO TO READ-CARD.
     MOVE CARD-REC TO DISK-1-80.
     MOVE ZEROS TO 21-KEY.
     MOVE 21-REQ TO 21-NO.
     MOVE 1 TO 21-SEQ.
     MOVE ZEROS TO 21-BAL.
     PERFORM WRITE-OP-ROUTINE.  GO TO READ-CARD.
ROUT-22.
     IF VOL-FLUSH-SW = 1 GO TO READ-CARD.
     IF 22-REQ IS NOT NUMERIC MOVE 01 TO ERR-CODE, MOVE 01 TO
             ERR-COL, PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF 22-DIR IS NOT EQUAL TO '1', AND   22-DIR IS NOT EQUAL TO
             '2' AND 22-DIR IS NOT EQUAL TO '3', AND 22-DIR IS NOT
             EQUAL TO '4', AND 22-DIR IS NOT EQUAL TO '5',
             MOVE 05 TO ERR-CODE, MOVE 05 TO
             ERR-COL, PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF 22-TIME-HR IS NOT EQUAL TO 12, AND 22-TIME-HR IS NOT EQUAL
             TO 04 AND   22-TIME-HR IS NOT EQUAL TO 08, MOVE 06
             TO ERR-CODE, MOVE 06 TO ERR-COL, PERFORM
             OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF 22-TIME-AP IS NOT EQUAL TO '1', AND   22-TIME-AP IS NOT
             EQUAL TO '2', MOVE 06 TO ERR-CODE, MOVE 08 TO
             ERR-COL, PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
EDIT-COUNTS.
     MOVE 01 TO INDEX-1.
     MOVE 02 TO INDEX-2.
LOOP-1.
     IF 22-COUNT (INDEX-1) IS NOT NUMERIC, PERFORM COUNT-ERR-1.
     IF 22-COUNT (INDEX-2) IS NOT NUMERIC, PERFORM COUNT-ERR-2.
     IF 22-COUNT (INDEX-2) IS LESS THAN 22-COUNT (INDEX-1),
             PERFORM COUNT-ERR-2.
     ADD 01 TO INDEX-1.
     ADD 01 TO INDEX-2.
     IF INDEX-1 IS EQUAL TO 4, ADD 1 TO INDEX-1, ADD 1 TO INDEX-2.
     IF INDEX-1 IS EQUAL TO 8, ADD 1 TO INDEX-1, ADD 1 TO INDEX-2.
     IF INDEX-1 IS EQUAL TO 12 ADD 1 TO INDEX-1, ADD 1 TO INDEX-2.
     IF INDEX-1 IS EQUAL TO 16, GO TO GEN-22.
     GO TO LOOP-1.
COUNT-ERR-1.
     MOVE 17 TO ERR-CODE.  COMPUTE ERR-COL =
             (5 + (INDEX-1 * 4)).
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
COUNT-ERR-2.
     MOVE 17 TO ERR-CODE.
     COMPUTE ERR-COL = (09 + (INDEX-1 * 4)).
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
GEN-22.
     IF VOL-FLUSH-SW = 1 GO TO READ-CARD.
     IF ER-1-80 IS EQUAL TO CARD-REC AND ER-CODE1 IS NOT EQUAL TO
             SPACES, PERFORM I-C-2 THRU OP-EXIT, GO TO READ-CARD.
     IF ER-1-80 IS EQUAL TO CARD-REC, GO TO READ-CARD.
     MOVE CARD-REC TO DISK-1-80.
     MOVE ZEROS TO 22-KEY.
     MOVE 22-REQ TO 22-NO.
     MOVE 2 TO 22-SEQ.
     IF 22-DIR = 1, MOVE 'N' TO 22-DIR.
     IF 22-DIR = 2, MOVE 'E' TO 22-DIR.
     IF 22-DIR = 3, MOVE 'S' TO 22-DIR.
     IF 22-DIR = 4, MOVE 'W' TO 22-DIR.
     IF 22-DIR = 5, MOVE 'B' TO 22-DIR.
     MOVE 22-DIR TO 22-DIRTN.
     MOVE 22-TIM-HR  TO 22-TIME.
     IF 22-TIME-HR IS EQUAL TO 12, MOVE 00 TO 22-TIME.
     IF 22-TIME-AP IS EQUAL TO '2' ADD 12 TO 22-TIME.
     MOVE ZEROS TO 22-BAL.
     PERFORM WRITE-OP-ROUTINE.
     GO TO READ-CARD.
COMMON-DATE-EDIT.
     IF DW-MO IS LESS THAN 01 OR    DW-MO IS GREATER THAN 12
             MOVE 1 TO DATE-ERR-SW.
     IF DW-DA IS LESS THAN 01 OR    DW-DA IS GREATER THAN 31,
             MOVE 1 TO DATE-ERR-SW.
     IF DW-YR LESS THAN ZERO OR DW-YR GREATER THAN YR
     MOVE 1 TO DATE-ERR-SW.
OUTPUT-ERROR-ROUTINE.
     IF CARD-CODE = 21 OR
        CARD-CODE = 22
        MOVE 1 TO VOL-FLUSH-SW.
     IF ERROR-REC IS EQUAL TO SPACES GO TO INSERT-CODE.
     IF ER-1-80 IS EQUAL TO CARD-REC GO TO I-C-1.
     MOVE CARD-CODE TO ERROR-CODE.
     WRITE ERROR-REC.
INSERT-CODE.
     MOVE CARD-REC TO ER-1-80.
I-C-1.
     IF ER-CODE1 = SPACES MOVE 1 TO E MOVE ERR-CODE TO ER-CODE1
             MOVE ERR-COL TO ER-COL1, GO TO OP-EXIT.
     IF ER-CODE2 IS EQUAL TO SPACES, MOVE ERR-CODE TO ER-CODE2,
             MOVE ERR-COL TO ER-COL2, GO TO OP-EXIT.
     MOVE ERR-CODE TO ER-CODE3, MOVE ERR-COL TO ER-COL3.
I-C-2.
     MOVE CARD-CODE TO ERROR-CODE.
     WRITE ERROR-REC.
     MOVE 1 TO S.
     MOVE CARD-REC TO ER-1-80.
     MOVE SPACES TO ER-CODE1.
     MOVE SPACES TO ER-CODE2.
     MOVE SPACES TO ER-CODE3.
     MOVE SPACES TO ER-COL1.
     MOVE SPACES TO ER-COL2.
     MOVE SPACES TO ER-COL3.
OP-EXIT.
     EXIT.
WRITE-OP-ROUTINE.
     WRITE DISK-REC.
END-OF-JOB.
     DISPLAY 'COUNT  TYPE INPUT'.
     DISPLAY '                 '.
     DISPLAY ACC-14 '    I/S FILE CODE CHANGE (14)            '.
     DISPLAY ACC-15 '    I/S FILE REVISIONS (15)              '.
     DISPLAY ACC-28 '    NETWORK FILE REVISIONS (28)          '.
     DISPLAY ACC-29 '    NETWORK FILE ADDITIONS (29)          '.
     DISPLAY ACC-30 '    TRAFFIC ACCIDENT/LOC ANALYSIS (30)   '.
     DISPLAY ACC-31 '    TRAFFIC ACCIDENT/LOC ANALYSIS (31)   '.
     DISPLAY ACC-32 '    ACCIDENT ROUTE ANALYSIS (32)         '.
     DISPLAY ACC-33 '    ACCIDENT DISTRIBUTION CHART (33)     '.
     DISPLAY ACC-34 '    HISTORICAL TRAFFIC VOLUME BY LOC (34)'.
     DISPLAY ACC-35 '    ACCIDENT CATEGORY-LOC (35)           '.
     DISPLAY ACC-36 '    ACCIDENT CATEGORY-SEGMENT (36)       '.
     DISPLAY ACC-XX '    UNIDENTIFIED INPUT                   '.
     CLOSE CARDIN, DISKOP.
     CLOSE ISFILE ERROP.
     STOP RUN.
EDIT-RTN-14.
     MOVE 14-IS-CODE-OLD TO IS-FILE-KEY.
     PERFORM IS-CODE-EDIT THRU IS-CODE-EDIT-X.
     IF ER-S = 1 MOVE ZERO TO ER-S MOVE 02 TO ERR-CODE
         MOVE 01 TO ERR-COL  PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
     MOVE 14-IS-CODE-NEW TO IS-TEST.
     IF  IS-TEST  NOT NUMERIC GO TO RTN-14-A.
     IF  IS-TEST-1  < ZERO NEXT SENTENCE ELSE GO TO RTN-14-B.

RTN-14-A.
     MOVE 02 TO ERR-CODE MOVE 11 TO ERR-COL
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
RTN-14-B.
     IF 14-NAME-1 = SPACES  MOVE 21 TO ERR-COL PERFORM RTN-14-C.
     IF ER-1-80 = CARD-REC AND ER-CODE1 = SPACES
         GO TO EDIT-RTN-14-X.
     IF 14-NAME-2 NOT = SPACES  GO TO RTN-14-D.
     MOVE 50 TO ERR-COL.
RTN-14-C.
     MOVE 09 TO ERR-CODE PERFORM  OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
RTN-14-D.
     IF ER-1-80 = CARD-REC AND ER-CODE1 NOT = SPACES
         PERFORM I-C-2 THRU OP-EXIT GO TO EDIT-RTN-14-X.
     IF  ER-1-80 = CARD-REC GO TO EDIT-RTN-14-X.
     PERFORM WRITE-DISK THRU WRITE-DISK-X.
EDIT-RTN-14-X.  EXIT.
1F.
     MOVE 15-IS-CODE TO IS-TEST.
     IF IS-TEST NOT NUMERIC GO TO 1F-A.
     IF IS-TEST-1 < ZERO NEXT SENTENCE ELSE GO TO 1F-X.
1F-A.
     MOVE 02 TO ERR-CODE MOVE 01 TO ERR-COL
      PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
1F-X.   EXIT.
EDIT-RTN-15.
     IF 15-CODE = '1' GO TO X5.
     MOVE 15-IS-CODE TO IS-FILE-KEY.
     PERFORM IS-CODE-EDIT THRU IS-CODE-EDIT-X.
     IF ER-S = 1 MOVE ZERO TO ER-S MOVE 02 TO ERR-CODE
         MOVE 01 TO ERR-COL  PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
     IF 15-CODE = ZERO OR 15-CODE > 3 MOVE 12 TO ERR-CODE
         MOVE 73 TO ERR-COL PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT GO TO RTN-15-C.
X5.  IF 15-CODE = '1' AND 15-NAME-1 = SPACES
         MOVE 11 TO ERR-COL PERFORM RTN-15-A.
     IF 15-CODE = '1' AND 15-NAME-2 = SPACES NEXT SENTENCE ELSE
         GO TO RTN-15-B.
         MOVE 41 TO ERR-COL.
RTN-15-A.
     MOVE 09 TO ERR-CODE PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
RTN-15-B.
     IF 15-CODE < ZERO NEXT SENTENCE ELSE GO TO RTN-15-C.
     IF S = 1 GO TO EDIT-RTN-15-X.
     IF 15-CLASS-CODE NOT = SPACES NEXT SENTENCE ELSE GO TO Y1.
     IF 15-CLASS-CODE < '0' MOVE 10 TO ERR-CODE MOVE 71 TO ERR-COL
         PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
Y1.  IF S = 1 GO TO EDIT-RTN-15-X.
     IF 15-LEGS NOT = SPACES NEXT SENTENCE ELSE GO TO  Y2.
     IF 15-LEGS < '1' MOVE 72 TO ERR-COL
     MOVE 11 TO ERR-CODE
         PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
Y2.  IF S = 1 GO TO EDIT-RTN-15-X.
     IF 15-MAINT-AREA NOT = SPACES NEXT SENTENCE ELSE GO TO Y3.
     IF 15-MAINT-AREA < '1000' OR 15-MAINT-AREA > '7250'
         MOVE 74 TO ERR-COL MOVE 13 TO ERR-CODE PERFORM
         OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
Y3.  IF S = 1 GO TO EDIT-RTN-15-X.
     IF 15-TR-DIST    NOT = SPACES NEXT SENTENCE ELSE
         GO TO RTN-15-C.
     IF 15-TR-DIST < '1' OR 15-TR-DIST > '5' MOVE 78 TO ERR-COL
         MOVE 15 TO ERR-CODE PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
RTN-15-C.
     IF E = 1 AND S = ZERO PERFORM I-C-2 THRU OP-EXIT
         GO TO EDIT-RTN-15-X.
     IF S = 1 GO TO EDIT-RTN-15-X.
     PERFORM WRITE-DISK THRU WRITE-DISK-X.
EDIT-RTN-15-X.  EXIT.
EDIT-RTN-25.
     EXAMINE 25-AM-PEAK REPLACING ALL SPACES BY ZEROES.
     EXAMINE 25-PM-PEAK REPLACING ALL SPACES BY ZEROES.
     EXAMINE 25-T-6-HR REPLACING ALL SPACES BY ZEROES.
     PERFORM EDIT-RTN-27.
     IF 25-DOW > ZERO AND 25-DOW < '8' GO TO RTN-25-A.
         MOVE 07 TO ERR-CODE MOVE 17 TO ERR-COL
         PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF S = 1 GO TO EDIT-RTN-25-X.
RTN-25-A.
     MOVE 25-LOC TO LOC-WORK. PERFORM LOC-CK THRU LOC-CK-X.
     IF ER-S = 1 MOVE ZERO TO ER-S   MOVE 03 TO ERR-CODE
         MOVE 18 TO ERR-COL  PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
     IF S = 1 GO TO EDIT-RTN-25-X.
     IF 25-DIST IS ALPHABETIC GO TO RTN-25-B.
         MOVE 14 TO ERR-CODE MOVE 21 TO ERR-COL
         PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF S = 1 GO TO EDIT-RTN-25-X.
RTN-25-B.
     MOVE 25-AM-PEAK TO PEAK-WORK
     PERFORM  PEAK-CK THRU PEAK-CK-X.
     IF NE-SW = 1 MOVE ZERO TO NE-SW MOVE 23 TO ERR-COL
         MOVE 23 TO ERR-CODE PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
     IF S = 1  MOVE ZERO TO SW-SW GO TO EDIT-RTN-25-X.
     IF SW-SW = 1 MOVE ZERO TO SW-SW MOVE 30 TO ERR-COL
     PERFORM V1 THRU V1-X.
     IF S = 1 GO TO EDIT-RTN-25-X.
     MOVE 25-PM-PEAK TO PEAK-WORK.
     PERFORM PEAK-CK THRU PEAK-CK-X.
     IF NE-SW = 1 MOVE ZERO TO NE-SW MOVE 37 TO ERR-COL
         PERFORM V1 THRU V1-X.
     IF S = 1  MOVE ZERO TO SW-SW GO TO EDIT-RTN-25-X.
     IF SW-SW = 1 MOVE ZERO TO SW-SW MOVE 44 TO ERR-COL
         PERFORM V1 THRU V1-X.
     IF S = 1  GO TO EDIT-RTN-25-X.
     MOVE 25-T-6-HR TO 6-HR-TOT.
     IF 6-HR-NE NOT NUMERIC MOVE 51 TO ERR-COL GO TO RTN-25-C.
     IF 6-HR-NE-1 < ZERO    MOVE 51 TO ERR-COL GO TO RTN-25-C.
     IF 6-HR-NE > '15000' MOVE 51 TO ERR-COL GO TO RTN-25-C.
     GO TO RTN-25-D.
RTN-25-C.
     MOVE 17 TO ERR-CODE
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
RTN-25-D.
     IF S = 1 GO TO EDIT-RTN-25-X.
     MOVE 6-HR-SW TO 6-HR-NE.
     IF 6-HR-NE NOT NUMERIC MOVE 56 TO ERR-COL GO TO RTN-25-E.
     IF 6-HR-NE-1 < ZERO  MOVE 56 TO ERR-COL GO TO RTN-25-E.
     IF 6-HR-NE > '15000' MOVE 56 TO ERR-COL GO TO RTN-25-C.
     GO TO RTN-25-F.
RTN-25-E.
     PERFORM RTN-25-C.
RTN-25-F.
     IF S = 1 GO TO EDIT-RTN-25-X.
     MOVE 25-ADJ-FACTOR TO REQ-TEST.
     IF REQ-TEST NOT NUMERIC GO TO RTN-25-G.
     IF REQ-TEST-1 < ZERO GO TO RTN-25-G.
     GO TO RTN-25-H.
RTN-25-G.
     MOVE '235' TO 25-ADJ-FACTOR.
RTN-25-H.
     IF E = 1 AND S = ZERO PERFORM I-C-2 THRU OP-EXIT
         GO TO EDIT-RTN-25-X.
     IF S = 1  GO TO EDIT-RTN-25-X.
     PERFORM WRITE-DISK THRU WRITE-DISK-X.
EDIT-RTN-25-X.  EXIT.
PEAK-CK.
     IF NE-HR-1 < ZERO OR NE-HR-1 > '24' MOVE 1 TO NE-SW
         GO TO PEAK-CK-A.
     IF NE-HR-2 NOT = ZERO AND NE-HR-2 NOT = '1' AND NE-HR-2
         NOT = '3' AND NE-HR-2 NOT = '4' MOVE 1 TO NE-SW
         GO TO PEAK-CK-A.
     IF NE-VOL NOT NUMERIC MOVE 1 TO NE-SW GO TO PEAK-CK-A.
     IF NE-VOL-1 < ZERO MOVE 1 TO NE-SW GO TO PEAK-CK-A.
     IF NE-VOL > '5000' MOVE 1 TO NE-SW.
PEAK-CK-A.
     IF SW-HR-1 < ZERO OR SW-HR-1 > '24' MOVE 1 TO SW-SW
         GO TO PEAK-CK-X.
     IF SW-HR-2 NOT = ZERO AND  SW-HR-2 NOT = '1' AND SW-HR-2
         NOT = '3' AND SW-HR-2 NOT = '4' MOVE 1 TO SW-SW
         GO TO PEAK-CK-X.
     IF SW-VOL NOT NUMERIC MOVE 1 TO SW-SW GO TO PEAK-CK-X.
     IF SW-VOL-1 < ZERO MOVE 1 TO SW-SW GO TO PEAK-CK-X.
     IF SW-VOL > '5000' MOVE 1  TO SW-SW.
PEAK-CK-X.  EXIT.
V1.  MOVE 23 TO ERR-CODE
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
V1-X.  EXIT.
EDIT-RTN-27.
     MOVE 27-IS-CODE TO IS-FILE-KEY.
     PERFORM IS-CODE-EDIT THRU IS-CODE-EDIT-X.
     IF ER-S = 1 MOVE ZERO TO ER-S MOVE 01 TO ERR-COL
         MOVE 02 TO ERR-CODE PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
     MOVE 27-DATE TO DATE-WORK.
     PERFORM COMMON-DATE-EDIT.
     IF DATE-ERR-SW = 1 MOVE ZERO TO DATE-ERR-SW
     MOVE 04 TO ERR-CODE MOVE 11 TO ERR-COL
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
R7.  MOVE 27-LOC TO  LOC-WORK.
     PERFORM LOC-CK THRU LOC-CK-X.
     IF ER-S = 1, MOVE ZERO TO ER-S, MOVE 03 TO ERR-CODE
         MOVE 17 TO ERR-COL PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
     IF S = 1 GO TO EDIT-RTN-27-X.
     IF 27-TYPE NOT = '1' AND 27-TYPE NOT = '2'
         MOVE 16 TO ERR-CODE, MOVE 20 TO ERR-COL
         PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF S = 1 GO TO EDIT-RTN-27-X.
     IF 27-ACTION NOT = '1' AND 27-ACTION NOT = '2'
         MOVE 18 TO ERR-CODE, MOVE 21 TO ERR-COL
         PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF E = 1 AND S = ZERO PERFORM I-C-2 THRU OP-EXIT
         GO TO EDIT-RTN-27-X.
     IF S = 1 GO TO EDIT-RTN-27-X.
     PERFORM WRITE-DISK THRU WRITE-DISK-X.
EDIT-RTN-27-X.  EXIT.
EDIT-RTN-30.
     MOVE 30-34-REQ TO REQ-TEST.

     GO TO RTN-30-B.
RTN-30-A.
     MOVE 01 TO ERR-CODE, MOVE 01 TO ERR-COL
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
RTN-30-B.
     MOVE 30-34-IS-CODE TO IS-FILE-KEY.
     PERFORM IS-CODE-EDIT THRU IS-CODE-EDIT-X.
     IF ER-S = 1 MOVE ZERO TO ER-S MOVE 02 TO ERR-CODE
         MOVE 04 TO ERR-COL  PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
     IF 30-34-REQUESTER = SPACES, MOVE 14 TO ERR-COL
         MOVE 19 TO ERR-CODE PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
     IF S = 1 GO TO EDIT-RTN-30-X.
     IF 30-34-DATE = SPACES MOVE ZEROES TO 30-34-DATE
         GO TO RTN-30-D.
     MOVE 30-34-DATE TO WORK-DAT.
     MOVE FROM-DATE TO DATE-WORK.
     PERFORM COMMON-DATE-EDIT.
     IF DATE-ERR-SW = 1  MOVE ZERO TO DATE-ERR-SW
         MOVE 29 TO ERR-COL PERFORM RTN-30-C.
     IF S = 1 GO TO EDIT-RTN-30-X.
     MOVE TO-DATE TO DATE-WORK.
     PERFORM COMMON-DATE-EDIT.
     IF DATE-ERR-SW NOT =    1 GO TO RTN-30-D.
         MOVE ZERO TO DATE-ERR-SW.
         MOVE 35 TO ERR-COL.
RTN-30-C.
     MOVE 04 TO ERR-CODE PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
RTN-30-D.
     IF E = 1 AND S = ZERO, PERFORM I-C-2 THRU OP-EXIT
         GO TO EDIT-RTN-30-X.
     IF S = 1 GO TO EDIT-RTN-30-X.
     PERFORM WRITE-DISK THRU WRITE-DISK-X.
EDIT-RTN-30-X.  EXIT.
EDIT-RTN-31.
     MOVE 31-REQ TO REQ-TEST.


RTN-31-A.
     MOVE 31-IS-CODE TO IS-FILE-KEY.
     PERFORM IS-CODE-EDIT THRU IS-CODE-EDIT-X.
     IF ER-S = 1 MOVE ZERO TO ER-S MOVE 02 TO ERR-CODE
     MOVE 04 TO ERR-COL PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     GO TO RTN-31-B.
     MOVE 31-IS-CODE TO IS-FILE-KEY.
     MOVE 31-LAST-IS-CODE TO IS-ST-2.
     PERFORM IS-CODE-EDIT THRU IS-CODE-EDIT-X.
     IF ER-S = 1 MOVE ZERO TO ER-S MOVE 02 TO ERR-CODE
     MOVE 04 TO ERR-COL PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
RTN-31-B.
     IF 31-CODE NOT = SPACE AND 31-CODE NOT = '1' AND 31-CODE
         NOT = '2' MOVE 19 TO ERR-COL MOVE 12 TO ERR-CODE
         PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF S = 1 GO TO EDIT-RTN-31-X.
     IF 31-REQUESTER = SPACES MOVE 20 TO ERR-COL
         MOVE 19 TO ERR-CODE PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
     IF S = 1 GO TO EDIT-RTN-31-X.
     MOVE 31-DATE TO WORK-DAT.
     MOVE FROM-DATE TO DATE-WORK.
     PERFORM COMMON-DATE-EDIT.
     IF DATE-ERR-SW = 1 MOVE ZERO TO DATE-ERR-SW
         MOVE 35 TO ERR-COL PERFORM RTN-30-C.
     IF S = 1 GO TO EDIT-RTN-31-X.
     MOVE TO-DATE TO DATE-WORK.
     PERFORM COMMON-DATE-EDIT.
     IF DATE-ERR-SW = 1  MOVE ZERO TO DATE-ERR-SW
         MOVE 41 TO ERR-COL  PERFORM RTN-30-C.
     IF E = 1 AND S = ZERO PERFORM I-C-2 THRU OP-EXIT
         GO TO EDIT-RTN-31-X.
     IF S = 1 GO TO EDIT-RTN-31-X.
     PERFORM WRITE-DISK THRU WRITE-DISK-X.
EDIT-RTN-31-X.  EXIT.
EDIT-RTN-34.
     PERFORM EDIT-RTN-30 THRU EDIT-RTN-30-X.
EDIT-RTN-34-X.  EXIT.
EDIT-RTN-36.
     PERFORM EDIT-RTN-35 THRU EDIT-RTN-35-X.
EDIT-RTN-36-X.  EXIT.
EDIT-RTN-32.
     PERFORM EDIT-RTN-31 THRU EDIT-RTN-31-X.
EDIT-RTN-32-X.  EXIT.
EDIT-RTN-33.
     PERFORM EDIT-RTN-31 THRU EDIT-RTN-31-X.
EDIT-RTN-33-X.  EXIT.
EDIT-RTN-35.
     EXAMINE CAT-PARA REPLACING ALL SPACES BY ZEROES.
     MOVE 35-36-REQ TO REQ-TEST.

     GO TO RTN-35-B.
RTN-35-A.
     PERFORM RTN-30-A.
RTN-35-B.
     MOVE 1 TO C.
RTN-35-C.
     MOVE CATEGORY (C) TO CAT-HOLD.
     PERFORM CAT-CK THRU CAT-CK-X.
     IF ER-S = 1 MOVE ZERO TO ER-S
         COMPUTE ERR-COL = ((C * 3) + 1)
         MOVE 20 TO ERR-CODE PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
     IF S = 1 GO TO EDIT-RTN-35-X.
     IF C = 14 OR C > 14 NEXT SENTENCE ELSE ADD 1 TO C
         GO TO RTN-35-C.
     MOVE CAT-LIMIT TO CH-2.
     IF CH-2 NOT NUMERIC GO TO RT-35-A.
     IF CH-2A < ZERO NEXT SENTENCE ELSE GO TO RT-35-B.
RT-35-A.
     MOVE 21 TO ERR-CODE.
         MOVE 46 TO ERR-COL  PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
RT-35-B.
     IF S = 1 GO TO EDIT-RTN-35-X.
     IF 35-36-REQUESTER = SPACES  MOVE 19 TO ERR-CODE
         MOVE 48 TO ERR-COL PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
     IF S = 1 GO TO EDIT-RTN-35-X.
     MOVE 35-36-DATE TO WORK-DAT.
     MOVE FROM-DATE TO DATE-WORK.
     PERFORM COMMON-DATE-EDIT.
     IF DATE-ERR-SW = 1 MOVE ZERO TO DATE-ERR-SW
         MOVE 59 TO ERR-COL  PERFORM RTN-30-C.
     IF S = 1 GO TO EDIT-RTN-35-X.
     MOVE TO-DATE TO DATE-WORK.
     PERFORM COMMON-DATE-EDIT.
     IF DATE-ERR-SW = 1 MOVE ZERO TO DATE-ERR-SW
         MOVE 65 TO ERR-COL  PERFORM RTN-30-C.
     IF S = 1 GO TO EDIT-RTN-35-X.
     IF 35-36-TIME = SPACES MOVE ZEROES TO 35-36-TIME
         GO TO RTN-35-D.
     MOVE 35-36-TIME TO WORK-TIME. MOVE FROM-TIME TO T-WORK.
     PERFORM COMMON-TIME-EDIT THRU COMMON-TIME-EDIT-X.
     IF ER-S = 1 MOVE ZERO TO ER-S MOVE 71 TO ERR-COL
         MOVE 06 TO ERR-CODE PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
     IF S = 1 GO TO EDIT-RTN-35-X.
     MOVE TO-TIME TO T-WORK.
     PERFORM COMMON-TIME-EDIT THRU COMMON-TIME-EDIT-X.
     IF ER-S = 1 MOVE ZERO TO ER-S MOVE 75 TO ERR-COL
         MOVE 06 TO ERR-CODE PERFORM OUTPUT-ERROR-ROUTINE
         THRU OP-EXIT.
RTN-35-D.
     IF E = 1 AND S = ZERO PERFORM I-C-2 THRU OP-EXIT
         GO TO EDIT-RTN-35-X.
     IF S = 1 GO TO EDIT-RTN-35-X.
     PERFORM WRITE-DISK THRU WRITE-DISK-X.
EDIT-RTN-35-X.  EXIT.
CAT-CK.
     IF C NOT = 1, GO TO CAT-CK-A.
     IF CAT-HOLD NOT NUMERIC GO TO CAT-A.
     IF CAT-1 < ZERO NEXT SENTENCE ELSE GO TO CAT-CK-X.
CAT-A.
     MOVE 20 TO ERR-CODE  MOVE 04 TO ERR-COL
         PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
         GO TO CAT-CK-X.
CAT-CK-A.
     IF CAT-HOLD = ZERO MOVE 14 TO C
     GO TO CAT-CK-X.
     IF CAT-HOLD NOT NUMERIC MOVE 1 TO ER-S GO TO CAT-CK-X.
     IF CAT-1 < ZERO MOVE 1 TO ER-S.
CAT-CK-X.  EXIT.
CARD-CODE-ERROR.
     MOVE '99' TO ERROR-CODE.
     MOVE '79' TO ER-COL1.
     MOVE '30' TO ER-CODE1.
     MOVE CARD-REC TO ER-1-80.
     WRITE ERROR-REC.
CARD-CODE-ERROR-X.  EXIT.
COMMON-TIME-EDIT.
     IF TIME-H < ZERO OR TIME-H > '24' MOVE 1 TO ER-S.
     IF TIME-M < ZERO OR TIME-M > '59' MOVE 1 TO ER-S.
COMMON-TIME-EDIT-X.  EXIT.
IS-CODE-EDIT.
     IF IS-ST-1 > IS-ST-2 MOVE IS-ST-1 TO IS-H
         MOVE IS-ST-2 TO IS-ST-1, MOVE IS-H TO IS-ST-2.
     READ ISFILE INVALID KEY MOVE 1 TO ER-S.
IS-CODE-EDIT-X.
        EXIT.
LOC-CK.
     IF LOC-W1 < '1' OR  LOC-W1 > '6' GO TO LOC-CK-A.

     IF LOC-W2 NOT = '2' AND LOC-W2 NOT = '8' AND LOC-W2 NOT = '0'
         GO TO LOC-CK-A.
     IF LOC-W3 < ZERO OR LOC-W3 > '5' GO TO LOC-CK-A.
     GO TO LOC-CK-X.
LOC-CK-A.
     MOVE 1 TO ER-S.
LOC-CK-X.  EXIT.
WRITE-DISK.
     MOVE CARD-REC TO DISK-1-80.
     MOVE ZEROES TO DISK-81-100.
     MOVE CARD-CODE-HOLD TO 21-KEY.
     WRITE DISK-REC.
WRITE-DISK-X.  EXIT.
EDIT-RTN-28.
     IF 28-29-NO NOT NUMERIC OR
        28-29-NO-5 < ZERO
        GO TO RTN-28-A.
     GO TO RTN-28-B.
RTN-28-A.
     MOVE 25 TO ERR-CODE MOVE 01 TO ERR-COL
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT
         GO TO RTN-28-K.
RTN-28-B.
     IF 28-AST NOT = 'R' AND 28-AST NOT = 'D'
         MOVE 18 TO ERR-CODE MOVE 06 TO ERR-COL
         PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT
         GO TO RTN-28-K.
     IF 28-C = SPACE GO TO RTN-28-C.
     IF 28-C < '1'  OR 28-C > '3' MOVE 07 TO ERR-COL
         PERFORM RTN-28-Y.
RTN-28-C.
     IF 28-A = SPACE GO TO RTN-28-D.
     IF 28-A < ZERO OR 28-A > '5' MOVE 08 TO ERR-COL
         PERFORM RTN-28-Y.
RTN-28-D.
     IF 28-J = SPACE GO TO RTN-28-E.
     IF 28-J < ZERO OR 28-J > '7' MOVE 09 TO ERR-COL
         PERFORM RTN-28-Y.
RTN-28-E.
     IF S = 1 GO TO EDIT-RTN-28-X.
     IF 28-K = SPACE GO TO RTN-28-F.
     IF 28-K < ZERO OR 28-K > '5' MOVE 10 TO ERR-COL
         PERFORM RTN-28-Y.
RTN-28-F.
     IF S = 1 GO TO EDIT-RTN-28-X.
     IF 28-L1 = SPACE GO TO RTN-28-G.
     IF 28-L1 < ZERO OR 28-L1 > '5' MOVE 11 TO ERR-COL
         PERFORM RTN-28-Y.
RTN-28-G.
     IF S = 1 GO TO EDIT-RTN-28-X.
     IF 28-L2 = SPACE GO TO RTN-28-H.
     IF 28-L2 < ZERO OR 28-L2 > '5' MOVE 12 TO ERR-COL
         PERFORM RTN-28-Y.
RTN-28-H.
     IF S = 1 GO TO EDIT-RTN-28-X.
     IF 28-M = SPACE GO TO RTN-28-I.
     IF 28-M < '1' OR 28-M > '2' MOVE 13 TO ERR-COL
         PERFORM RTN-28-Y.
RTN-28-I.
     IF S = 1 GO TO EDIT-RTN-28-X.
     IF 28-DATE = SPACE GO TO RTN-28-I1.
     MOVE 28-DATE TO DATE-WORK.
     PERFORM COMMON-DATE-EDIT.
     IF DATE-ERR-SW = 1 MOVE ZERO TO DATE-ERR-SW
         MOVE 04 TO ERR-CODE MOVE 17 TO ERR-COL
         PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
RTN-28-I1.
     IF S = 1 GO TO EDIT-RTN-28-X.
     IF 28-S-DIST = SPACE GO TO RTN-28-J.
     MOVE 28-S-DIST TO SE-TEST.
     IF SE-TEST NOT NUMERIC GO TO RTN-28-I2.
     IF SE-TEST-1 < ZERO NEXT SENTENCE ELSE GO TO RTN-28-J.
RTN-28-I2.
     MOVE 26 TO ERR-CODE MOVE 23 TO ERR-COL
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
RTN-28-J.
     IF S = 1 GO TO EDIT-RTN-28-X.
     IF 28-SEG-VOL = SPACE GO TO RTN-28-K.
     MOVE 28-SEG-VOL TO SE-T.
     IF SE-T NOT NUMERIC GO TO RTN-28-J2.
     IF SE-T-1 < ZERO NEXT SENTENCE ELSE GO TO RTN-28-K.
RTN-28-J2.
     MOVE 17 TO ERR-CODE MOVE 28 TO ERR-COL
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
RTN-28-K.
     IF E = 1 AND S = ZERO PERFORM I-C-2 THRU OP-EXIT
         GO TO EDIT-RTN-28-X.
     IF S = 1 GO TO EDIT-RTN-28-X.
     PERFORM WRITE-DISK THRU WRITE-DISK-X.
EDIT-RTN-28-X.  EXIT.
RTN-28-Y.
     MOVE 10 TO ERR-CODE
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
EDIT-RTN-29.
     EXAMINE 29-SEG-CLASS REPLACING ALL SPACES BY ZEROES.
     EXAMINE 29-S-DIST    REPLACING ALL SPACES BY ZEROES.
     EXAMINE 29-S-VOL     REPLACING ALL SPACES BY ZEROES.
     EXAMINE 29-STRAF     REPLACING ALL SPACES BY ZEROES.
     IF 28-29-NO NOT NUMERIC OR
        28-29-NO-5 < ZERO
        GO TO RTN-29-A.
     GO TO RTN-29-B.
RTN-29-A.
     MOVE 25 TO ERR-CODE MOVE 01 TO ERR-COL
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT
     GO TO RTN-29-K.
RTN-29-B.
     IF 29-S-DIST = ZERO GO TO RTN-29-C.
     MOVE 29-S-DIST TO SE-TEST.
     IF SE-TEST NOT NUMERIC GO TO RTN-29-B1.
     IF SE-TEST-1 < ZERO NEXT SENTENCE ELSE GO TO RTN-29-C.
RTN-29-B1.
     MOVE 26 TO ERR-CODE  MOVE 06 TO ERR-COL
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
RTN-29-C.
     IF 29-S-VOL = ZERO GO TO RTN-29-D.
     MOVE 29-S-VOL TO SE-T.
     IF SE-T NOT NUMERIC  GO TO RTN-29-C1.
     IF SE-T-1 < ZERO NEXT SENTENCE ELSE GO TO RTN-29-D.
RTN-29-C1.
     MOVE 17 TO ERR-CODE  MOVE 11 TO ERR-COL
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
RTN-29-D.
     IF 29-C < ZERO OR 29-C > '3' MOVE 17 TO ERR-COL
         PERFORM RTN-28-Y.
     IF S = 1 GO TO EDIT-RTN-29-X.
     IF 29-A < ZERO OR 29-A > '5' MOVE 18 TO ERR-COL
         PERFORM RTN-28-Y.
     IF S = 1 GO TO EDIT-RTN-29-X.
     IF 29-J < ZERO OR 29-J > '7' MOVE 19 TO ERR-COL
         PERFORM RTN-28-Y.
     IF S = 1 GO TO EDIT-RTN-29-X.
     IF 29-K < ZERO OR 29-K > '5' MOVE 20 TO ERR-COL
         PERFORM RTN-28-Y.
     IF S = 1 GO TO EDIT-RTN-29-X.
     IF 29-L1 < ZERO OR 29-L1 > '5' MOVE 21 TO ERR-COL
         PERFORM RTN-28-Y.
     IF S = 1 GO TO EDIT-RTN-29-X.
     IF 29-L2 < ZERO OR 29-L2 > '5' MOVE 22 TO ERR-COL
         PERFORM RTN-28-Y.
     IF S = 1 GO TO EDIT-RTN-29-X.
     IF 29-M  < ZERO OR 29-M >  '2' MOVE 23 TO ERR-COL
         PERFORM RTN-28-Y.
     IF S = 1 GO TO EDIT-RTN-29-X.
     MOVE 29-DATE TO DATE-WORK.
     PERFORM COMMON-DATE-EDIT.
     IF DATE-ERR-SW = 1 MOVE ZERO TO DATE-ERR-SW
         MOVE 04 TO ERR-CODE MOVE 27 TO ERR-COL
         PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
     IF S = 1 GO TO EDIT-RTN-29-X.
     MOVE 29-ROUTE TO IS-ST-1 MOVE 29-X-1 TO IS-ST-2.
     PERFORM IS-CODE-EDIT THRU IS-CODE-EDIT-X.
     IF ER-S = 1 MOVE ZERO TO ER-S MOVE 02 TO ERR-CODE
         MOVE 33 TO ERR-COL
         PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT GO TO RTN-29-E.
     MOVE 29-ROUTE TO IS-ST-1 MOVE 29-X-2 TO IS-ST-2.
     PERFORM IS-CODE-EDIT THRU IS-CODE-EDIT-X.
     IF ER-S = 1 MOVE ZERO TO ER-S MOVE 02 TO ERR-CODE
     MOVE 43 TO ERR-COL PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
RTN-29-E.
     IF S = 1 GO TO EDIT-RTN-29-X.
     IF 29-STRAF = ZERO GO TO RTN-29-K.
     MOVE 29-STRAF TO REQ-TEST.
     IF REQ-TEST NOT NUMERIC GO TO RTN-29-F.
     IF REQ-TEST-1 < ZERO NEXT SENTENCE ELSE GO TO RTN-29-K.
RTN-29-F.
     MOVE 29 TO ERR-CODE MOVE 48 TO ERR-COL
     PERFORM OUTPUT-ERROR-ROUTINE THRU OP-EXIT.
RTN-29-K.
     IF E = 1 AND S = ZERO PERFORM I-C-2 THRU OP-EXIT
         GO TO EDIT-RTN-29-X.
     IF S = 1 GO TO EDIT-RTN-29-X.
     PERFORM WRITE-DISK THRU WRITE-DISK-X.
EDIT-RTN-29-X.  EXIT.
   9@%é