IDENTIFICATION  DIVISION.
PROGRAM-ID.  'ACT3005'.
AUTHOR.  K R MARCUM.
INSTALLATION.  STANFORD RESEARCH INSTITUTE.
DATE-WRITTEN.  JUNE 1970.
REMARKS. PROGRAM CONVERTS VARIOUS ACTRS VOLUME COUNT DATA INTO A
     FORMAT ACCEPTABLE TO THE TAIS SYSTEM (PROGRAM T3010)
     CARD CODE OF 21 = HEADER
     CARD CODE OF 22 = 15 MIN COUNT
     CARD CODE OF 23 = 30 MIN COUNT
     CARD CODE OF 24 = 60 MIN COUNT .
ENVIRONMENT  DIVISION.
CONFIGURATION  SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
INPUT-OUTPUT  SECTION.
FILE-CONTROL.
     SELECT  CARD-INPUT  ASSIGN DSK,
      RECORDING MODE IS ASCII.
     SELECT  TAPE-OUTPUT ASSIGN DSK,
      RECORDING MODE IS ASCII.
DATA  DIVISION.
FILE  SECTION.
FD   CARD-INPUT
         VALUE OF IDENTIFICATION IS "CARD3ADAT"
     LABEL RECORDS ARE STANDARD
     DATA RECORDS ARE CARD-IN
                      CARD-22-X
                      CARD-22-N
                      CARD-23-X
                      CARD-23-N
                      CARD-24-X
                      CARD-24-N.
01   CARD-IN.
     03 CI-REQ-NO                PICTURE X(04).
     03 CI-DIR                   PICTURE X(01).
     03 FILLER                   PICTURE X(73).
     03 CI-CODE                  PICTURE X(02).
01   CARD-22-X.
     03 FILLER                   PICTURE X(05).
     03 C22-HOUR-X               PICTURE X(02).
     03 C22-AP-X                 PICTURE X(01).
     03 C22-COUNT-X  OCCURS 16   PICTURE X(04).
     03 FILLER                   PICTURE X(08).
01   CARD-22-N.
     03 FILLER                   PICTURE X(05).
     03 C22-HOUR-N               PICTURE 9(02).
     03 C22-AP-N                 PICTURE 9(01).
     03 C22-COUNT-N  OCCURS 16   PICTURE 9(04).
     03 FILLER                   PICTURE X(08).
01   CARD-23-X.
     03 FILLER                   PICTURE X(05).
     03 C23-HOUR-X               PICTURE X(02).
     03 C23-AP-X                 PICTURE X(01).
     03 C23-COUNT-X  OCCURS 12   PICTURE X(05).
     03 FILLER                   PICTURE X(12).
01   CARD-23-N.
     03 FILLER                   PICTURE X(05).
     03 C23-HOUR-N               PICTURE 9(02).
     03 C23-AP-N                 PICTURE 9(01).
     03 C23-COUNT-N  OCCURS 6.
        05 C23-HH-1              PICTURE 9(05).
        05 C23-HH-2              PICTURE 9(05).
     03 FILLER                   PICTURE X(12).
01   CARD-24-X.
     03 FILLER                   PICTURE X(05).
     03 C24-HOUR-X               PICTURE X(02).
     03 C24-AP-X                 PICTURE X(01).
     03 C24-COUNT-X  OCCURS 12   PICTURE X(05).
     03 FILLER                   PICTURE X(12).
01   CARD-24-N.
     03 FILLER                   PICTURE X(05).
     03 C24-HOUR-N               PICTURE 9(02).
     03 C24-AP-N                 PICTURE 9(01).
     03 C24-COUNT-N  OCCURS 12   PICTURE 9(05).
     03 FILLER                   PICTURE X(12).
FD   TAPE-OUTPUT
         VALUE OF IDENTIFICATION IS "TOUT3ADAT"
     LABEL RECORDS ARE STANDARD
     BLOCK  CONTAINS 40 RECORDS
     RECORD CONTAINS 80 CHARACTERS
     DATA RECORD IS TAPE-RECORD.
01   TAPE-RECORD.
     03 T-REQ-NO                 PICTURE X(04).
     03 T-DIR                    PICTURE X(01).
     03 T-HOUR                   PICTURE 9(02).
     03 T-AP                     PICTURE 9(01).
     03 T-COUNT OCCURS 4.
        05 T-Q00                 PICTURE 9(04).
        05 T-Q15                 PICTURE 9(04).
        05 T-Q30                 PICTURE 9(04).
        05 T-Q45                 PICTURE 9(04).
     03 FILLER                   PICTURE X(06).
     03 T-CODE                   PICTURE X(02).
WORKING-STORAGE  SECTION.
77   I       COMPUTATIONAL       PICTURE S99     VALUE ZERO.
77   J       COMPUTATIONAL       PICTURE S99     VALUE ZERO.
77   K       COMPUTATIONAL       PICTURE S99     VALUE ZERO.
77   C22-SWITCH                  PICTURE X(01)   VALUE ZERO.
77   C23-SWITCH                  PICTURE X(01)   VALUE ZERO.
77   C24-SWITCH                  PICTURE X(01)   VALUE ZERO.
77   WS-REQ-NO                   PICTURE X(04).
77   CARD-21-SAVE                PICTURE X(80)   VALUE SPACES.
77   WS-DIR                      PICTURE X(01).
01   HALF-HOUR-TABLE.
     03 HH           OCCURS 24.
        05 HH-1                  PICTURE 9(05).
        05 HH-2                  PICTURE 9(05).
01   FULL-HOUR-TABLE.
     03 FH           OCCURS 24.
        05 FH-1                  PICTURE 9(05).
PROCEDURE  DIVISION.
START.
     OPEN INPUT  CARD-INPUT
          OUTPUT TAPE-OUTPUT.
     PERFORM ZERO-TABLE  VARYING I FROM 1 BY 1 UNTIL I > 24.
     READ CARD-INPUT AT END GO TO EOJ.
     MOVE CI-REQ-NO TO WS-REQ-NO
     GO TO SKIP-READ.
READ-CARDS.
     READ CARD-INPUT AT END GO TO EOJ.
SKIP-READ.
     IF CI-CODE = 21 GO TO C21-ROUTINE.
     IF CI-CODE = 22 GO TO C22-ROUTINE.
     IF CI-CODE = 23 GO TO C23-ROUTINE.
     IF CI-CODE = 24 GO TO C24-ROUTINE.
     IF C22-SWITCH = 2 OR C23-SWITCH = 2 OR C24-SWITCH = 2
     DISPLAY CARD-21-SAVE, ' SET REJECTED - INVALID START HR'.
     IF C23-SWITCH = 1
        PERFORM CONVERT-HALF-HOUR THRU CONVERT-HALF-EXIT.
     IF C24-SWITCH = 1
        PERFORM CONVERT-FULL-HOUR THRU CONVERT-FULL-EXIT.
     MOVE 0 TO C22-SWITCH, C23-SWITCH, C24-SWITCH.
     WRITE TAPE-RECORD FROM CARD-IN.
     GO TO READ-CARDS.
C21-ROUTINE.
     IF C22-SWITCH = 2 OR C23-SWITCH = 2 OR C24-SWITCH = 2
     DISPLAY CARD-21-SAVE, ' SET REJECTED - INVALID START HR'.
     IF C23-SWITCH = 1
        PERFORM CONVERT-HALF-HOUR THRU CONVERT-HALF-EXIT.
     IF C24-SWITCH = 1
        PERFORM CONVERT-FULL-HOUR THRU CONVERT-FULL-EXIT.
     MOVE 0 TO C22-SWITCH, C23-SWITCH, C24-SWITCH.
     MOVE CARD-IN TO CARD-21-SAVE.
     MOVE CI-REQ-NO TO WS-REQ-NO.

     GO TO READ-CARDS.
C22-ROUTINE.
     IF C22-SWITCH = 2 GO TO READ-CARDS.
     IF C22-SWITCH = 0
        IF C22-HOUR-X = 12 AND
           C22-AP-X   =  1
           NEXT SENTENCE
        ELSE
           MOVE 2 TO C22-SWITCH
           GO TO READ-CARDS.
     IF C22-SWITCH = 0
        WRITE TAPE-RECORD FROM CARD-21-SAVE
        MOVE 1 TO C22-SWITCH.
     PERFORM C22-EXAMINE VARYING I FROM 1 BY 1 UNTIL I > 16.
     WRITE TAPE-RECORD FROM CARD-IN.
     GO TO READ-CARDS.
C22-EXAMINE.
     EXAMINE C22-COUNT-X (I) REPLACING ALL SPACES BY ZERO.
C23-ROUTINE.
     IF C23-SWITCH = 2 GO TO READ-CARDS.
     IF C23-SWITCH = 0
        IF C23-HOUR-X = 12 AND
           C23-AP-X   =  1
           NEXT SENTENCE
        ELSE
           MOVE 2 TO C23-SWITCH
           GO TO READ-CARDS.
     PERFORM C23-EXAMINE VARYING I FROM 1 BY 1 UNTIL I > 12.
     IF C23-HOUR-X = 12 OR
        C23-HOUR-X = 06
        NEXT SENTENCE
     ELSE
        MOVE 2 TO C23-SWITCH
        DISPLAY CARD-23-X, '*REJECT INVALID HOUR'
        GO TO CARD-23-EXIT.
     IF C23-HOUR-X = 12
        MOVE ZERO TO C23-HOUR-X.
     IF C23-AP-X = 1 OR
        C23-AP-X = 2
        NEXT SENTENCE
     ELSE
        MOVE 2 TO C23-SWITCH
        DISPLAY CARD-23-X, '*REJECTED INVALID A/P'
        GO TO CARD-23-EXIT.
     IF C23-SWITCH = 2
        GO TO CARD-23-EXIT.
     MOVE 1 TO C23-SWITCH.
     COMPUTE J = C23-HOUR-N + (C23-AP-N * 12) - 12.
     COMPUTE I = 0.
C23-LOOP.
     ADD 1 TO I.
     ADD 1 TO J.
     IF I > 6 GO TO CARD-23-EXIT.
     ADD C23-HH-1 (I) TO HH-1 (J).
     ADD C23-HH-2 (I) TO HH-2 (J).
     GO TO C23-LOOP.
CARD-23-EXIT.
     MOVE CI-REQ-NO TO WS-REQ-NO.
     MOVE CI-DIR    TO WS-DIR.
     GO TO READ-CARDS.
C23-EXAMINE.
     EXAMINE C23-COUNT-X (I) REPLACING ALL SPACES BY ZERO.
CONVERT-HALF-HOUR.
     WRITE TAPE-RECORD FROM CARD-21-SAVE.
     MOVE ZERO TO TAPE-RECORD.
     MOVE 0 TO I.
     MOVE 0 TO J.
CONVERT-HH-LOOP.
     ADD 1 TO I
     ADD 1 TO J.
     COMPUTE T-Q00 (I) = HH-1 (J) / 2.
     COMPUTE T-Q15 (I) = HH-1 (J).
     COMPUTE T-Q30 (I) = (HH-2 (J) + HH-1 (J)) / 2.
     COMPUTE T-Q45 (I) = HH-2 (J).
     IF I = 4
        GO TO WRITE-HH.
     GO TO CONVERT-HH-LOOP.
WRITE-HH.
     IF J = 4
        MOVE 12 TO T-HOUR
        MOVE 1  TO T-AP.
     IF J = 8
        MOVE 04 TO T-HOUR
        MOVE 1  TO T-AP.
     IF J = 12
        MOVE 08 TO T-HOUR
        MOVE 1  TO T-AP.
     IF J = 16
        MOVE 12 TO T-HOUR
        MOVE 2  TO T-AP.
     IF J = 20
        MOVE 04 TO T-HOUR
        MOVE 2  TO T-AP.
     IF J = 24
        MOVE 08 TO T-HOUR
        MOVE 2  TO T-AP.
     MOVE WS-REQ-NO TO T-REQ-NO.
     MOVE WS-DIR TO T-DIR.
     MOVE 22 TO T-CODE.
     WRITE TAPE-RECORD.
WRITE-HH-STOP.
     IF J = 24
        PERFORM ZERO-TABLE VARYING I FROM 1 BY 1 UNTIL I > 24
        MOVE ZERO TO C23-SWITCH
        GO TO CONVERT-HALF-EXIT.
     MOVE ZERO TO I.
     GO TO CONVERT-HH-LOOP.
CONVERT-HALF-EXIT.
     EXIT.
C24-ROUTINE.
     IF C24-SWITCH = 2 GO TO READ-CARDS.
     IF C24-SWITCH = 0
        IF C24-HOUR-X = 12 AND
           C24-AP-X   =  1
           NEXT SENTENCE
        ELSE
           MOVE 2 TO C24-SWITCH
           GO TO READ-CARDS.
     PERFORM C24-EXAMINE VARYING I FROM 1 BY 1 UNTIL I > 12.
     COMPUTE J = (C24-HOUR-N * C24-AP-N) - 12.
     COMPUTE I = 0.
     PERFORM MOVE-FH 12 TIMES.
     MOVE CI-REQ-NO TO WS-REQ-NO.
     MOVE CI-DIR    TO WS-DIR.
     MOVE 1 TO C24-SWITCH.
     GO TO READ-CARDS.
MOVE-FH.
     ADD 1 TO I.
     ADD 1 TO J.
     MOVE C24-COUNT-N (I) TO FH-1 (J).
C24-EXAMINE.
     EXAMINE C24-COUNT-X (I) REPLACING ALL SPACES BY ZERO.
CONVERT-FULL-HOUR.
     WRITE TAPE-RECORD FROM CARD-21-SAVE.
     MOVE ZERO TO TAPE-RECORD.
     MOVE 0    TO I.
     MOVE 0    TO J.
CONVERT-FH-LOOP.
     ADD 1 TO I.
     ADD 1 TO J.
     MOVE 0          TO T-Q00 (I).
     MOVE 0          TO T-Q15 (I).
     MOVE 0          TO T-Q30 (I).
     MOVE FH-1 (J)   TO T-Q45 (I).
     IF I = 4
        GO TO WRITE-FH.
     GO TO CONVERT-FH-LOOP.
WRITE-FH.
     PERFORM WRITE-HH.
     IF J = 24
        PERFORM ZERO-TABLE VARYING I FROM 1 BY 1 UNTIL I > 24
        GO TO CONVERT-FULL-EXIT.
     MOVE 0 TO I.
     GO TO CONVERT-FH-LOOP.
CONVERT-FULL-EXIT.
     EXIT.
ZERO-TABLE.
     MOVE ZERO TO HH-1 (I).
     MOVE ZERO TO HH-2 (I).
     MOVE ZERO TO FH-1 (I).
EOJ.
     IF C22-SWITCH = 2 OR C23-SWITCH = 2 OR C24-SWITCH = 2
     DISPLAY CARD-21-SAVE, ' SET REJECTED - INVALID START HR'.
     IF C23-SWITCH = 1
        PERFORM CONVERT-HALF-HOUR THRU CONVERT-HALF-EXIT.
     IF C24-SWITCH = 1
        PERFORM CONVERT-FULL-HOUR THRU CONVERT-FULL-EXIT.
     CLOSE CARD-INPUT
           TAPE-OUTPUT.
     STOP RUN.
 