IDENTIFICATION DIVISION.
PROGRAM-ID.  TRACEN.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
77   A   COMP  PICTURE  S9(5).
PROCEDURE DIVISION.
FIRST-PARA.
        MOVE 1 TO TALLY.
        MOVE 2 TO A.
PARA-2.
        ADD 1 TO TALLY.
PARA-3.
        MOVE 1 TO TALLY.
        ADD TALLY TO A.
PARA-4.
        COMPUTE TALLY = A.
PARA-5.
        COMPUTE A = TALLY.
PARA-6.
        STOP RUN.
LAST-PARA.
