ID DIVISION.
PROGRAM-ID. TESTBH.
AUTHOR. BRENDA HARDT.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NBR PIC XX VALUE SPACE.
01 DEP1 PIC S99999 COMP VALUE +30.
01 A-ARRAY.
 02 A-A OCCURS 1 TO 30 TIMES
      DEPENDING ON DEP1
      ASCENDING KEY IS AKEY
      INDEXED BY IDX.
 03 AKEY PIC XX.
PROCEDURE DIVISION.
 MOVE HIGH-VALUES TO A-ARRAY.
 SET IDX TO 1.
1-ACCEPT.
 ACCEPT AKEY (IDX).
 IF IDX EQUAL 17 GO TO 2-SEARCH.
 SET IDX UP BY 1.
 GO TO 1-ACCEPT.
2-SEARCH.
 SET DEP1 TO IDX.
 DISPLAY "ENTER NUMBER TO BE FOUND : " WITH NO ADVANCING.
 ACCEPT NBR.
 SET IDX TO 1.
 SEARCH A-A
   WHEN NBR EQUAL AKEY (IDX)
   DISPLAY "MATCH FOUND"
   GO TO 9-END.
3-ATEND.
 DISPLAY "NO MATCH FOUND".
 GO TO 9-END.
9-END.
 STOP-RUN.
