
ID DIVISION.
REMARKS. TESTS TOF USING MACRO SUBR TOF MAC FOR THE DCT500.
ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.
START.
        ENTER MACRO TOF.
        STOP RUN.
