IDENTIFICATION DIVISION.
PROGRAM-ID.  TSTTST.
ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.
FIRST-PARA.
        DISPLAY "HI".
        STOP RUN.
LAST-PARA.
