IDENTIFICATION DIVISION.
PROGRAM-ID. 'TESTER'.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. PDP-10.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT TESTFILE ASSIGN TO DSK,DSK RECORDING MODE IS SIXBIT
ACCESS IS INDEXED
 SYMBOLIC KEY IS FILE-KEY
	RECORD KEY IS FIELDONE.
DATA DIVISION.
FILE SECTION.
FD TESTFILE LABEL RECORDS ARE STANDARD
     VALUE OF IDENTIFICATION IS 'TEST  IDX'
	BLOCK CONTAINS 100 RECORDS
      DATA RECORDS ARE ONE.
01    ONE.
      02 FIELDONE PICTURE S9(5) USAGE COMP.
      02 FIELDTWO PICTURE S9 USAGE COMP.
      02 FIELDXXX PICTURE XXXXX USAGE DISPLAY-7 SYNCHRONIZED RIGHT.
      02 FIELDX7X PICTURE X(10) USAGE DISPLAY-7 SYNCHRONIZED RIGHT.
WORKING-STORAGE SECTION.
77     J PICTURE S9(5) USAGE COMPUTATIONAL.
77     FILE-KEY PIC S9(5) USAGE COMP.
77     INDEX-I PIC S9(5) USAGE COMPUTATIONAL.
PROCEDURE DIVISION.
STARTUP.
     OPEN OUTPUT TESTFILE.
     PERFORM LOOP THRU LOOP-EXIT VARYING INDEX-I FROM 1 
      BY 1 UNTIL INDEX-I IS GREATER THAN 60000.
    CLOSE TESTFILE.
    STOP RUN
LOOP.
    MOVE 1 TO FIELDTWO. MOVE INDEX-I TO FIELDONE.
     ADD 1 TO J.
      MOVE 'XXXXX' TO FIELDXXX. MOVE 'ABCDEFGHIJ' TO FIELDX7X.
	MOVE INDEX-I TO FILE-KEY.
    WRITE ONE;INVALID KEY PERFORM MISTAKE.
LOOP-EXIT.
    EXIT.
MISTAKE.
	DISPLAY 'NO WRITE'.
	DISPLAY INDEX-I.
MISTAKE-EXIT.
     EXIT.
