IDENTIFICATION DIVISION.
PROGRAM-ID. UPDATE.
AUTHOR. ROZ.
INSTALLATION. NORTH LA.
DATE-WRITTEN. 04-14-73.
DATE-COMPILED. 04-14-73.
SECURITY. NONE.
REMARKS. ACCOUNT TRACKING MAINTENANCE.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
        SELECT ACCTS ASSIGN TO DSK
        RECORDING MODE IS ASCII.
        SELECT ACCTS1 ASSIGN TO DSK
        RECORDING MODE IS ASCII.
DATA DIVISION.
FILE SECTION.
FD ACCTS
        VALUE OF IDENTIFICATION IS "ACCNTSDAT".
01 ACCT-REC.
        02 SALESMAN, PIC X(8).
        02 ANALYST, PIC X(8).
        02 SERVICE, PIC XX.
        02 KODE, PIC X.
        02 MONTH1, PIC S999V9.
        02 MONTH2, PIC S999V9.
        02 MONTH3, PIC S999V9.
        02 MONTH4, PIC S999V9.
        02 MONTH5, PIC S999V9.
        02 MONTH6, PIC S999V9.
        02 MTD, PIC S999V9.
        02 BASE, PIC S999V9.
        02 ACCOUNT, PIC X(20).
FD ACCTS1
        VALUE OF IDENTIFICATION IS "ACCNT1DAT".
01 ACCT-REC-1.
        02 SALESMAN, PIC X(8).
        02 ANALYST, PIC X(8).
        02 SERVICE, PIC XX.
        02 KODE, PIC X.
        02 MONTH1, PIC S999V9.
        02 MONTH2, PIC S999V9.
        02 MONTH3, PIC S999V9.
        02 MONTH4, PIC S999V9.
        02 MONTH5, PIC S999V9.
        02 MONTH6, PIC S999V9.
        02 MTD, PIC S999V9.
        02 BASE, PIC S999V9.
        02 ACCOUNT, PIC X(20).
WORKING-STORAGE SECTION.
77      ACCOUNT-STORE, PIC X(20).
77      SERVICE-STORE, PIC XX.
77      COMMAND, PIC X(8).
PROCEDURE DIVISION.
COMMAND-CHOICE.
        DISPLAY "WHAT OPTION: ".
        DISPLAY " MOVE MONTHS.".
        DISPLAY ' UPDATE MTD.'.
        DISPLAY ' ADD RECORD.'.
        DISPLAY ' DELETE RECORD.'.
        DISPLAY ' PRINT DATA BASE.'.
        DISPLAY ' CHANGE BASE.'.
        DISPLAY ' QUIT.'.
CMD1.   DISPLAY ' '.
        DISPLAY '!' WITH NO ADVANCING.
        ACCEPT COMMAND.
        IF COMMAND EQUALS 'ADD' PERFORM ADDITIONS.
        IF COMMAND EQUALS 'DELETE' PERFORM DELETIONS.
        IF COMMAND EQUALS 'UPDATE' PERFORM UPDATES.
        IF COMMAND EQUALS 'MOVE' PERFORM MOVE-MONTHS.
        IF COMMAND EQUALS 'PRINT' PERFORM PRINTER.
        IF COMMAND EQUALS 'CHANGE' PERFORM CHANGE-BASE.
        IF COMMAND EQUALS 'QUIT' STOP RUN.
        DISPLAY ' '.
        GO TO CMD1.
MOVE-MONTHS SECTION.
MOV-0.  DISPLAY 'MOVING MONTHS.'.
        OPEN INPUT ACCTS.
        OPEN OUTPUT ACCTS1.
MOV1.   READ ACCTS AT END GO TO MOV2.
        MOVE ACCOUNT OF ACCT-REC TO ACCOUNT OF ACCT-REC-1.
        MOVE ANALYST OF ACCT-REC TO ANALYST OF ACCT-REC-1.
        MOVE SERVICE OF ACCT-REC TO SERVICE OF ACCT-REC-1.
        MOVE KODE OF ACCT-REC TO KODE OF ACCT-REC-1.
        MOVE SALESMAN OF ACCT-REC TO SALESMAN OF ACCT-REC-1.
        MOVE MONTH6 OF ACCT-REC TO MONTH5 OF ACCT-REC-1.
        MOVE MONTH5 OF ACCT-REC TO MONTH4 OF ACCT-REC-1.
        MOVE MONTH4 OF ACCT-REC TO MONTH3 OF ACCT-REC-1.
        MOVE MONTH3 OF ACCT-REC TO MONTH2 OF ACCT-REC-1.
        MOVE MONTH2 OF ACCT-REC TO MONTH1 OF ACCT-REC-1.
        MOVE MTD OF ACCT-REC TO MONTH6 OF ACCT-REC-1.
        MOVE ZEROS TO MTD OF ACCT-REC-1.
        WRITE ACCT-REC-1.
        GO TO MOV1.
MOV2.   CLOSE ACCTS,ACCTS1.
        OPEN OUTPUT ACCTS.
        OPEN INPUT ACCTS1.
MOV3.   READ ACCTS1 AT END GO TO MOV4.
        MOVE CORRESPONDING ACCT-REC-1 TO ACCT-REC.
        WRITE ACCT-REC.
        GO TO MOV3.
MOV4.   CLOSE ACCTS.
        CLOSE ACCTS1 WITH DELETE.
UPDATES SECTION.
UPD-0.  DISPLAY 'UPDATING MTDS.'.
        DISPLAY ' '.
        OPEN OUTPUT ACCTS1.
        OPEN INPUT ACCTS.
UPD0.   READ ACCTS AT END GO TO UPD1.
        DISPLAY ACCOUNT OF ACCT-REC,SERVICE OF ACCT-REC,':'
     WITH NO ADVANCING.
        ACCEPT MTD OF ACCT-REC.
        MOVE CORRESPONDING ACCT-REC TO ACCT-REC-1.
        WRITE ACCT-REC-1.
        GO TO UPD0.
UPD1.
        CLOSE ACCTS,ACCTS1.
        OPEN INPUT ACCTS1.
        OPEN OUTPUT ACCTS.
UPD2.   READ ACCTS1 AT END GO TO UPD3.
        MOVE CORRESPONDING ACCT-REC-1 TO ACCT-REC.
        WRITE ACCT-REC.
        GO TO UPD2.
UPD3.   CLOSE ACCTS.
        CLOSE ACCTS1 WITH DELETE.
PRINTER SECTION.
PRI-0.  OPEN INPUT ACCTS.
PR1.    READ ACCTS AT END GO TO PR2.
        DISPLAY ACCT-REC.
        GO TO PR1.
PR2.    CLOSE ACCTS.
DELETIONS SECTION.
DEL-0.  OPEN INPUT ACCTS.
        OPEN OUTPUT ACCTS1.
DEL1.  DISPLAY 'DO YOU WISH TO DELETE AN ACCOUNT OR AN ACCOUNT SERVICE?'
          WITH NO ADVANCING.
        ACCEPT COMMAND.
        IF COMMAND EQUALS 'SERVICE' GO TO SINGLE.
        IF COMMAND EQUALS 'ACCOUNT' GO TO MULTIPLE.
        GO TO DEL1.
SINGLE.
        DISPLAY 'ACCOUNT:' WITH NO ADVANCING.
        ACCEPT ACCOUNT-STORE.
        DISPLAY 'SERVICE:' WITH NO ADVANCING.
        ACCEPT SERVICE-STORE.
SGL1.   READ ACCTS AT END GO TO SGL2.
        IF ACCOUNT OF ACCT-REC NOT EQUALS ACCOUNT-STORE 
       GO TO SGL3.
        IF SERVICE OF ACCT-REC NOT EQUALS SERVICE-STORE 
       GO TO SGL3.
        GO TO SGL1.
SGL3.   MOVE CORRESPONDING ACCT-REC TO ACCT-REC-1.
        WRITE ACCT-REC-1.
        GO TO SGL1.
SGL2.   CLOSE ACCTS,ACCTS1.
        OPEN OUTPUT ACCTS.
        OPEN INPUT ACCTS1.
SGL4.   READ ACCTS1 AT END GO TO SGL5.
        MOVE CORRESPONDING ACCT-REC-1 TO ACCT-REC.
        WRITE ACCT-REC.
        GO TO SGL4.
SGL5.   CLOSE ACCTS.
        CLOSE ACCTS1 WITH DELETE.
MULTIPLE.
        DISPLAY 'ACCOUNT:' WITH NO ADVANCING.
        ACCEPT ACCOUNT-STORE.
MUL1.   READ ACCTS AT END GO TO MUL2.
        IF ACCOUNT OF ACCT-REC NOT EQUALS ACCOUNT-STORE GO TO MUL3.
        GO TO MUL1.
MUL3.   MOVE CORRESPONDING ACCT-REC TO ACCT-REC-1.
        WRITE ACCT-REC-1.
        GO TO MUL1.
MUL2.   CLOSE ACCTS,ACCTS1.
        OPEN OUTPUT ACCTS.
        OPEN INPUT ACCTS1.
MUL4.   READ ACCTS1 AT END GO TO MUL5.
        MOVE CORRESPONDING ACCT-REC-1 TO ACCT-REC.
        WRITE ACCT-REC.
        GO TO MUL4.
MUL5.   CLOSE ACCTS1 WITH DELETE.
        CLOSE ACCTS.
ADDITIONS SECTION.
ADD-0.  DISPLAY 'ADDITONS.'.
        DISPLAY ' '.
        OPEN INPUT ACCTS.
        OPEN OUTPUT ACCTS1.
ADD1.   READ ACCTS AT END GO TO ADD3.
        MOVE CORRESPONDING ACCT-REC TO ACCT-REC-1.
        WRITE ACCT-REC-1.
        GO TO ADD1.
ADD3.   DISPLAY ' '.
        DISPLAY 'SALESMAN:' WITH NO ADVANCING.
        ACCEPT SALESMAN OF ACCT-REC-1.
        DISPLAY 'ANALYST:' WITH NO ADVANCING.
        ACCEPT ANALYST OF ACCT-REC-1.
        DISPLAY 'SERVICE:' WITH NO ADVANCING.
        ACCEPT SERVICE OF ACCT-REC-1.
        DISPLAY 'CODE:' WITH NO ADVANCING.
        ACCEPT KODE OF ACCT-REC-1.
        DISPLAY 'MTD:' WITH NO ADVANCING.
        ACCEPT MTD OF ACCT-REC-1.
        DISPLAY 'BASE:' WITH NO ADVANCING.
        ACCEPT BASE OF ACCT-REC-1.
        DISPLAY 'ACCOUNT:' WITH NO ADVANCING.
        ACCEPT ACCOUNT OF ACCT-REC-1.
        MOVE ZEROS TO MONTH1 OF ACCT-REC-1.
        MOVE ZEROS TO MONTH2 OF ACCT-REC-1.
        MOVE ZEROS TO MONTH3 OF ACCT-REC-1.
        MOVE ZEROS TO MONTH4 OF ACCT-REC-1.
        MOVE ZEROS TO MONTH5 OF ACCT-REC-1.
        MOVE ZEROS TO MONTH6 OF ACCT-REC-1.
        WRITE ACCT-REC-1.
        DISPLAY ' '.
        DISPLAY 'ANOTHER RECORD?' WITH NO ADVANCING.
        ACCEPT COMMAND.
        IF COMMAND EQUALS 'YES' GO TO ADD3.
        CLOSE ACCTS,ACCTS1.
        OPEN OUTPUT ACCTS.
        OPEN INPUT ACCTS1.
ADD2.   READ ACCTS1 AT END GO TO ADD4.
        MOVE CORRESPONDING ACCT-REC-1 TO ACCT-REC.
        WRITE ACCT-REC.
        GO TO ADD2.
ADD4.   CLOSE ACCTS.
        CLOSE ACCTS1 WITH DELETE.
CHANGE-BASE SECTION.
BASE-0. DISPLAY 'CHANGING BASE.'.
        DISPLAY ' '.
        OPEN INPUT ACCTS.
        OPEN OUTPUT ACCTS1.
        DISPLAY 'ACCOUNT:' WITH NO ADVANCING.
        ACCEPT ACCOUNT-STORE.
        DISPLAY 'SERVICE:' WITH NO ADVANCING.
        ACCEPT SERVICE-STORE.
BASE1.  READ ACCTS AT END GO TO BASE2.
        IF ACCOUNT OF ACCT-REC NOT EQUALS ACCOUNT-STORE
          GO TO BASE1A.
        IF SERVICE OF ACCT-REC EQUALS SERVICE-STORE
          GO TO BASE3.
BASE1A. MOVE CORRESPONDING ACCT-REC TO ACCT-REC-1.
        WRITE ACCT-REC-1.
        GO TO BASE1.
BASE3.  DISPLAY 'BASE:' WITH NO ADVANCING.
        ACCEPT BASE OF ACCT-REC.
        MOVE CORRESPONDING ACCT-REC TO ACCT-REC-1.
        WRITE ACCT-REC-1.
        GO TO BASE1.
BASE2.  CLOSE ACCTS,ACCTS1.
        OPEN OUTPUT ACCTS.
        OPEN INPUT ACCTS1.
BASE4.  READ ACCTS1 AT END GO TO BASE5.
        MOVE CORRESPONDING ACCT-REC-1 TO ACCT-REC.
        WRITE ACCT-REC.
        GO TO BASE4.
BASE5.  CLOSE ACCTS.
        CLOSE ACCTS1 WITH DELETE.
  