IDENTIFICATION DIVISION.
PROGRAM-ID. SALPG1.
AUTHOR. JOHN DOE.
INSTALLATION. ABC COMPANY, WIDGET DIVISION.
DATE-WRITTEN. 03/01/73.
DATE-COMPILED. 03/01/73.
SECURITY. NONE.
REMARKS. THIS PROGRAM WILL PRODUCE A SIMPLE REPORT OF SALARY
        AND WAGE INFORMATION.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. PDP-10.
OBJECT-COMPUTER. PDP-10.
        SEGMENT-LIMIT IS 20.
SPECIAL-NAMES.
        CHANNEL (1) IS TOP-OF-PAGE.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
        SELECT EMPLOYEE-FILE ASSIGN TO DSK
        RECORDING MODE IS ASCII.
        SELECT RATE-FILE ASSIGN TO DSK
        RECORDING MODE IS ASCII.
        SELECT SALARY-REPORT ASSIGN TO DSK
        RECORDING MODE IS ASCII.
DATA DIVISION.
FILE SECTION.
FD  EMPLOYEE-FILE
        LABEL RECORDS ARE STANDARD
        VALUE OF IDENTIFICATION IS "SALPG1EMP".
01      EMPREC.
        05 NAME   PIC X(15).
        05 EMPNUM PIC X(5).
        05 HOURS  PIC 99V9.
        05 S-CODE.
           10 S-CD-1 PIC X.
           10 S-CD-2 PIC X.
FD RATE-FILE
        LABEL RECORDS ARE STANDARD
        VALUE OF IDENTIFICATION IS "SALPG1RAT".
01      RATE-REC PIC X(7).
FD SALARY-REPORT
        LABEL RECORDS ARE STANDARD
        VALUE OF IDENTIFICATION IS "SALPG1RPT".
01      SALARY-REC PIC X(46).
WORKING-STORAGE SECTION.
77  COMPUTED-AMT PIC S9(5)V99 COMP, VALUE ZERO.
77  LINE-COUNT PIC S9(3) COMP, VALUE ZERO.
01  DATER.
        05 YR PIC XX.
        05 MO PIC XX.
        05 DA PIC XX.
        05 FILLER PIC X(6).
01  TOTAL.
        05 HOURS  PIC S9(4)V9 COMP, VALUE ZERO.
        05 AMOUNT PIC S9(6)V99 COMP, VALUE ZERO.
01  RATE-TABLE.
        05 RT-TBL OCCURS 18 TIMES INDEXED BY IDX.
           10 S-CODE.
              15 S-CD-1 PIC X.
              15 S-CD-2 PIC X.
           10 RATE  PIC S9(3)V99.
01  SALREC.
        05 NAME   PIC X(15).
        05 FILLER PIC X(3) VALUE SPACE.
        05 EMPNUM PIC X(5).
        05 FILLER PIC X(4) VALUE SPACE.
        05 HOURS  PIC ZZ.Z.
        05 FILLER PIC X(4) VALUE SPACE.
        05 S-CODE PIC XX.
        05 AMOUNT PIC $$$$$$.99.
01  HDG-1.
        05 MO     PIC XX.
        05 FILLER PIC X VALUE '/'.
        05 DA     PIC XX.
        05 FILLER PIC X VALUE '/'.
        05 YR     PIC XX.
        05 FILLER PIC X(30) VALUE
           '    WEEKLY SALARY ANALYSIS    '.
        05 FILLER PIC X